Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x90c (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x1ce): GNU C 4.8.1 -mtune=generic -march=x86-64 -g -fno-strict-aliasing -fstack-protector	
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0x9e): spec.c	
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x161): /home/yunqi/SPEC2006/benchspec/CPU2006/401.bzip2/build/build_base_amd64-m64-gcc43-nn.0000	
    <19>   DW_AT_low_pc      : 0x40110e	
    <21>   DW_AT_high_pc     : 0x1663	
    <29>   DW_AT_stmt_list   : 0x0	
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x4c): size_t	
    <32>   DW_AT_decl_file   : 2	
    <33>   DW_AT_decl_line   : 212	
    <34>   DW_AT_type        : <0x38>	
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8	
    <3a>   DW_AT_encoding    : 7	(unsigned)
    <3b>   DW_AT_name        : (indirect string, offset: 0x226): long unsigned int	
 <1><3f>: Abbrev Number: 3 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 1	
    <41>   DW_AT_encoding    : 8	(unsigned char)
    <42>   DW_AT_name        : (indirect string, offset: 0x153): unsigned char	
 <1><46>: Abbrev Number: 3 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 2	
    <48>   DW_AT_encoding    : 7	(unsigned)
    <49>   DW_AT_name        : (indirect string, offset: 0x2fc): short unsigned int	
 <1><4d>: Abbrev Number: 3 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 4	
    <4f>   DW_AT_encoding    : 7	(unsigned)
    <50>   DW_AT_name        : (indirect string, offset: 0x22b): unsigned int	
 <1><54>: Abbrev Number: 3 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 1	
    <56>   DW_AT_encoding    : 6	(signed char)
    <57>   DW_AT_name        : (indirect string, offset: 0x155): signed char	
 <1><5b>: Abbrev Number: 3 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 2	
    <5d>   DW_AT_encoding    : 5	(signed)
    <5e>   DW_AT_name        : (indirect string, offset: 0x42): short int	
 <1><62>: Abbrev Number: 4 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 4	
    <64>   DW_AT_encoding    : 5	(signed)
    <65>   DW_AT_name        : int	
 <1><69>: Abbrev Number: 3 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 8	
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0xff): long int	
 <1><70>: Abbrev Number: 2 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x35e): __off_t	
    <75>   DW_AT_decl_file   : 3	
    <76>   DW_AT_decl_line   : 140	
    <77>   DW_AT_type        : <0x69>	
 <1><7b>: Abbrev Number: 2 (DW_TAG_typedef)
    <7c>   DW_AT_name        : (indirect string, offset: 0x341): __off64_t	
    <80>   DW_AT_decl_file   : 3	
    <81>   DW_AT_decl_line   : 141	
    <82>   DW_AT_type        : <0x69>	
 <1><86>: Abbrev Number: 3 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 8	
    <88>   DW_AT_encoding    : 7	(unsigned)
    <89>   DW_AT_name        : (indirect string, offset: 0x39d): sizetype	
 <1><8d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <8e>   DW_AT_byte_size   : 8	
 <1><8f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <90>   DW_AT_byte_size   : 8	
    <91>   DW_AT_type        : <0x95>	
 <1><95>: Abbrev Number: 3 (DW_TAG_base_type)
    <96>   DW_AT_byte_size   : 1	
    <97>   DW_AT_encoding    : 6	(signed char)
    <98>   DW_AT_name        : (indirect string, offset: 0x15c): char	
 <1><9c>: Abbrev Number: 7 (DW_TAG_structure_type)
    <9d>   DW_AT_name        : (indirect string, offset: 0x2c): _IO_FILE	
    <a1>   DW_AT_byte_size   : 216	
    <a2>   DW_AT_decl_file   : 4	
    <a3>   DW_AT_decl_line   : 246	
    <a4>   DW_AT_sibling     : <0x21d>	
 <2><a8>: Abbrev Number: 8 (DW_TAG_member)
    <a9>   DW_AT_name        : (indirect string, offset: 0x87): _flags	
    <ad>   DW_AT_decl_file   : 4	
    <ae>   DW_AT_decl_line   : 247	
    <af>   DW_AT_type        : <0x62>	
    <b3>   DW_AT_data_member_location: 0	
 <2><b4>: Abbrev Number: 8 (DW_TAG_member)
    <b5>   DW_AT_name        : (indirect string, offset: 0x287): _IO_read_ptr	
    <b9>   DW_AT_decl_file   : 4	
    <ba>   DW_AT_decl_line   : 252	
    <bb>   DW_AT_type        : <0x8f>	
    <bf>   DW_AT_data_member_location: 8	
 <2><c0>: Abbrev Number: 8 (DW_TAG_member)
    <c1>   DW_AT_name        : (indirect string, offset: 0xae): _IO_read_end	
    <c5>   DW_AT_decl_file   : 4	
    <c6>   DW_AT_decl_line   : 253	
    <c7>   DW_AT_type        : <0x8f>	
    <cb>   DW_AT_data_member_location: 16	
 <2><cc>: Abbrev Number: 8 (DW_TAG_member)
    <cd>   DW_AT_name        : (indirect string, offset: 0x38f): _IO_read_base	
    <d1>   DW_AT_decl_file   : 4	
    <d2>   DW_AT_decl_line   : 254	
    <d3>   DW_AT_type        : <0x8f>	
    <d7>   DW_AT_data_member_location: 24	
 <2><d8>: Abbrev Number: 8 (DW_TAG_member)
    <d9>   DW_AT_name        : (indirect string, offset: 0x26f): _IO_write_base	
    <dd>   DW_AT_decl_file   : 4	
    <de>   DW_AT_decl_line   : 255	
    <df>   DW_AT_type        : <0x8f>	
    <e3>   DW_AT_data_member_location: 32	
 <2><e4>: Abbrev Number: 9 (DW_TAG_member)
    <e5>   DW_AT_name        : (indirect string, offset: 0x79): _IO_write_ptr	
    <e9>   DW_AT_decl_file   : 4	
    <ea>   DW_AT_decl_line   : 256	
    <ec>   DW_AT_type        : <0x8f>	
    <f0>   DW_AT_data_member_location: 40	
 <2><f1>: Abbrev Number: 9 (DW_TAG_member)
    <f2>   DW_AT_name        : (indirect string, offset: 0x333): _IO_write_end	
    <f6>   DW_AT_decl_file   : 4	
    <f7>   DW_AT_decl_line   : 257	
    <f9>   DW_AT_type        : <0x8f>	
    <fd>   DW_AT_data_member_location: 48	
 <2><fe>: Abbrev Number: 9 (DW_TAG_member)
    <ff>   DW_AT_name        : (indirect string, offset: 0x37a): _IO_buf_base	
    <103>   DW_AT_decl_file   : 4	
    <104>   DW_AT_decl_line   : 258	
    <106>   DW_AT_type        : <0x8f>	
    <10a>   DW_AT_data_member_location: 56	
 <2><10b>: Abbrev Number: 9 (DW_TAG_member)
    <10c>   DW_AT_name        : (indirect string, offset: 0x294): _IO_buf_end	
    <110>   DW_AT_decl_file   : 4	
    <111>   DW_AT_decl_line   : 259	
    <113>   DW_AT_type        : <0x8f>	
    <117>   DW_AT_data_member_location: 64	
 <2><118>: Abbrev Number: 9 (DW_TAG_member)
    <119>   DW_AT_name        : (indirect string, offset: 0x3b5): _IO_save_base	
    <11d>   DW_AT_decl_file   : 4	
    <11e>   DW_AT_decl_line   : 261	
    <120>   DW_AT_type        : <0x8f>	
    <124>   DW_AT_data_member_location: 72	
 <2><125>: Abbrev Number: 9 (DW_TAG_member)
    <126>   DW_AT_name        : (indirect string, offset: 0x2ce): _IO_backup_base	
    <12a>   DW_AT_decl_file   : 4	
    <12b>   DW_AT_decl_line   : 262	
    <12d>   DW_AT_type        : <0x8f>	
    <131>   DW_AT_data_member_location: 80	
 <2><132>: Abbrev Number: 9 (DW_TAG_member)
    <133>   DW_AT_name        : (indirect string, offset: 0x35): _IO_save_end	
    <137>   DW_AT_decl_file   : 4	
    <138>   DW_AT_decl_line   : 263	
    <13a>   DW_AT_type        : <0x8f>	
    <13e>   DW_AT_data_member_location: 88	
 <2><13f>: Abbrev Number: 9 (DW_TAG_member)
    <140>   DW_AT_name        : (indirect string, offset: 0xa5): _markers	
    <144>   DW_AT_decl_file   : 4	
    <145>   DW_AT_decl_line   : 265	
    <147>   DW_AT_type        : <0x255>	
    <14b>   DW_AT_data_member_location: 96	
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0xbb): _chain	
    <151>   DW_AT_decl_file   : 4	
    <152>   DW_AT_decl_line   : 267	
    <154>   DW_AT_type        : <0x25b>	
    <158>   DW_AT_data_member_location: 104	
 <2><159>: Abbrev Number: 9 (DW_TAG_member)
    <15a>   DW_AT_name        : (indirect string, offset: 0x34b): _fileno	
    <15e>   DW_AT_decl_file   : 4	
    <15f>   DW_AT_decl_line   : 269	
    <161>   DW_AT_type        : <0x62>	
    <165>   DW_AT_data_member_location: 112	
 <2><166>: Abbrev Number: 9 (DW_TAG_member)
    <167>   DW_AT_name        : (indirect string, offset: 0x387): _flags2	
    <16b>   DW_AT_decl_file   : 4	
    <16c>   DW_AT_decl_line   : 273	
    <16e>   DW_AT_type        : <0x62>	
    <172>   DW_AT_data_member_location: 116	
 <2><173>: Abbrev Number: 9 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0x263): _old_offset	
    <178>   DW_AT_decl_file   : 4	
    <179>   DW_AT_decl_line   : 275	
    <17b>   DW_AT_type        : <0x70>	
    <17f>   DW_AT_data_member_location: 120	
 <2><180>: Abbrev Number: 9 (DW_TAG_member)
    <181>   DW_AT_name        : (indirect string, offset: 0x11a): _cur_column	
    <185>   DW_AT_decl_file   : 4	
    <186>   DW_AT_decl_line   : 279	
    <188>   DW_AT_type        : <0x46>	
    <18c>   DW_AT_data_member_location: 128	
 <2><18d>: Abbrev Number: 9 (DW_TAG_member)
    <18e>   DW_AT_name        : (indirect string, offset: 0x3a6): _vtable_offset	
    <192>   DW_AT_decl_file   : 4	
    <193>   DW_AT_decl_line   : 280	
    <195>   DW_AT_type        : <0x54>	
    <199>   DW_AT_data_member_location: 130	
 <2><19a>: Abbrev Number: 9 (DW_TAG_member)
    <19b>   DW_AT_name        : (indirect string, offset: 0x24d): _shortbuf	
    <19f>   DW_AT_decl_file   : 4	
    <1a0>   DW_AT_decl_line   : 281	
    <1a2>   DW_AT_type        : <0x261>	
    <1a6>   DW_AT_data_member_location: 131	
 <2><1a7>: Abbrev Number: 9 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x108): _lock	
    <1ac>   DW_AT_decl_file   : 4	
    <1ad>   DW_AT_decl_line   : 285	
    <1af>   DW_AT_type        : <0x271>	
    <1b3>   DW_AT_data_member_location: 136	
 <2><1b4>: Abbrev Number: 9 (DW_TAG_member)
    <1b5>   DW_AT_name        : (indirect string, offset: 0x267): _offset	
    <1b9>   DW_AT_decl_file   : 4	
    <1ba>   DW_AT_decl_line   : 294	
    <1bc>   DW_AT_type        : <0x7b>	
    <1c0>   DW_AT_data_member_location: 144	
 <2><1c1>: Abbrev Number: 9 (DW_TAG_member)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x2ab): __pad1	
    <1c6>   DW_AT_decl_file   : 4	
    <1c7>   DW_AT_decl_line   : 303	
    <1c9>   DW_AT_type        : <0x8d>	
    <1cd>   DW_AT_data_member_location: 152	
 <2><1ce>: Abbrev Number: 9 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x2b2): __pad2	
    <1d3>   DW_AT_decl_file   : 4	
    <1d4>   DW_AT_decl_line   : 304	
    <1d6>   DW_AT_type        : <0x8d>	
    <1da>   DW_AT_data_member_location: 160	
 <2><1db>: Abbrev Number: 9 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x2b9): __pad3	
    <1e0>   DW_AT_decl_file   : 4	
    <1e1>   DW_AT_decl_line   : 305	
    <1e3>   DW_AT_type        : <0x8d>	
    <1e7>   DW_AT_data_member_location: 168	
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x2c0): __pad4	
    <1ed>   DW_AT_decl_file   : 4	
    <1ee>   DW_AT_decl_line   : 306	
    <1f0>   DW_AT_type        : <0x8d>	
    <1f4>   DW_AT_data_member_location: 176	
 <2><1f5>: Abbrev Number: 9 (DW_TAG_member)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x2c7): __pad5	
    <1fa>   DW_AT_decl_file   : 4	
    <1fb>   DW_AT_decl_line   : 307	
    <1fd>   DW_AT_type        : <0x2d>	
    <201>   DW_AT_data_member_location: 184	
 <2><202>: Abbrev Number: 9 (DW_TAG_member)
    <203>   DW_AT_name        : (indirect string, offset: 0xfde): _mode	
    <207>   DW_AT_decl_file   : 4	
    <208>   DW_AT_decl_line   : 309	
    <20a>   DW_AT_type        : <0x62>	
    <20e>   DW_AT_data_member_location: 192	
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x27e): _unused2	
    <214>   DW_AT_decl_file   : 4	
    <215>   DW_AT_decl_line   : 311	
    <217>   DW_AT_type        : <0x277>	
    <21b>   DW_AT_data_member_location: 196	
 <2><21c>: Abbrev Number: 0
 <1><21d>: Abbrev Number: 10 (DW_TAG_typedef)
    <21e>   DW_AT_name        : (indirect string, offset: 0x3e3): _IO_lock_t	
    <222>   DW_AT_decl_file   : 4	
    <223>   DW_AT_decl_line   : 155	
 <1><224>: Abbrev Number: 7 (DW_TAG_structure_type)
    <225>   DW_AT_name        : (indirect string, offset: 0x242): _IO_marker	
    <229>   DW_AT_byte_size   : 24	
    <22a>   DW_AT_decl_file   : 4	
    <22b>   DW_AT_decl_line   : 161	
    <22c>   DW_AT_sibling     : <0x255>	
 <2><230>: Abbrev Number: 8 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x2a5): _next	
    <235>   DW_AT_decl_file   : 4	
    <236>   DW_AT_decl_line   : 162	
    <237>   DW_AT_type        : <0x255>	
    <23b>   DW_AT_data_member_location: 0	
 <2><23c>: Abbrev Number: 8 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x12b): _sbuf	
    <241>   DW_AT_decl_file   : 4	
    <242>   DW_AT_decl_line   : 163	
    <243>   DW_AT_type        : <0x25b>	
    <247>   DW_AT_data_member_location: 8	
 <2><248>: Abbrev Number: 8 (DW_TAG_member)
    <249>   DW_AT_name        : (indirect string, offset: 0x3f7): _pos	
    <24d>   DW_AT_decl_file   : 4	
    <24e>   DW_AT_decl_line   : 167	
    <24f>   DW_AT_type        : <0x62>	
    <253>   DW_AT_data_member_location: 16	
 <2><254>: Abbrev Number: 0
 <1><255>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <256>   DW_AT_byte_size   : 8	
    <257>   DW_AT_type        : <0x224>	
 <1><25b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <25c>   DW_AT_byte_size   : 8	
    <25d>   DW_AT_type        : <0x9c>	
 <1><261>: Abbrev Number: 11 (DW_TAG_array_type)
    <262>   DW_AT_type        : <0x95>	
    <266>   DW_AT_sibling     : <0x271>	
 <2><26a>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <26b>   DW_AT_type        : <0x86>	
    <26f>   DW_AT_upper_bound : 0	
 <2><270>: Abbrev Number: 0
 <1><271>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <272>   DW_AT_byte_size   : 8	
    <273>   DW_AT_type        : <0x21d>	
 <1><277>: Abbrev Number: 11 (DW_TAG_array_type)
    <278>   DW_AT_type        : <0x95>	
    <27c>   DW_AT_sibling     : <0x287>	
 <2><280>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <281>   DW_AT_type        : <0x86>	
    <285>   DW_AT_upper_bound : 19	
 <2><286>: Abbrev Number: 0
 <1><287>: Abbrev Number: 3 (DW_TAG_base_type)
    <288>   DW_AT_byte_size   : 8	
    <289>   DW_AT_encoding    : 5	(signed)
    <28a>   DW_AT_name        : (indirect string, offset: 0xfa): long long int	
 <1><28e>: Abbrev Number: 3 (DW_TAG_base_type)
    <28f>   DW_AT_byte_size   : 8	
    <290>   DW_AT_encoding    : 7	(unsigned)
    <291>   DW_AT_name        : (indirect string, offset: 0x221): long long unsigned int	
 <1><295>: Abbrev Number: 7 (DW_TAG_structure_type)
    <296>   DW_AT_name        : (indirect string, offset: 0x53): spec_fd_t	
    <29a>   DW_AT_byte_size   : 24	
    <29b>   DW_AT_decl_file   : 1	
    <29c>   DW_AT_decl_line   : 45	
    <29d>   DW_AT_sibling     : <0x2d2>	
 <2><2a1>: Abbrev Number: 8 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x0): limit	
    <2a6>   DW_AT_decl_file   : 1	
    <2a7>   DW_AT_decl_line   : 46	
    <2a8>   DW_AT_type        : <0x62>	
    <2ac>   DW_AT_data_member_location: 0	
 <2><2ad>: Abbrev Number: 13 (DW_TAG_member)
    <2ae>   DW_AT_name        : len	
    <2b2>   DW_AT_decl_file   : 1	
    <2b3>   DW_AT_decl_line   : 47	
    <2b4>   DW_AT_type        : <0x62>	
    <2b8>   DW_AT_data_member_location: 4	
 <2><2b9>: Abbrev Number: 13 (DW_TAG_member)
    <2ba>   DW_AT_name        : pos	
    <2be>   DW_AT_decl_file   : 1	
    <2bf>   DW_AT_decl_line   : 48	
    <2c0>   DW_AT_type        : <0x62>	
    <2c4>   DW_AT_data_member_location: 8	
 <2><2c5>: Abbrev Number: 13 (DW_TAG_member)
    <2c6>   DW_AT_name        : buf	
    <2ca>   DW_AT_decl_file   : 1	
    <2cb>   DW_AT_decl_line   : 49	
    <2cc>   DW_AT_type        : <0x2d2>	
    <2d0>   DW_AT_data_member_location: 16	
 <2><2d1>: Abbrev Number: 0
 <1><2d2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2d3>   DW_AT_byte_size   : 8	
    <2d4>   DW_AT_type        : <0x3f>	
 <1><2d8>: Abbrev Number: 14 (DW_TAG_subprogram)
    <2d9>   DW_AT_external    : 1	
    <2d9>   DW_AT_name        : ran	
    <2dd>   DW_AT_decl_file   : 1	
    <2de>   DW_AT_decl_line   : 53	
    <2df>   DW_AT_type        : <0x322>	
    <2e3>   DW_AT_low_pc      : 0x40110e	
    <2eb>   DW_AT_high_pc     : 0xe5	
    <2f3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2f5>   DW_AT_GNU_all_call_sites: 1	
    <2f5>   DW_AT_sibling     : <0x322>	
 <2><2f9>: Abbrev Number: 15 (DW_TAG_variable)
    <2fa>   DW_AT_name        : lo	
    <2fd>   DW_AT_decl_file   : 1	
    <2fe>   DW_AT_decl_line   : 64	
    <2ff>   DW_AT_type        : <0x69>	
    <303>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><306>: Abbrev Number: 15 (DW_TAG_variable)
    <307>   DW_AT_name        : hi	
    <30a>   DW_AT_decl_file   : 1	
    <30b>   DW_AT_decl_line   : 65	
    <30c>   DW_AT_type        : <0x69>	
    <310>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><313>: Abbrev Number: 16 (DW_TAG_variable)
    <314>   DW_AT_name        : (indirect string, offset: 0x2f7): test	
    <318>   DW_AT_decl_file   : 1	
    <319>   DW_AT_decl_line   : 66	
    <31a>   DW_AT_type        : <0x69>	
    <31e>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><321>: Abbrev Number: 0
 <1><322>: Abbrev Number: 3 (DW_TAG_base_type)
    <323>   DW_AT_byte_size   : 8	
    <324>   DW_AT_encoding    : 4	(float)
    <325>   DW_AT_name        : (indirect string, offset: 0x825): double	
 <1><329>: Abbrev Number: 17 (DW_TAG_subprogram)
    <32a>   DW_AT_external    : 1	
    <32a>   DW_AT_name        : (indirect string, offset: 0x6f): spec_init	
    <32e>   DW_AT_decl_file   : 1	
    <32f>   DW_AT_decl_line   : 80	
    <330>   DW_AT_type        : <0x62>	
    <334>   DW_AT_low_pc      : 0x4011f3	
    <33c>   DW_AT_high_pc     : 0x14b	
    <344>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <346>   DW_AT_GNU_all_tail_call_sites: 1	
    <346>   DW_AT_sibling     : <0x383>	
 <2><34a>: Abbrev Number: 15 (DW_TAG_variable)
    <34b>   DW_AT_name        : i	
    <34d>   DW_AT_decl_file   : 1	
    <34e>   DW_AT_decl_line   : 81	
    <34f>   DW_AT_type        : <0x62>	
    <353>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><356>: Abbrev Number: 15 (DW_TAG_variable)
    <357>   DW_AT_name        : j	
    <359>   DW_AT_decl_file   : 1	
    <35a>   DW_AT_decl_line   : 81	
    <35b>   DW_AT_type        : <0x62>	
    <35f>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><362>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <363>   DW_AT_low_pc      : 0x40121c	
    <36b>   DW_AT_high_pc     : 0x10d	
 <3><373>: Abbrev Number: 16 (DW_TAG_variable)
    <374>   DW_AT_name        : (indirect string, offset: 0x0): limit	
    <378>   DW_AT_decl_file   : 1	
    <379>   DW_AT_decl_line   : 88	
    <37a>   DW_AT_type        : <0x62>	
    <37e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><381>: Abbrev Number: 0
 <2><382>: Abbrev Number: 0
 <1><383>: Abbrev Number: 19 (DW_TAG_subprogram)
    <384>   DW_AT_external    : 1	
    <384>   DW_AT_name        : (indirect string, offset: 0x131): spec_random_load	
    <388>   DW_AT_decl_file   : 1	
    <389>   DW_AT_decl_line   : 103	
    <38a>   DW_AT_prototyped  : 1	
    <38a>   DW_AT_type        : <0x62>	
    <38e>   DW_AT_low_pc      : 0x40133e	
    <396>   DW_AT_high_pc     : 0x1c1	
    <39e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3a0>   DW_AT_GNU_all_tail_call_sites: 1	
    <3a0>   DW_AT_sibling     : <0x3e4>	
 <2><3a4>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <3a5>   DW_AT_name        : fd	
    <3a8>   DW_AT_decl_file   : 1	
    <3a9>   DW_AT_decl_line   : 103	
    <3aa>   DW_AT_type        : <0x62>	
    <3ae>   DW_AT_location    : 5 byte block: 91 cc ff ff 7d 	(DW_OP_fbreg: -4194356)
 <2><3b4>: Abbrev Number: 15 (DW_TAG_variable)
    <3b5>   DW_AT_name        : i	
    <3b7>   DW_AT_decl_file   : 1	
    <3b8>   DW_AT_decl_line   : 110	
    <3b9>   DW_AT_type        : <0x62>	
    <3bd>   DW_AT_location    : 5 byte block: 91 d8 ff ff 7d 	(DW_OP_fbreg: -4194344)
 <2><3c3>: Abbrev Number: 15 (DW_TAG_variable)
    <3c4>   DW_AT_name        : j	
    <3c6>   DW_AT_decl_file   : 1	
    <3c7>   DW_AT_decl_line   : 110	
    <3c8>   DW_AT_type        : <0x62>	
    <3cc>   DW_AT_location    : 5 byte block: 91 dc ff ff 7d 	(DW_OP_fbreg: -4194340)
 <2><3d2>: Abbrev Number: 16 (DW_TAG_variable)
    <3d3>   DW_AT_name        : (indirect string, offset: 0x257): random_text	
    <3d7>   DW_AT_decl_file   : 1	
    <3d8>   DW_AT_decl_line   : 111	
    <3d9>   DW_AT_type        : <0x3e4>	
    <3dd>   DW_AT_location    : 5 byte block: 91 e0 ff ff 7d 	(DW_OP_fbreg: -4194336)
 <2><3e3>: Abbrev Number: 0
 <1><3e4>: Abbrev Number: 11 (DW_TAG_array_type)
    <3e5>   DW_AT_type        : <0x95>	
    <3e9>   DW_AT_sibling     : <0x3fd>	
 <2><3ed>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <3ee>   DW_AT_type        : <0x86>	
    <3f2>   DW_AT_upper_bound : 31	
 <2><3f3>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <3f4>   DW_AT_type        : <0x86>	
    <3f8>   DW_AT_upper_bound : 0x1ffff	
 <2><3fc>: Abbrev Number: 0
 <1><3fd>: Abbrev Number: 19 (DW_TAG_subprogram)
    <3fe>   DW_AT_external    : 1	
    <3fe>   DW_AT_name        : (indirect string, offset: 0x3ce): spec_load	
    <402>   DW_AT_decl_file   : 1	
    <403>   DW_AT_decl_line   : 132	
    <404>   DW_AT_prototyped  : 1	
    <404>   DW_AT_type        : <0x62>	
    <408>   DW_AT_low_pc      : 0x4014ff	
    <410>   DW_AT_high_pc     : 0x30b	
    <418>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <41a>   DW_AT_GNU_all_tail_call_sites: 1	
    <41a>   DW_AT_sibling     : <0x48f>	
 <2><41e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <41f>   DW_AT_name        : num	
    <423>   DW_AT_decl_file   : 1	
    <424>   DW_AT_decl_line   : 132	
    <425>   DW_AT_type        : <0x62>	
    <429>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><42c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <42d>   DW_AT_name        : (indirect string, offset: 0xc2): filename	
    <431>   DW_AT_decl_file   : 1	
    <432>   DW_AT_decl_line   : 132	
    <433>   DW_AT_type        : <0x8f>	
    <437>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><43a>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <43b>   DW_AT_name        : (indirect string, offset: 0x27): size	
    <43f>   DW_AT_decl_file   : 1	
    <440>   DW_AT_decl_line   : 132	
    <441>   DW_AT_type        : <0x62>	
    <445>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><448>: Abbrev Number: 15 (DW_TAG_variable)
    <449>   DW_AT_name        : fd	
    <44c>   DW_AT_decl_file   : 1	
    <44d>   DW_AT_decl_line   : 134	
    <44e>   DW_AT_type        : <0x62>	
    <452>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><455>: Abbrev Number: 15 (DW_TAG_variable)
    <456>   DW_AT_name        : rc	
    <459>   DW_AT_decl_file   : 1	
    <45a>   DW_AT_decl_line   : 134	
    <45b>   DW_AT_type        : <0x62>	
    <45f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><462>: Abbrev Number: 15 (DW_TAG_variable)
    <463>   DW_AT_name        : i	
    <465>   DW_AT_decl_file   : 1	
    <466>   DW_AT_decl_line   : 134	
    <467>   DW_AT_type        : <0x62>	
    <46b>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><46e>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <46f>   DW_AT_low_pc      : 0x4016ae	
    <477>   DW_AT_high_pc     : 0x130	
 <3><47f>: Abbrev Number: 15 (DW_TAG_variable)
    <480>   DW_AT_name        : tmp	
    <484>   DW_AT_decl_file   : 1	
    <485>   DW_AT_decl_line   : 155	
    <486>   DW_AT_type        : <0x62>	
    <48a>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><48d>: Abbrev Number: 0
 <2><48e>: Abbrev Number: 0
 <1><48f>: Abbrev Number: 19 (DW_TAG_subprogram)
    <490>   DW_AT_external    : 1	
    <490>   DW_AT_name        : (indirect string, offset: 0xe9): spec_read	
    <494>   DW_AT_decl_file   : 1	
    <495>   DW_AT_decl_line   : 164	
    <496>   DW_AT_prototyped  : 1	
    <496>   DW_AT_type        : <0x62>	
    <49a>   DW_AT_low_pc      : 0x40180a	
    <4a2>   DW_AT_high_pc     : 0x203	
    <4aa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4ac>   DW_AT_GNU_all_tail_call_sites: 1	
    <4ac>   DW_AT_sibling     : <0x4e7>	
 <2><4b0>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <4b1>   DW_AT_name        : fd	
    <4b4>   DW_AT_decl_file   : 1	
    <4b5>   DW_AT_decl_line   : 164	
    <4b6>   DW_AT_type        : <0x62>	
    <4ba>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><4bd>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <4be>   DW_AT_name        : buf	
    <4c2>   DW_AT_decl_file   : 1	
    <4c3>   DW_AT_decl_line   : 164	
    <4c4>   DW_AT_type        : <0x2d2>	
    <4c8>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><4cb>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <4cc>   DW_AT_name        : (indirect string, offset: 0x27): size	
    <4d0>   DW_AT_decl_file   : 1	
    <4d1>   DW_AT_decl_line   : 164	
    <4d2>   DW_AT_type        : <0x62>	
    <4d6>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><4d9>: Abbrev Number: 15 (DW_TAG_variable)
    <4da>   DW_AT_name        : rc	
    <4dd>   DW_AT_decl_file   : 1	
    <4de>   DW_AT_decl_line   : 165	
    <4df>   DW_AT_type        : <0x62>	
    <4e3>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><4e6>: Abbrev Number: 0
 <1><4e7>: Abbrev Number: 19 (DW_TAG_subprogram)
    <4e8>   DW_AT_external    : 1	
    <4e8>   DW_AT_name        : (indirect string, offset: 0x64): spec_fread	
    <4ec>   DW_AT_decl_file   : 1	
    <4ed>   DW_AT_decl_line   : 185	
    <4ee>   DW_AT_prototyped  : 1	
    <4ee>   DW_AT_type        : <0x62>	
    <4f2>   DW_AT_low_pc      : 0x401a0d	
    <4fa>   DW_AT_high_pc     : 0x21d	
    <502>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <504>   DW_AT_GNU_all_tail_call_sites: 1	
    <504>   DW_AT_sibling     : <0x54d>	
 <2><508>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <509>   DW_AT_name        : buf	
    <50d>   DW_AT_decl_file   : 1	
    <50e>   DW_AT_decl_line   : 185	
    <50f>   DW_AT_type        : <0x2d2>	
    <513>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><516>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <517>   DW_AT_name        : (indirect string, offset: 0x27): size	
    <51b>   DW_AT_decl_file   : 1	
    <51c>   DW_AT_decl_line   : 185	
    <51d>   DW_AT_type        : <0x62>	
    <521>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><524>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <525>   DW_AT_name        : num	
    <529>   DW_AT_decl_file   : 1	
    <52a>   DW_AT_decl_line   : 185	
    <52b>   DW_AT_type        : <0x62>	
    <52f>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><532>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <533>   DW_AT_name        : fd	
    <536>   DW_AT_decl_file   : 1	
    <537>   DW_AT_decl_line   : 185	
    <538>   DW_AT_type        : <0x62>	
    <53c>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><53f>: Abbrev Number: 15 (DW_TAG_variable)
    <540>   DW_AT_name        : rc	
    <543>   DW_AT_decl_file   : 1	
    <544>   DW_AT_decl_line   : 186	
    <545>   DW_AT_type        : <0x62>	
    <549>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><54c>: Abbrev Number: 0
 <1><54d>: Abbrev Number: 19 (DW_TAG_subprogram)
    <54e>   DW_AT_external    : 1	
    <54e>   DW_AT_name        : (indirect string, offset: 0x238): spec_getc	
    <552>   DW_AT_decl_file   : 1	
    <553>   DW_AT_decl_line   : 206	
    <554>   DW_AT_prototyped  : 1	
    <554>   DW_AT_type        : <0x62>	
    <558>   DW_AT_low_pc      : 0x401c2a	
    <560>   DW_AT_high_pc     : 0x142	
    <568>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <56a>   DW_AT_GNU_all_tail_call_sites: 1	
    <56a>   DW_AT_sibling     : <0x589>	
 <2><56e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <56f>   DW_AT_name        : fd	
    <572>   DW_AT_decl_file   : 1	
    <573>   DW_AT_decl_line   : 206	
    <574>   DW_AT_type        : <0x62>	
    <578>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><57b>: Abbrev Number: 15 (DW_TAG_variable)
    <57c>   DW_AT_name        : rc	
    <57f>   DW_AT_decl_file   : 1	
    <580>   DW_AT_decl_line   : 207	
    <581>   DW_AT_type        : <0x62>	
    <585>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><588>: Abbrev Number: 0
 <1><589>: Abbrev Number: 19 (DW_TAG_subprogram)
    <58a>   DW_AT_external    : 1	
    <58a>   DW_AT_name        : (indirect string, offset: 0x10e): spec_ungetc	
    <58e>   DW_AT_decl_file   : 1	
    <58f>   DW_AT_decl_line   : 221	
    <590>   DW_AT_prototyped  : 1	
    <590>   DW_AT_type        : <0x62>	
    <594>   DW_AT_low_pc      : 0x401d6c	
    <59c>   DW_AT_high_pc     : 0x18e	
    <5a4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5a6>   DW_AT_GNU_all_tail_call_sites: 1	
    <5a6>   DW_AT_sibling     : <0x5d2>	
 <2><5aa>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5ab>   DW_AT_name        : ch	
    <5ae>   DW_AT_decl_file   : 1	
    <5af>   DW_AT_decl_line   : 221	
    <5b0>   DW_AT_type        : <0x3f>	
    <5b4>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><5b7>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5b8>   DW_AT_name        : fd	
    <5bb>   DW_AT_decl_file   : 1	
    <5bc>   DW_AT_decl_line   : 221	
    <5bd>   DW_AT_type        : <0x62>	
    <5c1>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><5c4>: Abbrev Number: 15 (DW_TAG_variable)
    <5c5>   DW_AT_name        : rc	
    <5c8>   DW_AT_decl_file   : 1	
    <5c9>   DW_AT_decl_line   : 222	
    <5ca>   DW_AT_type        : <0x62>	
    <5ce>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><5d1>: Abbrev Number: 0
 <1><5d2>: Abbrev Number: 23 (DW_TAG_subprogram)
    <5d3>   DW_AT_external    : 1	
    <5d3>   DW_AT_name        : (indirect string, offset: 0xd5): spec_rewind	
    <5d7>   DW_AT_decl_file   : 1	
    <5d8>   DW_AT_decl_line   : 239	
    <5d9>   DW_AT_prototyped  : 1	
    <5d9>   DW_AT_type        : <0x62>	
    <5dd>   DW_AT_low_pc      : 0x401efa	
    <5e5>   DW_AT_high_pc     : 0x2e	
    <5ed>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5ef>   DW_AT_GNU_all_call_sites: 1	
    <5ef>   DW_AT_sibling     : <0x601>	
 <2><5f3>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5f4>   DW_AT_name        : fd	
    <5f7>   DW_AT_decl_file   : 1	
    <5f8>   DW_AT_decl_line   : 239	
    <5f9>   DW_AT_type        : <0x62>	
    <5fd>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><600>: Abbrev Number: 0
 <1><601>: Abbrev Number: 19 (DW_TAG_subprogram)
    <602>   DW_AT_external    : 1	
    <602>   DW_AT_name        : (indirect string, offset: 0x148): spec_reset	
    <606>   DW_AT_decl_file   : 1	
    <607>   DW_AT_decl_line   : 243	
    <608>   DW_AT_prototyped  : 1	
    <608>   DW_AT_type        : <0x62>	
    <60c>   DW_AT_low_pc      : 0x401f28	
    <614>   DW_AT_high_pc     : 0xb5	
    <61c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <61e>   DW_AT_GNU_all_tail_call_sites: 1	
    <61e>   DW_AT_sibling     : <0x630>	
 <2><622>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <623>   DW_AT_name        : fd	
    <626>   DW_AT_decl_file   : 1	
    <627>   DW_AT_decl_line   : 243	
    <628>   DW_AT_type        : <0x62>	
    <62c>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><62f>: Abbrev Number: 0
 <1><630>: Abbrev Number: 19 (DW_TAG_subprogram)
    <631>   DW_AT_external    : 1	
    <631>   DW_AT_name        : (indirect string, offset: 0x2de): spec_write	
    <635>   DW_AT_decl_file   : 1	
    <636>   DW_AT_decl_line   : 249	
    <637>   DW_AT_prototyped  : 1	
    <637>   DW_AT_type        : <0x62>	
    <63b>   DW_AT_low_pc      : 0x401fdd	
    <643>   DW_AT_high_pc     : 0x157	
    <64b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <64d>   DW_AT_GNU_all_tail_call_sites: 1	
    <64d>   DW_AT_sibling     : <0x67b>	
 <2><651>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <652>   DW_AT_name        : fd	
    <655>   DW_AT_decl_file   : 1	
    <656>   DW_AT_decl_line   : 249	
    <657>   DW_AT_type        : <0x62>	
    <65b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><65e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <65f>   DW_AT_name        : buf	
    <663>   DW_AT_decl_file   : 1	
    <664>   DW_AT_decl_line   : 249	
    <665>   DW_AT_type        : <0x2d2>	
    <669>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><66c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <66d>   DW_AT_name        : (indirect string, offset: 0x27): size	
    <671>   DW_AT_decl_file   : 1	
    <672>   DW_AT_decl_line   : 249	
    <673>   DW_AT_type        : <0x62>	
    <677>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><67a>: Abbrev Number: 0
 <1><67b>: Abbrev Number: 24 (DW_TAG_subprogram)
    <67c>   DW_AT_external    : 1	
    <67c>   DW_AT_name        : (indirect string, offset: 0x6): spec_fwrite	
    <680>   DW_AT_decl_file   : 1	
    <681>   DW_AT_decl_line   : 261	
    <683>   DW_AT_prototyped  : 1	
    <683>   DW_AT_type        : <0x62>	
    <687>   DW_AT_low_pc      : 0x402134	
    <68f>   DW_AT_high_pc     : 0x16d	
    <697>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <699>   DW_AT_GNU_all_tail_call_sites: 1	
    <699>   DW_AT_sibling     : <0x6d9>	
 <2><69d>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <69e>   DW_AT_name        : buf	
    <6a2>   DW_AT_decl_file   : 1	
    <6a3>   DW_AT_decl_line   : 261	
    <6a5>   DW_AT_type        : <0x2d2>	
    <6a9>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><6ac>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <6ad>   DW_AT_name        : (indirect string, offset: 0x27): size	
    <6b1>   DW_AT_decl_file   : 1	
    <6b2>   DW_AT_decl_line   : 261	
    <6b4>   DW_AT_type        : <0x62>	
    <6b8>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><6bb>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <6bc>   DW_AT_name        : num	
    <6c0>   DW_AT_decl_file   : 1	
    <6c1>   DW_AT_decl_line   : 261	
    <6c3>   DW_AT_type        : <0x62>	
    <6c7>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><6ca>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <6cb>   DW_AT_name        : fd	
    <6ce>   DW_AT_decl_file   : 1	
    <6cf>   DW_AT_decl_line   : 261	
    <6d1>   DW_AT_type        : <0x62>	
    <6d5>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><6d8>: Abbrev Number: 0
 <1><6d9>: Abbrev Number: 24 (DW_TAG_subprogram)
    <6da>   DW_AT_external    : 1	
    <6da>   DW_AT_name        : (indirect string, offset: 0x12): spec_putc	
    <6de>   DW_AT_decl_file   : 1	
    <6df>   DW_AT_decl_line   : 273	
    <6e1>   DW_AT_prototyped  : 1	
    <6e1>   DW_AT_type        : <0x62>	
    <6e5>   DW_AT_low_pc      : 0x4022a1	
    <6ed>   DW_AT_high_pc     : 0x104	
    <6f5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6f7>   DW_AT_GNU_all_tail_call_sites: 1	
    <6f7>   DW_AT_sibling     : <0x718>	
 <2><6fb>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <6fc>   DW_AT_name        : ch	
    <6ff>   DW_AT_decl_file   : 1	
    <700>   DW_AT_decl_line   : 273	
    <702>   DW_AT_type        : <0x3f>	
    <706>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><709>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <70a>   DW_AT_name        : fd	
    <70d>   DW_AT_decl_file   : 1	
    <70e>   DW_AT_decl_line   : 273	
    <710>   DW_AT_type        : <0x62>	
    <714>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><717>: Abbrev Number: 0
 <1><718>: Abbrev Number: 24 (DW_TAG_subprogram)
    <719>   DW_AT_external    : 1	
    <719>   DW_AT_name        : (indirect string, offset: 0x2a0): main	
    <71d>   DW_AT_decl_file   : 1	
    <71e>   DW_AT_decl_line   : 286	
    <720>   DW_AT_prototyped  : 1	
    <720>   DW_AT_type        : <0x62>	
    <724>   DW_AT_low_pc      : 0x4023a5	
    <72c>   DW_AT_high_pc     : 0x33f	
    <734>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <736>   DW_AT_GNU_all_tail_call_sites: 1	
    <736>   DW_AT_sibling     : <0x7b1>	
 <2><73a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <73b>   DW_AT_name        : (indirect string, offset: 0x1c9): argc	
    <73f>   DW_AT_decl_file   : 1	
    <740>   DW_AT_decl_line   : 286	
    <742>   DW_AT_type        : <0x62>	
    <746>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><749>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <74a>   DW_AT_name        : (indirect string, offset: 0x126): argv	
    <74e>   DW_AT_decl_file   : 1	
    <74f>   DW_AT_decl_line   : 286	
    <751>   DW_AT_type        : <0x7b1>	
    <755>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><758>: Abbrev Number: 27 (DW_TAG_variable)
    <759>   DW_AT_name        : i	
    <75b>   DW_AT_decl_file   : 1	
    <75c>   DW_AT_decl_line   : 287	
    <75e>   DW_AT_type        : <0x62>	
    <762>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><765>: Abbrev Number: 28 (DW_TAG_variable)
    <766>   DW_AT_name        : (indirect string, offset: 0x366): level	
    <76a>   DW_AT_decl_file   : 1	
    <76b>   DW_AT_decl_line   : 287	
    <76d>   DW_AT_type        : <0x62>	
    <771>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><774>: Abbrev Number: 28 (DW_TAG_variable)
    <775>   DW_AT_name        : (indirect string, offset: 0x3d8): input_size	
    <779>   DW_AT_decl_file   : 1	
    <77a>   DW_AT_decl_line   : 288	
    <77c>   DW_AT_type        : <0x62>	
    <780>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><783>: Abbrev Number: 28 (DW_TAG_variable)
    <784>   DW_AT_name        : (indirect string, offset: 0x1c): compressed_size	
    <788>   DW_AT_decl_file   : 1	
    <789>   DW_AT_decl_line   : 288	
    <78b>   DW_AT_type        : <0x62>	
    <78f>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><792>: Abbrev Number: 28 (DW_TAG_variable)
    <793>   DW_AT_name        : (indirect string, offset: 0x3c3): input_name	
    <797>   DW_AT_decl_file   : 1	
    <798>   DW_AT_decl_line   : 289	
    <79a>   DW_AT_type        : <0x8f>	
    <79e>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><7a1>: Abbrev Number: 28 (DW_TAG_variable)
    <7a2>   DW_AT_name        : (indirect string, offset: 0x324): validate_array	
    <7a6>   DW_AT_decl_file   : 1	
    <7a7>   DW_AT_decl_line   : 290	
    <7a9>   DW_AT_type        : <0x2d2>	
    <7ad>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><7b0>: Abbrev Number: 0
 <1><7b1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <7b2>   DW_AT_byte_size   : 8	
    <7b3>   DW_AT_type        : <0x8f>	
 <1><7b7>: Abbrev Number: 29 (DW_TAG_subprogram)
    <7b8>   DW_AT_external    : 1	
    <7b8>   DW_AT_name        : (indirect string, offset: 0x36c): spec_initbufs	
    <7bc>   DW_AT_decl_file   : 1	
    <7bd>   DW_AT_decl_line   : 388	
    <7bf>   DW_AT_low_pc      : 0x4026e4	
    <7c7>   DW_AT_high_pc     : 0x2b	
    <7cf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7d1>   DW_AT_GNU_all_call_sites: 1	
 <1><7d1>: Abbrev Number: 30 (DW_TAG_subprogram)
    <7d2>   DW_AT_external    : 1	
    <7d2>   DW_AT_name        : (indirect string, offset: 0x2e9): spec_compress	
    <7d6>   DW_AT_decl_file   : 1	
    <7d7>   DW_AT_decl_line   : 396	
    <7d9>   DW_AT_prototyped  : 1	
    <7d9>   DW_AT_low_pc      : 0x40270f	
    <7e1>   DW_AT_high_pc     : 0x2b	
    <7e9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7eb>   DW_AT_GNU_all_tail_call_sites: 1	
    <7eb>   DW_AT_sibling     : <0x81c>	
 <2><7ef>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <7f0>   DW_AT_name        : in	
    <7f3>   DW_AT_decl_file   : 1	
    <7f4>   DW_AT_decl_line   : 396	
    <7f6>   DW_AT_type        : <0x62>	
    <7fa>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7fd>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <7fe>   DW_AT_name        : out	
    <802>   DW_AT_decl_file   : 1	
    <803>   DW_AT_decl_line   : 396	
    <805>   DW_AT_type        : <0x62>	
    <809>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><80c>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <80d>   DW_AT_name        : lev	
    <811>   DW_AT_decl_file   : 1	
    <812>   DW_AT_decl_line   : 396	
    <814>   DW_AT_type        : <0x62>	
    <818>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><81b>: Abbrev Number: 0
 <1><81c>: Abbrev Number: 30 (DW_TAG_subprogram)
    <81d>   DW_AT_external    : 1	
    <81d>   DW_AT_name        : (indirect string, offset: 0x8e): spec_uncompress	
    <821>   DW_AT_decl_file   : 1	
    <822>   DW_AT_decl_line   : 400	
    <824>   DW_AT_prototyped  : 1	
    <824>   DW_AT_low_pc      : 0x40273a	
    <82c>   DW_AT_high_pc     : 0x2c	
    <834>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <836>   DW_AT_GNU_all_tail_call_sites: 1	
    <836>   DW_AT_sibling     : <0x867>	
 <2><83a>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <83b>   DW_AT_name        : in	
    <83e>   DW_AT_decl_file   : 1	
    <83f>   DW_AT_decl_line   : 400	
    <841>   DW_AT_type        : <0x62>	
    <845>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><848>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <849>   DW_AT_name        : out	
    <84d>   DW_AT_decl_file   : 1	
    <84e>   DW_AT_decl_line   : 400	
    <850>   DW_AT_type        : <0x62>	
    <854>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><857>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <858>   DW_AT_name        : lev	
    <85c>   DW_AT_decl_file   : 1	
    <85d>   DW_AT_decl_line   : 400	
    <85f>   DW_AT_type        : <0x62>	
    <863>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><866>: Abbrev Number: 0
 <1><867>: Abbrev Number: 31 (DW_TAG_subprogram)
    <868>   DW_AT_external    : 1	
    <868>   DW_AT_name        : (indirect string, offset: 0x30f): debug_time	
    <86c>   DW_AT_decl_file   : 1	
    <86d>   DW_AT_decl_line   : 408	
    <86f>   DW_AT_type        : <0x62>	
    <873>   DW_AT_low_pc      : 0x402766	
    <87b>   DW_AT_high_pc     : 0xb	
    <883>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <885>   DW_AT_GNU_all_call_sites: 1	
 <1><885>: Abbrev Number: 32 (DW_TAG_variable)
    <886>   DW_AT_name        : (indirect string, offset: 0xf3): stderr	
    <88a>   DW_AT_decl_file   : 5	
    <88b>   DW_AT_decl_line   : 170	
    <88c>   DW_AT_type        : <0x25b>	
    <890>   DW_AT_external    : 1	
    <890>   DW_AT_declaration : 1	
 <1><890>: Abbrev Number: 33 (DW_TAG_variable)
    <891>   DW_AT_name        : (indirect string, offset: 0x5d): dbglvl	
    <895>   DW_AT_decl_file   : 1	
    <896>   DW_AT_decl_line   : 28	
    <897>   DW_AT_type        : <0x62>	
    <89b>   DW_AT_external    : 1	
    <89b>   DW_AT_location    : 9 byte block: 3 90 e0 6d 0 0 0 0 0 	(DW_OP_addr: 6de090)
 <1><8a5>: Abbrev Number: 11 (DW_TAG_array_type)
    <8a6>   DW_AT_type        : <0x295>	
    <8aa>   DW_AT_sibling     : <0x8b5>	
 <2><8ae>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <8af>   DW_AT_type        : <0x86>	
    <8b3>   DW_AT_upper_bound : 2	
 <2><8b4>: Abbrev Number: 0
 <1><8b5>: Abbrev Number: 33 (DW_TAG_variable)
    <8b6>   DW_AT_name        : (indirect string, offset: 0xe1): spec_fd	
    <8ba>   DW_AT_decl_file   : 1	
    <8bb>   DW_AT_decl_line   : 50	
    <8bc>   DW_AT_type        : <0x8a5>	
    <8c0>   DW_AT_external    : 1	
    <8c0>   DW_AT_location    : 9 byte block: 3 60 27 6e 0 0 0 0 0 	(DW_OP_addr: 6e2760)
 <1><8ca>: Abbrev Number: 33 (DW_TAG_variable)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x142): seedi	
    <8cf>   DW_AT_decl_file   : 1	
    <8d0>   DW_AT_decl_line   : 52	
    <8d1>   DW_AT_type        : <0x69>	
    <8d5>   DW_AT_external    : 1	
    <8d5>   DW_AT_location    : 9 byte block: 3 40 27 6e 0 0 0 0 0 	(DW_OP_addr: 6e2740)
 <1><8df>: Abbrev Number: 34 (DW_TAG_variable)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x31a): smallMode	
    <8e4>   DW_AT_decl_file   : 1	
    <8e5>   DW_AT_decl_line   : 384	
    <8e7>   DW_AT_type        : <0x3f>	
    <8eb>   DW_AT_external    : 1	
    <8eb>   DW_AT_declaration : 1	
 <1><8eb>: Abbrev Number: 34 (DW_TAG_variable)
    <8ec>   DW_AT_name        : (indirect string, offset: 0xcb): verbosity	
    <8f0>   DW_AT_decl_file   : 1	
    <8f1>   DW_AT_decl_line   : 385	
    <8f3>   DW_AT_type        : <0x62>	
    <8f7>   DW_AT_external    : 1	
    <8f7>   DW_AT_declaration : 1	
 <1><8f7>: Abbrev Number: 34 (DW_TAG_variable)
    <8f8>   DW_AT_name        : (indirect string, offset: 0x353): workFactor	
    <8fc>   DW_AT_decl_file   : 1	
    <8fd>   DW_AT_decl_line   : 387	
    <8ff>   DW_AT_type        : <0x62>	
    <903>   DW_AT_external    : 1	
    <903>   DW_AT_declaration : 1	
 <1><903>: Abbrev Number: 34 (DW_TAG_variable)
    <904>   DW_AT_name        : (indirect string, offset: 0x1bb): blockSize100k	
    <908>   DW_AT_decl_file   : 1	
    <909>   DW_AT_decl_line   : 387	
    <90b>   DW_AT_type        : <0x62>	
    <90f>   DW_AT_external    : 1	
    <90f>   DW_AT_declaration : 1	
 <1><90f>: Abbrev Number: 0
  Compilation Unit @ offset 0x910:
   Length:        0x1326 (32-bit)
   Version:       4
   Abbrev Offset: 0x22d
   Pointer Size:  8
 <0><91b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <91c>   DW_AT_producer    : (indirect string, offset: 0x1ce): GNU C 4.8.1 -mtune=generic -march=x86-64 -g -fno-strict-aliasing -fstack-protector	
    <920>   DW_AT_language    : 1	(ANSI C)
    <921>   DW_AT_name        : (indirect string, offset: 0x655): blocksort.c	
    <925>   DW_AT_comp_dir    : (indirect string, offset: 0x161): /home/yunqi/SPEC2006/benchspec/CPU2006/401.bzip2/build/build_base_amd64-m64-gcc43-nn.0000	
    <929>   DW_AT_low_pc      : 0x402771	
    <931>   DW_AT_high_pc     : 0x3ce3	
    <939>   DW_AT_stmt_list   : 0x396	
 <1><93d>: Abbrev Number: 2 (DW_TAG_typedef)
    <93e>   DW_AT_name        : (indirect string, offset: 0x4c): size_t	
    <942>   DW_AT_decl_file   : 2	
    <943>   DW_AT_decl_line   : 212	
    <944>   DW_AT_type        : <0x948>	
 <1><948>: Abbrev Number: 3 (DW_TAG_base_type)
    <949>   DW_AT_byte_size   : 8	
    <94a>   DW_AT_encoding    : 7	(unsigned)
    <94b>   DW_AT_name        : (indirect string, offset: 0x226): long unsigned int	
 <1><94f>: Abbrev Number: 4 (DW_TAG_base_type)
    <950>   DW_AT_byte_size   : 4	
    <951>   DW_AT_encoding    : 5	(signed)
    <952>   DW_AT_name        : int	
 <1><956>: Abbrev Number: 3 (DW_TAG_base_type)
    <957>   DW_AT_byte_size   : 1	
    <958>   DW_AT_encoding    : 8	(unsigned char)
    <959>   DW_AT_name        : (indirect string, offset: 0x153): unsigned char	
 <1><95d>: Abbrev Number: 3 (DW_TAG_base_type)
    <95e>   DW_AT_byte_size   : 2	
    <95f>   DW_AT_encoding    : 7	(unsigned)
    <960>   DW_AT_name        : (indirect string, offset: 0x2fc): short unsigned int	
 <1><964>: Abbrev Number: 3 (DW_TAG_base_type)
    <965>   DW_AT_byte_size   : 4	
    <966>   DW_AT_encoding    : 7	(unsigned)
    <967>   DW_AT_name        : (indirect string, offset: 0x22b): unsigned int	
 <1><96b>: Abbrev Number: 3 (DW_TAG_base_type)
    <96c>   DW_AT_byte_size   : 1	
    <96d>   DW_AT_encoding    : 6	(signed char)
    <96e>   DW_AT_name        : (indirect string, offset: 0x155): signed char	
 <1><972>: Abbrev Number: 3 (DW_TAG_base_type)
    <973>   DW_AT_byte_size   : 2	
    <974>   DW_AT_encoding    : 5	(signed)
    <975>   DW_AT_name        : (indirect string, offset: 0x42): short int	
 <1><979>: Abbrev Number: 3 (DW_TAG_base_type)
    <97a>   DW_AT_byte_size   : 8	
    <97b>   DW_AT_encoding    : 5	(signed)
    <97c>   DW_AT_name        : (indirect string, offset: 0xff): long int	
 <1><980>: Abbrev Number: 2 (DW_TAG_typedef)
    <981>   DW_AT_name        : (indirect string, offset: 0x35e): __off_t	
    <985>   DW_AT_decl_file   : 3	
    <986>   DW_AT_decl_line   : 140	
    <987>   DW_AT_type        : <0x979>	
 <1><98b>: Abbrev Number: 2 (DW_TAG_typedef)
    <98c>   DW_AT_name        : (indirect string, offset: 0x341): __off64_t	
    <990>   DW_AT_decl_file   : 3	
    <991>   DW_AT_decl_line   : 141	
    <992>   DW_AT_type        : <0x979>	
 <1><996>: Abbrev Number: 3 (DW_TAG_base_type)
    <997>   DW_AT_byte_size   : 8	
    <998>   DW_AT_encoding    : 7	(unsigned)
    <999>   DW_AT_name        : (indirect string, offset: 0x39d): sizetype	
 <1><99d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99e>   DW_AT_byte_size   : 8	
 <1><99f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9a0>   DW_AT_byte_size   : 8	
    <9a1>   DW_AT_type        : <0x9a5>	
 <1><9a5>: Abbrev Number: 3 (DW_TAG_base_type)
    <9a6>   DW_AT_byte_size   : 1	
    <9a7>   DW_AT_encoding    : 6	(signed char)
    <9a8>   DW_AT_name        : (indirect string, offset: 0x15c): char	
 <1><9ac>: Abbrev Number: 3 (DW_TAG_base_type)
    <9ad>   DW_AT_byte_size   : 8	
    <9ae>   DW_AT_encoding    : 5	(signed)
    <9af>   DW_AT_name        : (indirect string, offset: 0xfa): long long int	
 <1><9b3>: Abbrev Number: 3 (DW_TAG_base_type)
    <9b4>   DW_AT_byte_size   : 8	
    <9b5>   DW_AT_encoding    : 7	(unsigned)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x221): long long unsigned int	
 <1><9ba>: Abbrev Number: 7 (DW_TAG_structure_type)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x2c): _IO_FILE	
    <9bf>   DW_AT_byte_size   : 216	
    <9c0>   DW_AT_decl_file   : 4	
    <9c1>   DW_AT_decl_line   : 246	
    <9c2>   DW_AT_sibling     : <0xb3b>	
 <2><9c6>: Abbrev Number: 8 (DW_TAG_member)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x87): _flags	
    <9cb>   DW_AT_decl_file   : 4	
    <9cc>   DW_AT_decl_line   : 247	
    <9cd>   DW_AT_type        : <0x94f>	
    <9d1>   DW_AT_data_member_location: 0	
 <2><9d2>: Abbrev Number: 8 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x287): _IO_read_ptr	
    <9d7>   DW_AT_decl_file   : 4	
    <9d8>   DW_AT_decl_line   : 252	
    <9d9>   DW_AT_type        : <0x99f>	
    <9dd>   DW_AT_data_member_location: 8	
 <2><9de>: Abbrev Number: 8 (DW_TAG_member)
    <9df>   DW_AT_name        : (indirect string, offset: 0xae): _IO_read_end	
    <9e3>   DW_AT_decl_file   : 4	
    <9e4>   DW_AT_decl_line   : 253	
    <9e5>   DW_AT_type        : <0x99f>	
    <9e9>   DW_AT_data_member_location: 16	
 <2><9ea>: Abbrev Number: 8 (DW_TAG_member)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x38f): _IO_read_base	
    <9ef>   DW_AT_decl_file   : 4	
    <9f0>   DW_AT_decl_line   : 254	
    <9f1>   DW_AT_type        : <0x99f>	
    <9f5>   DW_AT_data_member_location: 24	
 <2><9f6>: Abbrev Number: 8 (DW_TAG_member)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x26f): _IO_write_base	
    <9fb>   DW_AT_decl_file   : 4	
    <9fc>   DW_AT_decl_line   : 255	
    <9fd>   DW_AT_type        : <0x99f>	
    <a01>   DW_AT_data_member_location: 32	
 <2><a02>: Abbrev Number: 9 (DW_TAG_member)
    <a03>   DW_AT_name        : (indirect string, offset: 0x79): _IO_write_ptr	
    <a07>   DW_AT_decl_file   : 4	
    <a08>   DW_AT_decl_line   : 256	
    <a0a>   DW_AT_type        : <0x99f>	
    <a0e>   DW_AT_data_member_location: 40	
 <2><a0f>: Abbrev Number: 9 (DW_TAG_member)
    <a10>   DW_AT_name        : (indirect string, offset: 0x333): _IO_write_end	
    <a14>   DW_AT_decl_file   : 4	
    <a15>   DW_AT_decl_line   : 257	
    <a17>   DW_AT_type        : <0x99f>	
    <a1b>   DW_AT_data_member_location: 48	
 <2><a1c>: Abbrev Number: 9 (DW_TAG_member)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x37a): _IO_buf_base	
    <a21>   DW_AT_decl_file   : 4	
    <a22>   DW_AT_decl_line   : 258	
    <a24>   DW_AT_type        : <0x99f>	
    <a28>   DW_AT_data_member_location: 56	
 <2><a29>: Abbrev Number: 9 (DW_TAG_member)
    <a2a>   DW_AT_name        : (indirect string, offset: 0x294): _IO_buf_end	
    <a2e>   DW_AT_decl_file   : 4	
    <a2f>   DW_AT_decl_line   : 259	
    <a31>   DW_AT_type        : <0x99f>	
    <a35>   DW_AT_data_member_location: 64	
 <2><a36>: Abbrev Number: 9 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0x3b5): _IO_save_base	
    <a3b>   DW_AT_decl_file   : 4	
    <a3c>   DW_AT_decl_line   : 261	
    <a3e>   DW_AT_type        : <0x99f>	
    <a42>   DW_AT_data_member_location: 72	
 <2><a43>: Abbrev Number: 9 (DW_TAG_member)
    <a44>   DW_AT_name        : (indirect string, offset: 0x2ce): _IO_backup_base	
    <a48>   DW_AT_decl_file   : 4	
    <a49>   DW_AT_decl_line   : 262	
    <a4b>   DW_AT_type        : <0x99f>	
    <a4f>   DW_AT_data_member_location: 80	
 <2><a50>: Abbrev Number: 9 (DW_TAG_member)
    <a51>   DW_AT_name        : (indirect string, offset: 0x35): _IO_save_end	
    <a55>   DW_AT_decl_file   : 4	
    <a56>   DW_AT_decl_line   : 263	
    <a58>   DW_AT_type        : <0x99f>	
    <a5c>   DW_AT_data_member_location: 88	
 <2><a5d>: Abbrev Number: 9 (DW_TAG_member)
    <a5e>   DW_AT_name        : (indirect string, offset: 0xa5): _markers	
    <a62>   DW_AT_decl_file   : 4	
    <a63>   DW_AT_decl_line   : 265	
    <a65>   DW_AT_type        : <0xb73>	
    <a69>   DW_AT_data_member_location: 96	
 <2><a6a>: Abbrev Number: 9 (DW_TAG_member)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xbb): _chain	
    <a6f>   DW_AT_decl_file   : 4	
    <a70>   DW_AT_decl_line   : 267	
    <a72>   DW_AT_type        : <0xb79>	
    <a76>   DW_AT_data_member_location: 104	
 <2><a77>: Abbrev Number: 9 (DW_TAG_member)
    <a78>   DW_AT_name        : (indirect string, offset: 0x34b): _fileno	
    <a7c>   DW_AT_decl_file   : 4	
    <a7d>   DW_AT_decl_line   : 269	
    <a7f>   DW_AT_type        : <0x94f>	
    <a83>   DW_AT_data_member_location: 112	
 <2><a84>: Abbrev Number: 9 (DW_TAG_member)
    <a85>   DW_AT_name        : (indirect string, offset: 0x387): _flags2	
    <a89>   DW_AT_decl_file   : 4	
    <a8a>   DW_AT_decl_line   : 273	
    <a8c>   DW_AT_type        : <0x94f>	
    <a90>   DW_AT_data_member_location: 116	
 <2><a91>: Abbrev Number: 9 (DW_TAG_member)
    <a92>   DW_AT_name        : (indirect string, offset: 0x263): _old_offset	
    <a96>   DW_AT_decl_file   : 4	
    <a97>   DW_AT_decl_line   : 275	
    <a99>   DW_AT_type        : <0x980>	
    <a9d>   DW_AT_data_member_location: 120	
 <2><a9e>: Abbrev Number: 9 (DW_TAG_member)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x11a): _cur_column	
    <aa3>   DW_AT_decl_file   : 4	
    <aa4>   DW_AT_decl_line   : 279	
    <aa6>   DW_AT_type        : <0x95d>	
    <aaa>   DW_AT_data_member_location: 128	
 <2><aab>: Abbrev Number: 9 (DW_TAG_member)
    <aac>   DW_AT_name        : (indirect string, offset: 0x3a6): _vtable_offset	
    <ab0>   DW_AT_decl_file   : 4	
    <ab1>   DW_AT_decl_line   : 280	
    <ab3>   DW_AT_type        : <0x96b>	
    <ab7>   DW_AT_data_member_location: 130	
 <2><ab8>: Abbrev Number: 9 (DW_TAG_member)
    <ab9>   DW_AT_name        : (indirect string, offset: 0x24d): _shortbuf	
    <abd>   DW_AT_decl_file   : 4	
    <abe>   DW_AT_decl_line   : 281	
    <ac0>   DW_AT_type        : <0xb7f>	
    <ac4>   DW_AT_data_member_location: 131	
 <2><ac5>: Abbrev Number: 9 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x108): _lock	
    <aca>   DW_AT_decl_file   : 4	
    <acb>   DW_AT_decl_line   : 285	
    <acd>   DW_AT_type        : <0xb8f>	
    <ad1>   DW_AT_data_member_location: 136	
 <2><ad2>: Abbrev Number: 9 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x267): _offset	
    <ad7>   DW_AT_decl_file   : 4	
    <ad8>   DW_AT_decl_line   : 294	
    <ada>   DW_AT_type        : <0x98b>	
    <ade>   DW_AT_data_member_location: 144	
 <2><adf>: Abbrev Number: 9 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x2ab): __pad1	
    <ae4>   DW_AT_decl_file   : 4	
    <ae5>   DW_AT_decl_line   : 303	
    <ae7>   DW_AT_type        : <0x99d>	
    <aeb>   DW_AT_data_member_location: 152	
 <2><aec>: Abbrev Number: 9 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0x2b2): __pad2	
    <af1>   DW_AT_decl_file   : 4	
    <af2>   DW_AT_decl_line   : 304	
    <af4>   DW_AT_type        : <0x99d>	
    <af8>   DW_AT_data_member_location: 160	
 <2><af9>: Abbrev Number: 9 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x2b9): __pad3	
    <afe>   DW_AT_decl_file   : 4	
    <aff>   DW_AT_decl_line   : 305	
    <b01>   DW_AT_type        : <0x99d>	
    <b05>   DW_AT_data_member_location: 168	
 <2><b06>: Abbrev Number: 9 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0x2c0): __pad4	
    <b0b>   DW_AT_decl_file   : 4	
    <b0c>   DW_AT_decl_line   : 306	
    <b0e>   DW_AT_type        : <0x99d>	
    <b12>   DW_AT_data_member_location: 176	
 <2><b13>: Abbrev Number: 9 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0x2c7): __pad5	
    <b18>   DW_AT_decl_file   : 4	
    <b19>   DW_AT_decl_line   : 307	
    <b1b>   DW_AT_type        : <0x93d>	
    <b1f>   DW_AT_data_member_location: 184	
 <2><b20>: Abbrev Number: 9 (DW_TAG_member)
    <b21>   DW_AT_name        : (indirect string, offset: 0xfde): _mode	
    <b25>   DW_AT_decl_file   : 4	
    <b26>   DW_AT_decl_line   : 309	
    <b28>   DW_AT_type        : <0x94f>	
    <b2c>   DW_AT_data_member_location: 192	
 <2><b2d>: Abbrev Number: 9 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x27e): _unused2	
    <b32>   DW_AT_decl_file   : 4	
    <b33>   DW_AT_decl_line   : 311	
    <b35>   DW_AT_type        : <0xb95>	
    <b39>   DW_AT_data_member_location: 196	
 <2><b3a>: Abbrev Number: 0
 <1><b3b>: Abbrev Number: 10 (DW_TAG_typedef)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x3e3): _IO_lock_t	
    <b40>   DW_AT_decl_file   : 4	
    <b41>   DW_AT_decl_line   : 155	
 <1><b42>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b43>   DW_AT_name        : (indirect string, offset: 0x242): _IO_marker	
    <b47>   DW_AT_byte_size   : 24	
    <b48>   DW_AT_decl_file   : 4	
    <b49>   DW_AT_decl_line   : 161	
    <b4a>   DW_AT_sibling     : <0xb73>	
 <2><b4e>: Abbrev Number: 8 (DW_TAG_member)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x2a5): _next	
    <b53>   DW_AT_decl_file   : 4	
    <b54>   DW_AT_decl_line   : 162	
    <b55>   DW_AT_type        : <0xb73>	
    <b59>   DW_AT_data_member_location: 0	
 <2><b5a>: Abbrev Number: 8 (DW_TAG_member)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x12b): _sbuf	
    <b5f>   DW_AT_decl_file   : 4	
    <b60>   DW_AT_decl_line   : 163	
    <b61>   DW_AT_type        : <0xb79>	
    <b65>   DW_AT_data_member_location: 8	
 <2><b66>: Abbrev Number: 8 (DW_TAG_member)
    <b67>   DW_AT_name        : (indirect string, offset: 0x3f7): _pos	
    <b6b>   DW_AT_decl_file   : 4	
    <b6c>   DW_AT_decl_line   : 167	
    <b6d>   DW_AT_type        : <0x94f>	
    <b71>   DW_AT_data_member_location: 16	
 <2><b72>: Abbrev Number: 0
 <1><b73>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b74>   DW_AT_byte_size   : 8	
    <b75>   DW_AT_type        : <0xb42>	
 <1><b79>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b7a>   DW_AT_byte_size   : 8	
    <b7b>   DW_AT_type        : <0x9ba>	
 <1><b7f>: Abbrev Number: 11 (DW_TAG_array_type)
    <b80>   DW_AT_type        : <0x9a5>	
    <b84>   DW_AT_sibling     : <0xb8f>	
 <2><b88>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b89>   DW_AT_type        : <0x996>	
    <b8d>   DW_AT_upper_bound : 0	
 <2><b8e>: Abbrev Number: 0
 <1><b8f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b90>   DW_AT_byte_size   : 8	
    <b91>   DW_AT_type        : <0xb3b>	
 <1><b95>: Abbrev Number: 11 (DW_TAG_array_type)
    <b96>   DW_AT_type        : <0x9a5>	
    <b9a>   DW_AT_sibling     : <0xba5>	
 <2><b9e>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b9f>   DW_AT_type        : <0x996>	
    <ba3>   DW_AT_upper_bound : 19	
 <2><ba4>: Abbrev Number: 0
 <1><ba5>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ba6>   DW_AT_byte_size   : 80	
    <ba7>   DW_AT_decl_file   : 5	
    <ba8>   DW_AT_decl_line   : 204	
    <ba9>   DW_AT_sibling     : <0xc3e>	
 <2><bad>: Abbrev Number: 8 (DW_TAG_member)
    <bae>   DW_AT_name        : (indirect string, offset: 0x631): next_in	
    <bb2>   DW_AT_decl_file   : 5	
    <bb3>   DW_AT_decl_line   : 205	
    <bb4>   DW_AT_type        : <0x99f>	
    <bb8>   DW_AT_data_member_location: 0	
 <2><bb9>: Abbrev Number: 8 (DW_TAG_member)
    <bba>   DW_AT_name        : (indirect string, offset: 0x66e): avail_in	
    <bbe>   DW_AT_decl_file   : 5	
    <bbf>   DW_AT_decl_line   : 206	
    <bc0>   DW_AT_type        : <0x964>	
    <bc4>   DW_AT_data_member_location: 8	
 <2><bc5>: Abbrev Number: 8 (DW_TAG_member)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x63f): total_in_lo32	
    <bca>   DW_AT_decl_file   : 5	
    <bcb>   DW_AT_decl_line   : 207	
    <bcc>   DW_AT_type        : <0x964>	
    <bd0>   DW_AT_data_member_location: 12	
 <2><bd1>: Abbrev Number: 8 (DW_TAG_member)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x410): total_in_hi32	
    <bd6>   DW_AT_decl_file   : 5	
    <bd7>   DW_AT_decl_line   : 208	
    <bd8>   DW_AT_type        : <0x964>	
    <bdc>   DW_AT_data_member_location: 16	
 <2><bdd>: Abbrev Number: 8 (DW_TAG_member)
    <bde>   DW_AT_name        : (indirect string, offset: 0xbc8): next_out	
    <be2>   DW_AT_decl_file   : 5	
    <be3>   DW_AT_decl_line   : 210	
    <be4>   DW_AT_type        : <0x99f>	
    <be8>   DW_AT_data_member_location: 24	
 <2><be9>: Abbrev Number: 8 (DW_TAG_member)
    <bea>   DW_AT_name        : (indirect string, offset: 0xecd): avail_out	
    <bee>   DW_AT_decl_file   : 5	
    <bef>   DW_AT_decl_line   : 211	
    <bf0>   DW_AT_type        : <0x964>	
    <bf4>   DW_AT_data_member_location: 32	
 <2><bf5>: Abbrev Number: 8 (DW_TAG_member)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x6b0): total_out_lo32	
    <bfa>   DW_AT_decl_file   : 5	
    <bfb>   DW_AT_decl_line   : 212	
    <bfc>   DW_AT_type        : <0x964>	
    <c00>   DW_AT_data_member_location: 36	
 <2><c01>: Abbrev Number: 8 (DW_TAG_member)
    <c02>   DW_AT_name        : (indirect string, offset: 0x5d5): total_out_hi32	
    <c06>   DW_AT_decl_file   : 5	
    <c07>   DW_AT_decl_line   : 213	
    <c08>   DW_AT_type        : <0x964>	
    <c0c>   DW_AT_data_member_location: 40	
 <2><c0d>: Abbrev Number: 8 (DW_TAG_member)
    <c0e>   DW_AT_name        : (indirect string, offset: 0x685): state	
    <c12>   DW_AT_decl_file   : 5	
    <c13>   DW_AT_decl_line   : 215	
    <c14>   DW_AT_type        : <0x99d>	
    <c18>   DW_AT_data_member_location: 48	
 <2><c19>: Abbrev Number: 8 (DW_TAG_member)
    <c1a>   DW_AT_name        : (indirect string, offset: 0xa94): bzalloc	
    <c1e>   DW_AT_decl_file   : 5	
    <c1f>   DW_AT_decl_line   : 217	
    <c20>   DW_AT_type        : <0xc57>	
    <c24>   DW_AT_data_member_location: 56	
 <2><c25>: Abbrev Number: 8 (DW_TAG_member)
    <c26>   DW_AT_name        : (indirect string, offset: 0x1006): bzfree	
    <c2a>   DW_AT_decl_file   : 5	
    <c2b>   DW_AT_decl_line   : 218	
    <c2c>   DW_AT_type        : <0xc6d>	
    <c30>   DW_AT_data_member_location: 64	
 <2><c31>: Abbrev Number: 8 (DW_TAG_member)
    <c32>   DW_AT_name        : (indirect string, offset: 0x471): opaque	
    <c36>   DW_AT_decl_file   : 5	
    <c37>   DW_AT_decl_line   : 219	
    <c38>   DW_AT_type        : <0x99d>	
    <c3c>   DW_AT_data_member_location: 72	
 <2><c3d>: Abbrev Number: 0
 <1><c3e>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <c3f>   DW_AT_prototyped  : 1	
    <c3f>   DW_AT_type        : <0x99d>	
    <c43>   DW_AT_sibling     : <0xc57>	
 <2><c47>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c48>   DW_AT_type        : <0x99d>	
 <2><c4c>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c4d>   DW_AT_type        : <0x94f>	
 <2><c51>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c52>   DW_AT_type        : <0x94f>	
 <2><c56>: Abbrev Number: 0
 <1><c57>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c58>   DW_AT_byte_size   : 8	
    <c59>   DW_AT_type        : <0xc3e>	
 <1><c5d>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c5e>   DW_AT_prototyped  : 1	
    <c5e>   DW_AT_sibling     : <0xc6d>	
 <2><c62>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c63>   DW_AT_type        : <0x99d>	
 <2><c67>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c68>   DW_AT_type        : <0x99d>	
 <2><c6c>: Abbrev Number: 0
 <1><c6d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6e>   DW_AT_byte_size   : 8	
    <c6f>   DW_AT_type        : <0xc5d>	
 <1><c73>: Abbrev Number: 2 (DW_TAG_typedef)
    <c74>   DW_AT_name        : (indirect string, offset: 0x692): bz_stream	
    <c78>   DW_AT_decl_file   : 5	
    <c79>   DW_AT_decl_line   : 221	
    <c7a>   DW_AT_type        : <0xba5>	
 <1><c7e>: Abbrev Number: 2 (DW_TAG_typedef)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x438): Bool	
    <c83>   DW_AT_decl_file   : 6	
    <c84>   DW_AT_decl_line   : 82	
    <c85>   DW_AT_type        : <0x956>	
 <1><c89>: Abbrev Number: 2 (DW_TAG_typedef)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x1199): UChar	
    <c8e>   DW_AT_decl_file   : 6	
    <c8f>   DW_AT_decl_line   : 83	
    <c90>   DW_AT_type        : <0x956>	
 <1><c94>: Abbrev Number: 2 (DW_TAG_typedef)
    <c95>   DW_AT_name        : (indirect string, offset: 0x10bf): Int32	
    <c99>   DW_AT_decl_file   : 6	
    <c9a>   DW_AT_decl_line   : 84	
    <c9b>   DW_AT_type        : <0x94f>	
 <1><c9f>: Abbrev Number: 2 (DW_TAG_typedef)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x10be): UInt32	
    <ca4>   DW_AT_decl_file   : 6	
    <ca5>   DW_AT_decl_line   : 85	
    <ca6>   DW_AT_type        : <0x964>	
 <1><caa>: Abbrev Number: 2 (DW_TAG_typedef)
    <cab>   DW_AT_name        : (indirect string, offset: 0x478): UInt16	
    <caf>   DW_AT_decl_file   : 6	
    <cb0>   DW_AT_decl_line   : 87	
    <cb1>   DW_AT_type        : <0x95d>	
 <1><cb5>: Abbrev Number: 17 (DW_TAG_structure_type)
    <cb6>   DW_AT_byte_size   : 55768	
    <cb8>   DW_AT_decl_file   : 6	
    <cb9>   DW_AT_decl_line   : 231	
    <cba>   DW_AT_sibling     : <0xebe>	
 <2><cbe>: Abbrev Number: 8 (DW_TAG_member)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x54b): strm	
    <cc3>   DW_AT_decl_file   : 6	
    <cc4>   DW_AT_decl_line   : 233	
    <cc5>   DW_AT_type        : <0xebe>	
    <cc9>   DW_AT_data_member_location: 0	
 <2><cca>: Abbrev Number: 8 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0xfdf): mode	
    <ccf>   DW_AT_decl_file   : 6	
    <cd0>   DW_AT_decl_line   : 237	
    <cd1>   DW_AT_type        : <0xc94>	
    <cd5>   DW_AT_data_member_location: 8	
 <2><cd6>: Abbrev Number: 8 (DW_TAG_member)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x685): state	
    <cdb>   DW_AT_decl_file   : 6	
    <cdc>   DW_AT_decl_line   : 238	
    <cdd>   DW_AT_type        : <0xc94>	
    <ce1>   DW_AT_data_member_location: 12	
 <2><ce2>: Abbrev Number: 8 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x530): avail_in_expect	
    <ce7>   DW_AT_decl_file   : 6	
    <ce8>   DW_AT_decl_line   : 241	
    <ce9>   DW_AT_type        : <0xc9f>	
    <ced>   DW_AT_data_member_location: 16	
 <2><cee>: Abbrev Number: 8 (DW_TAG_member)
    <cef>   DW_AT_name        : (indirect string, offset: 0x4c2): arr1	
    <cf3>   DW_AT_decl_file   : 6	
    <cf4>   DW_AT_decl_line   : 244	
    <cf5>   DW_AT_type        : <0xec4>	
    <cf9>   DW_AT_data_member_location: 24	
 <2><cfa>: Abbrev Number: 8 (DW_TAG_member)
    <cfb>   DW_AT_name        : (indirect string, offset: 0x4c7): arr2	
    <cff>   DW_AT_decl_file   : 6	
    <d00>   DW_AT_decl_line   : 245	
    <d01>   DW_AT_type        : <0xec4>	
    <d05>   DW_AT_data_member_location: 32	
 <2><d06>: Abbrev Number: 8 (DW_TAG_member)
    <d07>   DW_AT_name        : (indirect string, offset: 0xeb1): ftab	
    <d0b>   DW_AT_decl_file   : 6	
    <d0c>   DW_AT_decl_line   : 246	
    <d0d>   DW_AT_type        : <0xec4>	
    <d11>   DW_AT_data_member_location: 40	
 <2><d12>: Abbrev Number: 8 (DW_TAG_member)
    <d13>   DW_AT_name        : (indirect string, offset: 0x5f2): origPtr	
    <d17>   DW_AT_decl_file   : 6	
    <d18>   DW_AT_decl_line   : 247	
    <d19>   DW_AT_type        : <0xc94>	
    <d1d>   DW_AT_data_member_location: 48	
 <2><d1e>: Abbrev Number: 18 (DW_TAG_member)
    <d1f>   DW_AT_name        : ptr	
    <d23>   DW_AT_decl_file   : 6	
    <d24>   DW_AT_decl_line   : 250	
    <d25>   DW_AT_type        : <0xec4>	
    <d29>   DW_AT_data_member_location: 56	
 <2><d2a>: Abbrev Number: 8 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xef6): block	
    <d2f>   DW_AT_decl_file   : 6	
    <d30>   DW_AT_decl_line   : 251	
    <d31>   DW_AT_type        : <0xeca>	
    <d35>   DW_AT_data_member_location: 64	
 <2><d36>: Abbrev Number: 8 (DW_TAG_member)
    <d37>   DW_AT_name        : (indirect string, offset: 0x4b4): mtfv	
    <d3b>   DW_AT_decl_file   : 6	
    <d3c>   DW_AT_decl_line   : 252	
    <d3d>   DW_AT_type        : <0xed0>	
    <d41>   DW_AT_data_member_location: 72	
 <2><d42>: Abbrev Number: 8 (DW_TAG_member)
    <d43>   DW_AT_name        : (indirect string, offset: 0x488): zbits	
    <d47>   DW_AT_decl_file   : 6	
    <d48>   DW_AT_decl_line   : 253	
    <d49>   DW_AT_type        : <0xeca>	
    <d4d>   DW_AT_data_member_location: 80	
 <2><d4e>: Abbrev Number: 9 (DW_TAG_member)
    <d4f>   DW_AT_name        : (indirect string, offset: 0x353): workFactor	
    <d53>   DW_AT_decl_file   : 6	
    <d54>   DW_AT_decl_line   : 256	
    <d56>   DW_AT_type        : <0xc94>	
    <d5a>   DW_AT_data_member_location: 88	
 <2><d5b>: Abbrev Number: 9 (DW_TAG_member)
    <d5c>   DW_AT_name        : (indirect string, offset: 0x4d3): state_in_ch	
    <d60>   DW_AT_decl_file   : 6	
    <d61>   DW_AT_decl_line   : 259	
    <d63>   DW_AT_type        : <0xc9f>	
    <d67>   DW_AT_data_member_location: 92	
 <2><d68>: Abbrev Number: 9 (DW_TAG_member)
    <d69>   DW_AT_name        : (indirect string, offset: 0x3fc): state_in_len	
    <d6d>   DW_AT_decl_file   : 6	
    <d6e>   DW_AT_decl_line   : 260	
    <d70>   DW_AT_type        : <0xc94>	
    <d74>   DW_AT_data_member_location: 96	
 <2><d75>: Abbrev Number: 9 (DW_TAG_member)
    <d76>   DW_AT_name        : (indirect string, offset: 0x5b4): rNToGo	
    <d7a>   DW_AT_decl_file   : 6	
    <d7b>   DW_AT_decl_line   : 261	
    <d7d>   DW_AT_type        : <0xc94>	
    <d81>   DW_AT_data_member_location: 100	
 <2><d82>: Abbrev Number: 9 (DW_TAG_member)
    <d83>   DW_AT_name        : (indirect string, offset: 0x639): rTPos	
    <d87>   DW_AT_decl_file   : 6	
    <d88>   DW_AT_decl_line   : 261	
    <d8a>   DW_AT_type        : <0xc94>	
    <d8e>   DW_AT_data_member_location: 104	
 <2><d8f>: Abbrev Number: 9 (DW_TAG_member)
    <d90>   DW_AT_name        : (indirect string, offset: 0xebb): nblock	
    <d94>   DW_AT_decl_file   : 6	
    <d95>   DW_AT_decl_line   : 264	
    <d97>   DW_AT_type        : <0xc94>	
    <d9b>   DW_AT_data_member_location: 108	
 <2><d9c>: Abbrev Number: 9 (DW_TAG_member)
    <d9d>   DW_AT_name        : (indirect string, offset: 0xd1a): nblockMAX	
    <da1>   DW_AT_decl_file   : 6	
    <da2>   DW_AT_decl_line   : 265	
    <da4>   DW_AT_type        : <0xc94>	
    <da8>   DW_AT_data_member_location: 112	
 <2><da9>: Abbrev Number: 9 (DW_TAG_member)
    <daa>   DW_AT_name        : (indirect string, offset: 0x613): numZ	
    <dae>   DW_AT_decl_file   : 6	
    <daf>   DW_AT_decl_line   : 266	
    <db1>   DW_AT_type        : <0xc94>	
    <db5>   DW_AT_data_member_location: 116	
 <2><db6>: Abbrev Number: 9 (DW_TAG_member)
    <db7>   DW_AT_name        : (indirect string, offset: 0x3ee): state_out_pos	
    <dbb>   DW_AT_decl_file   : 6	
    <dbc>   DW_AT_decl_line   : 267	
    <dbe>   DW_AT_type        : <0xc94>	
    <dc2>   DW_AT_data_member_location: 120	
 <2><dc3>: Abbrev Number: 9 (DW_TAG_member)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x593): nInUse	
    <dc8>   DW_AT_decl_file   : 6	
    <dc9>   DW_AT_decl_line   : 270	
    <dcb>   DW_AT_type        : <0xc94>	
    <dcf>   DW_AT_data_member_location: 124	
 <2><dd0>: Abbrev Number: 9 (DW_TAG_member)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x462): inUse	
    <dd5>   DW_AT_decl_file   : 6	
    <dd6>   DW_AT_decl_line   : 271	
    <dd8>   DW_AT_type        : <0xed6>	
    <ddc>   DW_AT_data_member_location: 128	
 <2><ddd>: Abbrev Number: 19 (DW_TAG_member)
    <dde>   DW_AT_name        : (indirect string, offset: 0x540): unseqToSeq	
    <de2>   DW_AT_decl_file   : 6	
    <de3>   DW_AT_decl_line   : 272	
    <de5>   DW_AT_type        : <0xee6>	
    <de9>   DW_AT_data_member_location: 384	
 <2><deb>: Abbrev Number: 19 (DW_TAG_member)
    <dec>   DW_AT_name        : (indirect string, offset: 0x6ca): bsBuff	
    <df0>   DW_AT_decl_file   : 6	
    <df1>   DW_AT_decl_line   : 275	
    <df3>   DW_AT_type        : <0xc9f>	
    <df7>   DW_AT_data_member_location: 640	
 <2><df9>: Abbrev Number: 19 (DW_TAG_member)
    <dfa>   DW_AT_name        : (indirect string, offset: 0x41e): bsLive	
    <dfe>   DW_AT_decl_file   : 6	
    <dff>   DW_AT_decl_line   : 276	
    <e01>   DW_AT_type        : <0xc94>	
    <e05>   DW_AT_data_member_location: 644	
 <2><e07>: Abbrev Number: 19 (DW_TAG_member)
    <e08>   DW_AT_name        : (indirect string, offset: 0x618): blockCRC	
    <e0c>   DW_AT_decl_file   : 6	
    <e0d>   DW_AT_decl_line   : 279	
    <e0f>   DW_AT_type        : <0xc9f>	
    <e13>   DW_AT_data_member_location: 648	
 <2><e15>: Abbrev Number: 19 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x587): combinedCRC	
    <e1a>   DW_AT_decl_file   : 6	
    <e1b>   DW_AT_decl_line   : 280	
    <e1d>   DW_AT_type        : <0xc9f>	
    <e21>   DW_AT_data_member_location: 652	
 <2><e23>: Abbrev Number: 19 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0xcb): verbosity	
    <e28>   DW_AT_decl_file   : 6	
    <e29>   DW_AT_decl_line   : 283	
    <e2b>   DW_AT_type        : <0xc94>	
    <e2f>   DW_AT_data_member_location: 656	
 <2><e31>: Abbrev Number: 19 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0x5cd): blockNo	
    <e36>   DW_AT_decl_file   : 6	
    <e37>   DW_AT_decl_line   : 284	
    <e39>   DW_AT_type        : <0xc94>	
    <e3d>   DW_AT_data_member_location: 660	
 <2><e3f>: Abbrev Number: 19 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0x1bb): blockSize100k	
    <e44>   DW_AT_decl_file   : 6	
    <e45>   DW_AT_decl_line   : 285	
    <e47>   DW_AT_type        : <0xc94>	
    <e4b>   DW_AT_data_member_location: 664	
 <2><e4d>: Abbrev Number: 19 (DW_TAG_member)
    <e4e>   DW_AT_name        : (indirect string, offset: 0x44b): nMTF	
    <e52>   DW_AT_decl_file   : 6	
    <e53>   DW_AT_decl_line   : 288	
    <e55>   DW_AT_type        : <0xc94>	
    <e59>   DW_AT_data_member_location: 668	
 <2><e5b>: Abbrev Number: 19 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x4f4): mtfFreq	
    <e60>   DW_AT_decl_file   : 6	
    <e61>   DW_AT_decl_line   : 289	
    <e63>   DW_AT_type        : <0xef6>	
    <e67>   DW_AT_data_member_location: 672	
 <2><e69>: Abbrev Number: 19 (DW_TAG_member)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x4b9): selector	
    <e6e>   DW_AT_decl_file   : 6	
    <e6f>   DW_AT_decl_line   : 290	
    <e71>   DW_AT_type        : <0xf07>	
    <e75>   DW_AT_data_member_location: 1704	
 <2><e77>: Abbrev Number: 19 (DW_TAG_member)
    <e78>   DW_AT_name        : (indirect string, offset: 0x48e): selectorMtf	
    <e7c>   DW_AT_decl_file   : 6	
    <e7d>   DW_AT_decl_line   : 291	
    <e7f>   DW_AT_type        : <0xf07>	
    <e83>   DW_AT_data_member_location: 19706	
 <2><e85>: Abbrev Number: 20 (DW_TAG_member)
    <e86>   DW_AT_name        : len	
    <e8a>   DW_AT_decl_file   : 6	
    <e8b>   DW_AT_decl_line   : 293	
    <e8d>   DW_AT_type        : <0xf18>	
    <e91>   DW_AT_data_member_location: 37708	
 <2><e93>: Abbrev Number: 19 (DW_TAG_member)
    <e94>   DW_AT_name        : (indirect string, offset: 0xff9): code	
    <e98>   DW_AT_decl_file   : 6	
    <e99>   DW_AT_decl_line   : 294	
    <e9b>   DW_AT_type        : <0xf2f>	
    <e9f>   DW_AT_data_member_location: 39256	
 <2><ea1>: Abbrev Number: 19 (DW_TAG_member)
    <ea2>   DW_AT_name        : (indirect string, offset: 0x69c): rfreq	
    <ea6>   DW_AT_decl_file   : 6	
    <ea7>   DW_AT_decl_line   : 295	
    <ea9>   DW_AT_type        : <0xf2f>	
    <ead>   DW_AT_data_member_location: 45448	
 <2><eaf>: Abbrev Number: 19 (DW_TAG_member)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x468): len_pack	
    <eb4>   DW_AT_decl_file   : 6	
    <eb5>   DW_AT_decl_line   : 297	
    <eb7>   DW_AT_type        : <0xf46>	
    <ebb>   DW_AT_data_member_location: 51640	
 <2><ebd>: Abbrev Number: 0
 <1><ebe>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ebf>   DW_AT_byte_size   : 8	
    <ec0>   DW_AT_type        : <0xc73>	
 <1><ec4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ec5>   DW_AT_byte_size   : 8	
    <ec6>   DW_AT_type        : <0xc9f>	
 <1><eca>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ecb>   DW_AT_byte_size   : 8	
    <ecc>   DW_AT_type        : <0xc89>	
 <1><ed0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ed1>   DW_AT_byte_size   : 8	
    <ed2>   DW_AT_type        : <0xcaa>	
 <1><ed6>: Abbrev Number: 11 (DW_TAG_array_type)
    <ed7>   DW_AT_type        : <0xc7e>	
    <edb>   DW_AT_sibling     : <0xee6>	
 <2><edf>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <ee0>   DW_AT_type        : <0x996>	
    <ee4>   DW_AT_upper_bound : 255	
 <2><ee5>: Abbrev Number: 0
 <1><ee6>: Abbrev Number: 11 (DW_TAG_array_type)
    <ee7>   DW_AT_type        : <0xc89>	
    <eeb>   DW_AT_sibling     : <0xef6>	
 <2><eef>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <ef0>   DW_AT_type        : <0x996>	
    <ef4>   DW_AT_upper_bound : 255	
 <2><ef5>: Abbrev Number: 0
 <1><ef6>: Abbrev Number: 11 (DW_TAG_array_type)
    <ef7>   DW_AT_type        : <0xc94>	
    <efb>   DW_AT_sibling     : <0xf07>	
 <2><eff>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <f00>   DW_AT_type        : <0x996>	
    <f04>   DW_AT_upper_bound : 257	
 <2><f06>: Abbrev Number: 0
 <1><f07>: Abbrev Number: 11 (DW_TAG_array_type)
    <f08>   DW_AT_type        : <0xc89>	
    <f0c>   DW_AT_sibling     : <0xf18>	
 <2><f10>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <f11>   DW_AT_type        : <0x996>	
    <f15>   DW_AT_upper_bound : 18001	
 <2><f17>: Abbrev Number: 0
 <1><f18>: Abbrev Number: 11 (DW_TAG_array_type)
    <f19>   DW_AT_type        : <0xc89>	
    <f1d>   DW_AT_sibling     : <0xf2f>	
 <2><f21>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <f22>   DW_AT_type        : <0x996>	
    <f26>   DW_AT_upper_bound : 5	
 <2><f27>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <f28>   DW_AT_type        : <0x996>	
    <f2c>   DW_AT_upper_bound : 257	
 <2><f2e>: Abbrev Number: 0
 <1><f2f>: Abbrev Number: 11 (DW_TAG_array_type)
    <f30>   DW_AT_type        : <0xc94>	
    <f34>   DW_AT_sibling     : <0xf46>	
 <2><f38>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <f39>   DW_AT_type        : <0x996>	
    <f3d>   DW_AT_upper_bound : 5	
 <2><f3e>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <f3f>   DW_AT_type        : <0x996>	
    <f43>   DW_AT_upper_bound : 257	
 <2><f45>: Abbrev Number: 0
 <1><f46>: Abbrev Number: 11 (DW_TAG_array_type)
    <f47>   DW_AT_type        : <0xc9f>	
    <f4b>   DW_AT_sibling     : <0xf5d>	
 <2><f4f>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <f50>   DW_AT_type        : <0x996>	
    <f54>   DW_AT_upper_bound : 257	
 <2><f56>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <f57>   DW_AT_type        : <0x996>	
    <f5b>   DW_AT_upper_bound : 3	
 <2><f5c>: Abbrev Number: 0
 <1><f5d>: Abbrev Number: 22 (DW_TAG_typedef)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x550): EState	
    <f62>   DW_AT_decl_file   : 6	
    <f63>   DW_AT_decl_line   : 300	
    <f65>   DW_AT_type        : <0xcb5>	
 <1><f69>: Abbrev Number: 11 (DW_TAG_array_type)
    <f6a>   DW_AT_type        : <0xc94>	
    <f6e>   DW_AT_sibling     : <0xf79>	
 <2><f72>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <f73>   DW_AT_type        : <0x996>	
    <f77>   DW_AT_upper_bound : 255	
 <2><f78>: Abbrev Number: 0
 <1><f79>: Abbrev Number: 11 (DW_TAG_array_type)
    <f7a>   DW_AT_type        : <0xc94>	
    <f7e>   DW_AT_sibling     : <0xf8a>	
 <2><f82>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <f83>   DW_AT_type        : <0x996>	
    <f87>   DW_AT_upper_bound : 256	
 <2><f89>: Abbrev Number: 0
 <1><f8a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f8b>   DW_AT_byte_size   : 8	
    <f8c>   DW_AT_type        : <0xc94>	
 <1><f90>: Abbrev Number: 23 (DW_TAG_subprogram)
    <f91>   DW_AT_name        : (indirect string, offset: 0x59a): fallbackSimpleSort	
    <f95>   DW_AT_decl_file   : 1	
    <f96>   DW_AT_decl_line   : 79	
    <f97>   DW_AT_prototyped  : 1	
    <f97>   DW_AT_low_pc      : 0x402771	
    <f9f>   DW_AT_high_pc     : 0x1e8	
    <fa7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fa9>   DW_AT_GNU_all_call_sites: 1	
    <fa9>   DW_AT_sibling     : <0x1018>	
 <2><fad>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <fae>   DW_AT_name        : (indirect string, offset: 0x43d): fmap	
    <fb2>   DW_AT_decl_file   : 1	
    <fb3>   DW_AT_decl_line   : 79	
    <fb4>   DW_AT_type        : <0xec4>	
    <fb8>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><fbb>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x5ad): eclass	
    <fc0>   DW_AT_decl_file   : 1	
    <fc1>   DW_AT_decl_line   : 80	
    <fc2>   DW_AT_type        : <0xec4>	
    <fc6>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><fc9>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <fca>   DW_AT_name        : lo	
    <fcd>   DW_AT_decl_file   : 1	
    <fce>   DW_AT_decl_line   : 81	
    <fcf>   DW_AT_type        : <0xc94>	
    <fd3>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><fd6>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <fd7>   DW_AT_name        : hi	
    <fda>   DW_AT_decl_file   : 1	
    <fdb>   DW_AT_decl_line   : 82	
    <fdc>   DW_AT_type        : <0xc94>	
    <fe0>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><fe3>: Abbrev Number: 26 (DW_TAG_variable)
    <fe4>   DW_AT_name        : i	
    <fe6>   DW_AT_decl_file   : 1	
    <fe7>   DW_AT_decl_line   : 84	
    <fe8>   DW_AT_type        : <0xc94>	
    <fec>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><fef>: Abbrev Number: 26 (DW_TAG_variable)
    <ff0>   DW_AT_name        : j	
    <ff2>   DW_AT_decl_file   : 1	
    <ff3>   DW_AT_decl_line   : 84	
    <ff4>   DW_AT_type        : <0xc94>	
    <ff8>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><ffb>: Abbrev Number: 26 (DW_TAG_variable)
    <ffc>   DW_AT_name        : tmp	
    <1000>   DW_AT_decl_file   : 1	
    <1001>   DW_AT_decl_line   : 84	
    <1002>   DW_AT_type        : <0xc94>	
    <1006>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><1009>: Abbrev Number: 27 (DW_TAG_variable)
    <100a>   DW_AT_name        : (indirect string, offset: 0x55c): ec_tmp	
    <100e>   DW_AT_decl_file   : 1	
    <100f>   DW_AT_decl_line   : 85	
    <1010>   DW_AT_type        : <0xc9f>	
    <1014>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1017>: Abbrev Number: 0
 <1><1018>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1019>   DW_AT_name        : (indirect string, offset: 0x509): fallbackQSort3	
    <101d>   DW_AT_decl_file   : 1	
    <101e>   DW_AT_decl_line   : 140	
    <101f>   DW_AT_prototyped  : 1	
    <101f>   DW_AT_low_pc      : 0x402959	
    <1027>   DW_AT_high_pc     : 0x821	
    <102f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1031>   DW_AT_GNU_all_tail_call_sites: 1	
    <1031>   DW_AT_sibling     : <0x126d>	
 <2><1035>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <1036>   DW_AT_name        : (indirect string, offset: 0x43d): fmap	
    <103a>   DW_AT_decl_file   : 1	
    <103b>   DW_AT_decl_line   : 140	
    <103c>   DW_AT_type        : <0xec4>	
    <1040>   DW_AT_location    : 3 byte block: 91 e8 78 	(DW_OP_fbreg: -920)
 <2><1044>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <1045>   DW_AT_name        : (indirect string, offset: 0x5ad): eclass	
    <1049>   DW_AT_decl_file   : 1	
    <104a>   DW_AT_decl_line   : 141	
    <104b>   DW_AT_type        : <0xec4>	
    <104f>   DW_AT_location    : 3 byte block: 91 e0 78 	(DW_OP_fbreg: -928)
 <2><1053>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <1054>   DW_AT_name        : (indirect string, offset: 0x563): loSt	
    <1058>   DW_AT_decl_file   : 1	
    <1059>   DW_AT_decl_line   : 142	
    <105a>   DW_AT_type        : <0xc94>	
    <105e>   DW_AT_location    : 3 byte block: 91 dc 78 	(DW_OP_fbreg: -932)
 <2><1062>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <1063>   DW_AT_name        : (indirect string, offset: 0x669): hiSt	
    <1067>   DW_AT_decl_file   : 1	
    <1068>   DW_AT_decl_line   : 143	
    <1069>   DW_AT_type        : <0xc94>	
    <106d>   DW_AT_location    : 3 byte block: 91 d8 78 	(DW_OP_fbreg: -936)
 <2><1071>: Abbrev Number: 27 (DW_TAG_variable)
    <1072>   DW_AT_name        : (indirect string, offset: 0x621): unLo	
    <1076>   DW_AT_decl_file   : 1	
    <1077>   DW_AT_decl_line   : 145	
    <1078>   DW_AT_type        : <0xc94>	
    <107c>   DW_AT_location    : 3 byte block: 91 f4 78 	(DW_OP_fbreg: -908)
 <2><1080>: Abbrev Number: 27 (DW_TAG_variable)
    <1081>   DW_AT_name        : (indirect string, offset: 0x557): unHi	
    <1085>   DW_AT_decl_file   : 1	
    <1086>   DW_AT_decl_line   : 145	
    <1087>   DW_AT_type        : <0xc94>	
    <108b>   DW_AT_location    : 3 byte block: 91 f8 78 	(DW_OP_fbreg: -904)
 <2><108f>: Abbrev Number: 27 (DW_TAG_variable)
    <1090>   DW_AT_name        : (indirect string, offset: 0x6c5): ltLo	
    <1094>   DW_AT_decl_file   : 1	
    <1095>   DW_AT_decl_line   : 145	
    <1096>   DW_AT_type        : <0xc94>	
    <109a>   DW_AT_location    : 3 byte block: 91 fc 78 	(DW_OP_fbreg: -900)
 <2><109e>: Abbrev Number: 27 (DW_TAG_variable)
    <109f>   DW_AT_name        : (indirect string, offset: 0x680): gtHi	
    <10a3>   DW_AT_decl_file   : 1	
    <10a4>   DW_AT_decl_line   : 145	
    <10a5>   DW_AT_type        : <0xc94>	
    <10a9>   DW_AT_location    : 3 byte block: 91 80 79 	(DW_OP_fbreg: -896)
 <2><10ad>: Abbrev Number: 26 (DW_TAG_variable)
    <10ae>   DW_AT_name        : n	
    <10b0>   DW_AT_decl_file   : 1	
    <10b1>   DW_AT_decl_line   : 145	
    <10b2>   DW_AT_type        : <0xc94>	
    <10b6>   DW_AT_location    : 3 byte block: 91 b4 79 	(DW_OP_fbreg: -844)
 <2><10ba>: Abbrev Number: 26 (DW_TAG_variable)
    <10bb>   DW_AT_name        : m	
    <10bd>   DW_AT_decl_file   : 1	
    <10be>   DW_AT_decl_line   : 145	
    <10bf>   DW_AT_type        : <0xc94>	
    <10c3>   DW_AT_location    : 3 byte block: 91 c4 79 	(DW_OP_fbreg: -828)
 <2><10c7>: Abbrev Number: 26 (DW_TAG_variable)
    <10c8>   DW_AT_name        : sp	
    <10cb>   DW_AT_decl_file   : 1	
    <10cc>   DW_AT_decl_line   : 146	
    <10cd>   DW_AT_type        : <0xc94>	
    <10d1>   DW_AT_location    : 3 byte block: 91 84 79 	(DW_OP_fbreg: -892)
 <2><10d5>: Abbrev Number: 26 (DW_TAG_variable)
    <10d6>   DW_AT_name        : lo	
    <10d9>   DW_AT_decl_file   : 1	
    <10da>   DW_AT_decl_line   : 146	
    <10db>   DW_AT_type        : <0xc94>	
    <10df>   DW_AT_location    : 3 byte block: 91 a8 79 	(DW_OP_fbreg: -856)
 <2><10e3>: Abbrev Number: 26 (DW_TAG_variable)
    <10e4>   DW_AT_name        : hi	
    <10e7>   DW_AT_decl_file   : 1	
    <10e8>   DW_AT_decl_line   : 146	
    <10e9>   DW_AT_type        : <0xc94>	
    <10ed>   DW_AT_location    : 3 byte block: 91 ac 79 	(DW_OP_fbreg: -852)
 <2><10f1>: Abbrev Number: 26 (DW_TAG_variable)
    <10f2>   DW_AT_name        : med	
    <10f6>   DW_AT_decl_file   : 1	
    <10f7>   DW_AT_decl_line   : 147	
    <10f8>   DW_AT_type        : <0xc9f>	
    <10fc>   DW_AT_location    : 3 byte block: 91 88 79 	(DW_OP_fbreg: -888)
 <2><1100>: Abbrev Number: 26 (DW_TAG_variable)
    <1101>   DW_AT_name        : r	
    <1103>   DW_AT_decl_file   : 1	
    <1104>   DW_AT_decl_line   : 147	
    <1105>   DW_AT_type        : <0xc9f>	
    <1109>   DW_AT_location    : 3 byte block: 91 8c 79 	(DW_OP_fbreg: -884)
 <2><110d>: Abbrev Number: 26 (DW_TAG_variable)
    <110e>   DW_AT_name        : r3	
    <1111>   DW_AT_decl_file   : 1	
    <1112>   DW_AT_decl_line   : 147	
    <1113>   DW_AT_type        : <0xc9f>	
    <1117>   DW_AT_location    : 3 byte block: 91 b0 79 	(DW_OP_fbreg: -848)
 <2><111b>: Abbrev Number: 27 (DW_TAG_variable)
    <111c>   DW_AT_name        : (indirect string, offset: 0x661): stackLo	
    <1120>   DW_AT_decl_file   : 1	
    <1121>   DW_AT_decl_line   : 148	
    <1122>   DW_AT_type        : <0x126d>	
    <1126>   DW_AT_location    : 3 byte block: 91 d0 79 	(DW_OP_fbreg: -816)
 <2><112a>: Abbrev Number: 27 (DW_TAG_variable)
    <112b>   DW_AT_name        : (indirect string, offset: 0x568): stackHi	
    <112f>   DW_AT_decl_file   : 1	
    <1130>   DW_AT_decl_line   : 149	
    <1131>   DW_AT_type        : <0x126d>	
    <1135>   DW_AT_location    : 3 byte block: 91 e0 7c 	(DW_OP_fbreg: -416)
 <2><1139>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <113a>   DW_AT_low_pc      : 0x402be2	
    <1142>   DW_AT_high_pc     : 0x7c	
    <114a>   DW_AT_sibling     : <0x115e>	
 <3><114e>: Abbrev Number: 27 (DW_TAG_variable)
    <114f>   DW_AT_name        : (indirect string, offset: 0x6bf): zztmp	
    <1153>   DW_AT_decl_file   : 1	
    <1154>   DW_AT_decl_line   : 187	
    <1155>   DW_AT_type        : <0xc94>	
    <1159>   DW_AT_location    : 3 byte block: 91 b8 79 	(DW_OP_fbreg: -840)
 <3><115d>: Abbrev Number: 0
 <2><115e>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <115f>   DW_AT_low_pc      : 0x402ced	
    <1167>   DW_AT_high_pc     : 0x7c	
    <116f>   DW_AT_sibling     : <0x1183>	
 <3><1173>: Abbrev Number: 27 (DW_TAG_variable)
    <1174>   DW_AT_name        : (indirect string, offset: 0x6bf): zztmp	
    <1178>   DW_AT_decl_file   : 1	
    <1179>   DW_AT_decl_line   : 198	
    <117a>   DW_AT_type        : <0xc94>	
    <117e>   DW_AT_location    : 3 byte block: 91 bc 79 	(DW_OP_fbreg: -836)
 <3><1182>: Abbrev Number: 0
 <2><1183>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <1184>   DW_AT_low_pc      : 0x402dba	
    <118c>   DW_AT_high_pc     : 0x7c	
    <1194>   DW_AT_sibling     : <0x11a8>	
 <3><1198>: Abbrev Number: 27 (DW_TAG_variable)
    <1199>   DW_AT_name        : (indirect string, offset: 0x6bf): zztmp	
    <119d>   DW_AT_decl_file   : 1	
    <119e>   DW_AT_decl_line   : 206	
    <119f>   DW_AT_type        : <0xc94>	
    <11a3>   DW_AT_location    : 3 byte block: 91 cc 79 	(DW_OP_fbreg: -820)
 <3><11a7>: Abbrev Number: 0
 <2><11a8>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <11a9>   DW_AT_low_pc      : 0x402e77	
    <11b1>   DW_AT_high_pc     : 0xd1	
    <11b9>   DW_AT_sibling     : <0x120c>	
 <3><11bd>: Abbrev Number: 27 (DW_TAG_variable)
    <11be>   DW_AT_name        : (indirect string, offset: 0x5fa): yyp1	
    <11c2>   DW_AT_decl_file   : 1	
    <11c3>   DW_AT_decl_line   : 213	
    <11c4>   DW_AT_type        : <0xc94>	
    <11c8>   DW_AT_location    : 3 byte block: 91 90 79 	(DW_OP_fbreg: -880)
 <3><11cc>: Abbrev Number: 27 (DW_TAG_variable)
    <11cd>   DW_AT_name        : (indirect string, offset: 0x5ff): yyp2	
    <11d1>   DW_AT_decl_file   : 1	
    <11d2>   DW_AT_decl_line   : 213	
    <11d3>   DW_AT_type        : <0xc94>	
    <11d7>   DW_AT_location    : 3 byte block: 91 94 79 	(DW_OP_fbreg: -876)
 <3><11db>: Abbrev Number: 26 (DW_TAG_variable)
    <11dc>   DW_AT_name        : yyn	
    <11e0>   DW_AT_decl_file   : 1	
    <11e1>   DW_AT_decl_line   : 213	
    <11e2>   DW_AT_type        : <0xc94>	
    <11e6>   DW_AT_location    : 3 byte block: 91 98 79 	(DW_OP_fbreg: -872)
 <3><11ea>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <11eb>   DW_AT_low_pc      : 0x402eaa	
    <11f3>   DW_AT_high_pc     : 0x7c	
 <4><11fb>: Abbrev Number: 27 (DW_TAG_variable)
    <11fc>   DW_AT_name        : (indirect string, offset: 0x6bf): zztmp	
    <1200>   DW_AT_decl_file   : 1	
    <1201>   DW_AT_decl_line   : 213	
    <1202>   DW_AT_type        : <0xc94>	
    <1206>   DW_AT_location    : 3 byte block: 91 c0 79 	(DW_OP_fbreg: -832)
 <4><120a>: Abbrev Number: 0
 <3><120b>: Abbrev Number: 0
 <2><120c>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <120d>   DW_AT_low_pc      : 0x402f71	
    <1215>   DW_AT_high_pc     : 0xd4	
 <3><121d>: Abbrev Number: 27 (DW_TAG_variable)
    <121e>   DW_AT_name        : (indirect string, offset: 0x5fa): yyp1	
    <1222>   DW_AT_decl_file   : 1	
    <1223>   DW_AT_decl_line   : 214	
    <1224>   DW_AT_type        : <0xc94>	
    <1228>   DW_AT_location    : 3 byte block: 91 9c 79 	(DW_OP_fbreg: -868)
 <3><122c>: Abbrev Number: 27 (DW_TAG_variable)
    <122d>   DW_AT_name        : (indirect string, offset: 0x5ff): yyp2	
    <1231>   DW_AT_decl_file   : 1	
    <1232>   DW_AT_decl_line   : 214	
    <1233>   DW_AT_type        : <0xc94>	
    <1237>   DW_AT_location    : 3 byte block: 91 a0 79 	(DW_OP_fbreg: -864)
 <3><123b>: Abbrev Number: 26 (DW_TAG_variable)
    <123c>   DW_AT_name        : yyn	
    <1240>   DW_AT_decl_file   : 1	
    <1241>   DW_AT_decl_line   : 214	
    <1242>   DW_AT_type        : <0xc94>	
    <1246>   DW_AT_location    : 3 byte block: 91 a4 79 	(DW_OP_fbreg: -860)
 <3><124a>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <124b>   DW_AT_low_pc      : 0x402fa7	
    <1253>   DW_AT_high_pc     : 0x7c	
 <4><125b>: Abbrev Number: 27 (DW_TAG_variable)
    <125c>   DW_AT_name        : (indirect string, offset: 0x6bf): zztmp	
    <1260>   DW_AT_decl_file   : 1	
    <1261>   DW_AT_decl_line   : 214	
    <1262>   DW_AT_type        : <0xc94>	
    <1266>   DW_AT_location    : 3 byte block: 91 c8 79 	(DW_OP_fbreg: -824)
 <4><126a>: Abbrev Number: 0
 <3><126b>: Abbrev Number: 0
 <2><126c>: Abbrev Number: 0
 <1><126d>: Abbrev Number: 11 (DW_TAG_array_type)
    <126e>   DW_AT_type        : <0xc94>	
    <1272>   DW_AT_sibling     : <0x127d>	
 <2><1276>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <1277>   DW_AT_type        : <0x996>	
    <127b>   DW_AT_upper_bound : 99	
 <2><127c>: Abbrev Number: 0
 <1><127d>: Abbrev Number: 31 (DW_TAG_subprogram)
    <127e>   DW_AT_name        : (indirect string, offset: 0x5c0): fallbackSort	
    <1282>   DW_AT_decl_file   : 1	
    <1283>   DW_AT_decl_line   : 259	
    <1285>   DW_AT_prototyped  : 1	
    <1285>   DW_AT_low_pc      : 0x40317a	
    <128d>   DW_AT_high_pc     : 0x9be	
    <1295>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1297>   DW_AT_GNU_all_tail_call_sites: 1	
    <1297>   DW_AT_sibling     : <0x13af>	
 <2><129b>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <129c>   DW_AT_name        : (indirect string, offset: 0x43d): fmap	
    <12a0>   DW_AT_decl_file   : 1	
    <12a1>   DW_AT_decl_line   : 259	
    <12a3>   DW_AT_type        : <0xec4>	
    <12a7>   DW_AT_location    : 3 byte block: 91 a8 6f 	(DW_OP_fbreg: -2136)
 <2><12ab>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <12ac>   DW_AT_name        : (indirect string, offset: 0x5ad): eclass	
    <12b0>   DW_AT_decl_file   : 1	
    <12b1>   DW_AT_decl_line   : 260	
    <12b3>   DW_AT_type        : <0xec4>	
    <12b7>   DW_AT_location    : 3 byte block: 91 a0 6f 	(DW_OP_fbreg: -2144)
 <2><12bb>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <12bc>   DW_AT_name        : (indirect string, offset: 0x4ae): bhtab	
    <12c0>   DW_AT_decl_file   : 1	
    <12c1>   DW_AT_decl_line   : 261	
    <12c3>   DW_AT_type        : <0xec4>	
    <12c7>   DW_AT_location    : 3 byte block: 91 98 6f 	(DW_OP_fbreg: -2152)
 <2><12cb>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <12cc>   DW_AT_name        : (indirect string, offset: 0xebb): nblock	
    <12d0>   DW_AT_decl_file   : 1	
    <12d1>   DW_AT_decl_line   : 262	
    <12d3>   DW_AT_type        : <0xc94>	
    <12d7>   DW_AT_location    : 3 byte block: 91 94 6f 	(DW_OP_fbreg: -2156)
 <2><12db>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <12dc>   DW_AT_name        : (indirect string, offset: 0x45d): verb	
    <12e0>   DW_AT_decl_file   : 1	
    <12e1>   DW_AT_decl_line   : 263	
    <12e3>   DW_AT_type        : <0xc94>	
    <12e7>   DW_AT_location    : 3 byte block: 91 90 6f 	(DW_OP_fbreg: -2160)
 <2><12eb>: Abbrev Number: 33 (DW_TAG_variable)
    <12ec>   DW_AT_name        : (indirect string, offset: 0xeb1): ftab	
    <12f0>   DW_AT_decl_file   : 1	
    <12f1>   DW_AT_decl_line   : 265	
    <12f3>   DW_AT_type        : <0xf79>	
    <12f7>   DW_AT_location    : 3 byte block: 91 e0 77 	(DW_OP_fbreg: -1056)
 <2><12fb>: Abbrev Number: 33 (DW_TAG_variable)
    <12fc>   DW_AT_name        : (indirect string, offset: 0x1017): ftabCopy	
    <1300>   DW_AT_decl_file   : 1	
    <1301>   DW_AT_decl_line   : 266	
    <1303>   DW_AT_type        : <0xf69>	
    <1307>   DW_AT_location    : 3 byte block: 91 e0 6f 	(DW_OP_fbreg: -2080)
 <2><130b>: Abbrev Number: 34 (DW_TAG_variable)
    <130c>   DW_AT_name        : H	
    <130e>   DW_AT_decl_file   : 1	
    <130f>   DW_AT_decl_line   : 267	
    <1311>   DW_AT_type        : <0xc94>	
    <1315>   DW_AT_location    : 3 byte block: 91 b0 6f 	(DW_OP_fbreg: -2128)
 <2><1319>: Abbrev Number: 34 (DW_TAG_variable)
    <131a>   DW_AT_name        : i	
    <131c>   DW_AT_decl_file   : 1	
    <131d>   DW_AT_decl_line   : 267	
    <131f>   DW_AT_type        : <0xc94>	
    <1323>   DW_AT_location    : 3 byte block: 91 b4 6f 	(DW_OP_fbreg: -2124)
 <2><1327>: Abbrev Number: 34 (DW_TAG_variable)
    <1328>   DW_AT_name        : j	
    <132a>   DW_AT_decl_file   : 1	
    <132b>   DW_AT_decl_line   : 267	
    <132d>   DW_AT_type        : <0xc94>	
    <1331>   DW_AT_location    : 3 byte block: 91 b8 6f 	(DW_OP_fbreg: -2120)
 <2><1335>: Abbrev Number: 34 (DW_TAG_variable)
    <1336>   DW_AT_name        : k	
    <1338>   DW_AT_decl_file   : 1	
    <1339>   DW_AT_decl_line   : 267	
    <133b>   DW_AT_type        : <0xc94>	
    <133f>   DW_AT_location    : 3 byte block: 91 bc 6f 	(DW_OP_fbreg: -2116)
 <2><1343>: Abbrev Number: 34 (DW_TAG_variable)
    <1344>   DW_AT_name        : l	
    <1346>   DW_AT_decl_file   : 1	
    <1347>   DW_AT_decl_line   : 267	
    <1349>   DW_AT_type        : <0xc94>	
    <134d>   DW_AT_location    : 3 byte block: 91 d0 6f 	(DW_OP_fbreg: -2096)
 <2><1351>: Abbrev Number: 34 (DW_TAG_variable)
    <1352>   DW_AT_name        : r	
    <1354>   DW_AT_decl_file   : 1	
    <1355>   DW_AT_decl_line   : 267	
    <1357>   DW_AT_type        : <0xc94>	
    <135b>   DW_AT_location    : 3 byte block: 91 c0 6f 	(DW_OP_fbreg: -2112)
 <2><135f>: Abbrev Number: 34 (DW_TAG_variable)
    <1360>   DW_AT_name        : cc	
    <1363>   DW_AT_decl_file   : 1	
    <1364>   DW_AT_decl_line   : 267	
    <1366>   DW_AT_type        : <0xc94>	
    <136a>   DW_AT_location    : 3 byte block: 91 c4 6f 	(DW_OP_fbreg: -2108)
 <2><136e>: Abbrev Number: 34 (DW_TAG_variable)
    <136f>   DW_AT_name        : cc1	
    <1373>   DW_AT_decl_file   : 1	
