Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x745 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x197): GNU C 4.8.1 -mtune=generic -march=x86-64 -g -fno-strict-aliasing -fstack-protector	
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0x5d): alphabet.c	
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xc9): /home/yunqi/SPEC2006/benchspec/CPU2006/456.hmmer/build/build_base_amd64-m64-gcc43-nn.0000	
    <19>   DW_AT_low_pc      : 0x40129e	
    <21>   DW_AT_high_pc     : 0xe9b	
    <29>   DW_AT_stmt_list   : 0x0	
 <1><2d>: Abbrev Number: 2 (DW_TAG_base_type)
    <2e>   DW_AT_byte_size   : 8	
    <2f>   DW_AT_encoding    : 7	(unsigned)
    <30>   DW_AT_name        : (indirect string, offset: 0x1f8): long unsigned int	
 <1><34>: Abbrev Number: 3 (DW_TAG_base_type)
    <35>   DW_AT_byte_size   : 4	
    <36>   DW_AT_encoding    : 5	(signed)
    <37>   DW_AT_name        : int	
 <1><3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <3c>   DW_AT_byte_size   : 1	
    <3d>   DW_AT_encoding    : 8	(unsigned char)
    <3e>   DW_AT_name        : (indirect string, offset: 0x17a): unsigned char	
 <1><42>: Abbrev Number: 2 (DW_TAG_base_type)
    <43>   DW_AT_byte_size   : 2	
    <44>   DW_AT_encoding    : 7	(unsigned)
    <45>   DW_AT_name        : (indirect string, offset: 0x229): short unsigned int	
 <1><49>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 4	
    <4b>   DW_AT_encoding    : 7	(unsigned)
    <4c>   DW_AT_name        : (indirect string, offset: 0x1fd): unsigned int	
 <1><50>: Abbrev Number: 2 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 1	
    <52>   DW_AT_encoding    : 6	(signed char)
    <53>   DW_AT_name        : (indirect string, offset: 0x17c): signed char	
 <1><57>: Abbrev Number: 2 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2	
    <59>   DW_AT_encoding    : 5	(signed)
    <5a>   DW_AT_name        : (indirect string, offset: 0x4a): short int	
 <1><5e>: Abbrev Number: 2 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 8	
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x128): long int	
 <1><65>: Abbrev Number: 2 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 8	
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x54): sizetype	
 <1><6c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <6d>   DW_AT_byte_size   : 8	
    <6e>   DW_AT_type        : <0x72>	
 <1><72>: Abbrev Number: 2 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 1	
    <74>   DW_AT_encoding    : 6	(signed char)
    <75>   DW_AT_name        : (indirect string, offset: 0x183): char	
 <1><79>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7a>   DW_AT_byte_size   : 8	
    <7b>   DW_AT_type        : <0x34>	
 <1><7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8	
    <81>   DW_AT_encoding    : 5	(signed)
    <82>   DW_AT_name        : (indirect string, offset: 0x123): long long int	
 <1><86>: Abbrev Number: 2 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 8	
    <88>   DW_AT_encoding    : 7	(unsigned)
    <89>   DW_AT_name        : (indirect string, offset: 0x1f3): long long unsigned int	
 <1><8d>: Abbrev Number: 2 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4	
    <8f>   DW_AT_encoding    : 4	(float)
    <90>   DW_AT_name        : (indirect string, offset: 0x0): float	
 <1><94>: Abbrev Number: 2 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8	
    <96>   DW_AT_encoding    : 4	(float)
    <97>   DW_AT_name        : (indirect string, offset: 0x2db): double	
 <1><9b>: Abbrev Number: 5 (DW_TAG_structure_type)
    <9c>   DW_AT_name        : (indirect string, offset: 0x293): gki_elem	
    <a0>   DW_AT_byte_size   : 24	
    <a1>   DW_AT_decl_file   : 2	
    <a2>   DW_AT_decl_line   : 26	
    <a3>   DW_AT_sibling     : <0xcc>	
 <2><a7>: Abbrev Number: 6 (DW_TAG_member)
    <a8>   DW_AT_name        : key	
    <ac>   DW_AT_decl_file   : 2	
    <ad>   DW_AT_decl_line   : 27	
    <ae>   DW_AT_type        : <0x6c>	
    <b2>   DW_AT_data_member_location: 0	
 <2><b3>: Abbrev Number: 6 (DW_TAG_member)
    <b4>   DW_AT_name        : idx	
    <b8>   DW_AT_decl_file   : 2	
    <b9>   DW_AT_decl_line   : 28	
    <ba>   DW_AT_type        : <0x34>	
    <be>   DW_AT_data_member_location: 8	
 <2><bf>: Abbrev Number: 6 (DW_TAG_member)
    <c0>   DW_AT_name        : nxt	
    <c4>   DW_AT_decl_file   : 2	
    <c5>   DW_AT_decl_line   : 29	
    <c6>   DW_AT_type        : <0xcc>	
    <ca>   DW_AT_data_member_location: 16	
 <2><cb>: Abbrev Number: 0
 <1><cc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd>   DW_AT_byte_size   : 8	
    <ce>   DW_AT_type        : <0x9b>	
 <1><d2>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d3>   DW_AT_byte_size   : 24	
    <d4>   DW_AT_decl_file   : 2	
    <d5>   DW_AT_decl_line   : 36	
    <d6>   DW_AT_sibling     : <0x10b>	
 <2><da>: Abbrev Number: 8 (DW_TAG_member)
    <db>   DW_AT_name        : (indirect string, offset: 0x2d5): table	
    <df>   DW_AT_decl_file   : 2	
    <e0>   DW_AT_decl_line   : 37	
    <e1>   DW_AT_type        : <0x10b>	
    <e5>   DW_AT_data_member_location: 0	
 <2><e6>: Abbrev Number: 8 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x23c): primelevel	
    <eb>   DW_AT_decl_file   : 2	
    <ec>   DW_AT_decl_line   : 39	
    <ed>   DW_AT_type        : <0x34>	
    <f1>   DW_AT_data_member_location: 8	
 <2><f2>: Abbrev Number: 8 (DW_TAG_member)
    <f3>   DW_AT_name        : (indirect string, offset: 0x16d): nhash	
    <f7>   DW_AT_decl_file   : 2	
    <f8>   DW_AT_decl_line   : 40	
    <f9>   DW_AT_type        : <0x34>	
    <fd>   DW_AT_data_member_location: 12	
 <2><fe>: Abbrev Number: 8 (DW_TAG_member)
    <ff>   DW_AT_name        : (indirect string, offset: 0x2275): nkeys	
    <103>   DW_AT_decl_file   : 2	
    <104>   DW_AT_decl_line   : 41	
    <105>   DW_AT_type        : <0x34>	
    <109>   DW_AT_data_member_location: 16	
 <2><10a>: Abbrev Number: 0
 <1><10b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <10c>   DW_AT_byte_size   : 8	
    <10d>   DW_AT_type        : <0xcc>	
 <1><111>: Abbrev Number: 9 (DW_TAG_typedef)
    <112>   DW_AT_name        : GKI	
    <116>   DW_AT_decl_file   : 2	
    <117>   DW_AT_decl_line   : 42	
    <118>   DW_AT_type        : <0xd2>	
 <1><11c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <11d>   DW_AT_byte_size   : 8	
    <11e>   DW_AT_type        : <0x6c>	
 <1><122>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <123>   DW_AT_byte_size   : 8	
    <124>   DW_AT_type        : <0x8d>	
 <1><128>: Abbrev Number: 10 (DW_TAG_structure_type)
    <129>   DW_AT_name        : (indirect string, offset: 0x2a5): msa_struct	
    <12d>   DW_AT_byte_size   : 360	
    <12f>   DW_AT_decl_file   : 3	
    <130>   DW_AT_decl_line   : 112	
    <131>   DW_AT_sibling     : <0x364>	
 <2><135>: Abbrev Number: 8 (DW_TAG_member)
    <136>   DW_AT_name        : (indirect string, offset: 0x2844): aseq	
    <13a>   DW_AT_decl_file   : 3	
    <13b>   DW_AT_decl_line   : 115	
    <13c>   DW_AT_type        : <0x11c>	
    <140>   DW_AT_data_member_location: 0	
 <2><141>: Abbrev Number: 8 (DW_TAG_member)
    <142>   DW_AT_name        : (indirect string, offset: 0x2855): sqname	
    <146>   DW_AT_decl_file   : 3	
    <147>   DW_AT_decl_line   : 116	
    <148>   DW_AT_type        : <0x11c>	
    <14c>   DW_AT_data_member_location: 8	
 <2><14d>: Abbrev Number: 6 (DW_TAG_member)
    <14e>   DW_AT_name        : wgt	
    <152>   DW_AT_decl_file   : 3	
    <153>   DW_AT_decl_line   : 117	
    <154>   DW_AT_type        : <0x122>	
    <158>   DW_AT_data_member_location: 16	
 <2><159>: Abbrev Number: 8 (DW_TAG_member)
    <15a>   DW_AT_name        : (indirect string, offset: 0x2871): alen	
    <15e>   DW_AT_decl_file   : 3	
    <15f>   DW_AT_decl_line   : 118	
    <160>   DW_AT_type        : <0x34>	
    <164>   DW_AT_data_member_location: 24	
 <2><165>: Abbrev Number: 8 (DW_TAG_member)
    <166>   DW_AT_name        : (indirect string, offset: 0x12d5): nseq	
    <16a>   DW_AT_decl_file   : 3	
    <16b>   DW_AT_decl_line   : 119	
    <16c>   DW_AT_type        : <0x34>	
    <170>   DW_AT_data_member_location: 28	
 <2><171>: Abbrev Number: 8 (DW_TAG_member)
    <172>   DW_AT_name        : (indirect string, offset: 0x32bd): flags	
    <176>   DW_AT_decl_file   : 3	
    <177>   DW_AT_decl_line   : 123	
    <178>   DW_AT_type        : <0x34>	
    <17c>   DW_AT_data_member_location: 32	
 <2><17d>: Abbrev Number: 8 (DW_TAG_member)
    <17e>   DW_AT_name        : (indirect string, offset: 0x2864): type	
    <182>   DW_AT_decl_file   : 3	
    <183>   DW_AT_decl_line   : 124	
    <184>   DW_AT_type        : <0x34>	
    <188>   DW_AT_data_member_location: 36	
 <2><189>: Abbrev Number: 8 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x19c0): name	
    <18e>   DW_AT_decl_file   : 3	
    <18f>   DW_AT_decl_line   : 125	
    <190>   DW_AT_type        : <0x6c>	
    <194>   DW_AT_data_member_location: 40	
 <2><195>: Abbrev Number: 8 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0x1a62): desc	
    <19a>   DW_AT_decl_file   : 3	
    <19b>   DW_AT_decl_line   : 126	
    <19c>   DW_AT_type        : <0x6c>	
    <1a0>   DW_AT_data_member_location: 48	
 <2><1a1>: Abbrev Number: 6 (DW_TAG_member)
    <1a2>   DW_AT_name        : acc	
    <1a6>   DW_AT_decl_file   : 3	
    <1a7>   DW_AT_decl_line   : 127	
    <1a8>   DW_AT_type        : <0x6c>	
    <1ac>   DW_AT_data_member_location: 56	
 <2><1ad>: Abbrev Number: 6 (DW_TAG_member)
    <1ae>   DW_AT_name        : au	
    <1b1>   DW_AT_decl_file   : 3	
    <1b2>   DW_AT_decl_line   : 128	
    <1b3>   DW_AT_type        : <0x6c>	
    <1b7>   DW_AT_data_member_location: 64	
 <2><1b8>: Abbrev Number: 8 (DW_TAG_member)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x260): ss_cons	
    <1bd>   DW_AT_decl_file   : 3	
    <1be>   DW_AT_decl_line   : 129	
    <1bf>   DW_AT_type        : <0x6c>	
    <1c3>   DW_AT_data_member_location: 72	
 <2><1c4>: Abbrev Number: 8 (DW_TAG_member)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x86): sa_cons	
    <1c9>   DW_AT_decl_file   : 3	
    <1ca>   DW_AT_decl_line   : 130	
    <1cb>   DW_AT_type        : <0x6c>	
    <1cf>   DW_AT_data_member_location: 80	
 <2><1d0>: Abbrev Number: 6 (DW_TAG_member)
    <1d1>   DW_AT_name        : rf	
    <1d4>   DW_AT_decl_file   : 3	
    <1d5>   DW_AT_decl_line   : 131	
    <1d6>   DW_AT_type        : <0x6c>	
    <1da>   DW_AT_data_member_location: 88	
 <2><1db>: Abbrev Number: 8 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x27f): sqacc	
    <1e0>   DW_AT_decl_file   : 3	
    <1e1>   DW_AT_decl_line   : 132	
    <1e2>   DW_AT_type        : <0x11c>	
    <1e6>   DW_AT_data_member_location: 96	
 <2><1e7>: Abbrev Number: 8 (DW_TAG_member)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x173): sqdesc	
    <1ec>   DW_AT_decl_file   : 3	
    <1ed>   DW_AT_decl_line   : 133	
    <1ee>   DW_AT_type        : <0x11c>	
    <1f2>   DW_AT_data_member_location: 104	
 <2><1f3>: Abbrev Number: 6 (DW_TAG_member)
    <1f4>   DW_AT_name        : ss	
    <1f7>   DW_AT_decl_file   : 3	
    <1f8>   DW_AT_decl_line   : 134	
    <1f9>   DW_AT_type        : <0x11c>	
    <1fd>   DW_AT_data_member_location: 112	
 <2><1fe>: Abbrev Number: 6 (DW_TAG_member)
    <1ff>   DW_AT_name        : sa	
    <202>   DW_AT_decl_file   : 3	
    <203>   DW_AT_decl_line   : 135	
    <204>   DW_AT_type        : <0x11c>	
    <208>   DW_AT_data_member_location: 120	
 <2><209>: Abbrev Number: 8 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x6): cutoff	
    <20e>   DW_AT_decl_file   : 3	
    <20f>   DW_AT_decl_line   : 136	
    <210>   DW_AT_type        : <0x364>	
    <214>   DW_AT_data_member_location: 128	
 <2><215>: Abbrev Number: 8 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0xd): cutoff_is_set	
    <21a>   DW_AT_decl_file   : 3	
    <21b>   DW_AT_decl_line   : 137	
    <21c>   DW_AT_type        : <0x374>	
    <220>   DW_AT_data_member_location: 152	
 <2><221>: Abbrev Number: 8 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x3543): comment	
    <226>   DW_AT_decl_file   : 3	
    <227>   DW_AT_decl_line   : 144	
    <228>   DW_AT_type        : <0x11c>	
    <22c>   DW_AT_data_member_location: 176	
 <2><22d>: Abbrev Number: 8 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x18e): ncomment	
    <232>   DW_AT_decl_file   : 3	
    <233>   DW_AT_decl_line   : 145	
    <234>   DW_AT_type        : <0x34>	
    <238>   DW_AT_data_member_location: 184	
 <2><239>: Abbrev Number: 8 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x188): alloc_ncomment	
    <23e>   DW_AT_decl_file   : 3	
    <23f>   DW_AT_decl_line   : 146	
    <240>   DW_AT_type        : <0x34>	
    <244>   DW_AT_data_member_location: 188	
 <2><245>: Abbrev Number: 8 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x2ce): gf_tag	
    <24a>   DW_AT_decl_file   : 3	
    <24b>   DW_AT_decl_line   : 148	
    <24c>   DW_AT_type        : <0x11c>	
    <250>   DW_AT_data_member_location: 192	
 <2><251>: Abbrev Number: 6 (DW_TAG_member)
    <252>   DW_AT_name        : gf	
    <255>   DW_AT_decl_file   : 3	
    <256>   DW_AT_decl_line   : 149	
    <257>   DW_AT_type        : <0x11c>	
    <25b>   DW_AT_data_member_location: 200	
 <2><25c>: Abbrev Number: 6 (DW_TAG_member)
    <25d>   DW_AT_name        : ngf	
    <261>   DW_AT_decl_file   : 3	
    <262>   DW_AT_decl_line   : 150	
    <263>   DW_AT_type        : <0x34>	
    <267>   DW_AT_data_member_location: 208	
 <2><268>: Abbrev Number: 8 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x39): alloc_ngf	
    <26d>   DW_AT_decl_file   : 3	
    <26e>   DW_AT_decl_line   : 151	
    <26f>   DW_AT_type        : <0x34>	
    <273>   DW_AT_data_member_location: 212	
 <2><274>: Abbrev Number: 8 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x166): gs_tag	
    <279>   DW_AT_decl_file   : 3	
    <27a>   DW_AT_decl_line   : 153	
    <27b>   DW_AT_type        : <0x11c>	
    <27f>   DW_AT_data_member_location: 216	
 <2><280>: Abbrev Number: 6 (DW_TAG_member)
    <281>   DW_AT_name        : gs	
    <284>   DW_AT_decl_file   : 3	
    <285>   DW_AT_decl_line   : 154	
    <286>   DW_AT_type        : <0x384>	
    <28a>   DW_AT_data_member_location: 224	
 <2><28b>: Abbrev Number: 8 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x211): gs_idx	
    <290>   DW_AT_decl_file   : 3	
    <291>   DW_AT_decl_line   : 155	
    <292>   DW_AT_type        : <0x38a>	
    <296>   DW_AT_data_member_location: 232	
 <2><297>: Abbrev Number: 6 (DW_TAG_member)
    <298>   DW_AT_name        : ngs	
    <29c>   DW_AT_decl_file   : 3	
    <29d>   DW_AT_decl_line   : 156	
    <29e>   DW_AT_type        : <0x34>	
    <2a2>   DW_AT_data_member_location: 240	
 <2><2a3>: Abbrev Number: 8 (DW_TAG_member)
    <2a4>   DW_AT_name        : (indirect string, offset: 0x2bf): gc_tag	
    <2a8>   DW_AT_decl_file   : 3	
    <2a9>   DW_AT_decl_line   : 158	
    <2aa>   DW_AT_type        : <0x11c>	
    <2ae>   DW_AT_data_member_location: 248	
 <2><2af>: Abbrev Number: 11 (DW_TAG_member)
    <2b0>   DW_AT_name        : gc	
    <2b3>   DW_AT_decl_file   : 3	
    <2b4>   DW_AT_decl_line   : 159	
    <2b5>   DW_AT_type        : <0x11c>	
    <2b9>   DW_AT_data_member_location: 256	
 <2><2bb>: Abbrev Number: 12 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x2fd): gc_idx	
    <2c0>   DW_AT_decl_file   : 3	
    <2c1>   DW_AT_decl_line   : 160	
    <2c2>   DW_AT_type        : <0x38a>	
    <2c6>   DW_AT_data_member_location: 264	
 <2><2c8>: Abbrev Number: 11 (DW_TAG_member)
    <2c9>   DW_AT_name        : ngc	
    <2cd>   DW_AT_decl_file   : 3	
    <2ce>   DW_AT_decl_line   : 161	
    <2cf>   DW_AT_type        : <0x34>	
    <2d3>   DW_AT_data_member_location: 272	
 <2><2d5>: Abbrev Number: 12 (DW_TAG_member)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x43): gr_tag	
    <2da>   DW_AT_decl_file   : 3	
    <2db>   DW_AT_decl_line   : 163	
    <2dc>   DW_AT_type        : <0x11c>	
    <2e0>   DW_AT_data_member_location: 280	
 <2><2e2>: Abbrev Number: 11 (DW_TAG_member)
    <2e3>   DW_AT_name        : gr	
    <2e6>   DW_AT_decl_file   : 3	
    <2e7>   DW_AT_decl_line   : 164	
    <2e8>   DW_AT_type        : <0x384>	
    <2ec>   DW_AT_data_member_location: 288	
 <2><2ee>: Abbrev Number: 12 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x9a): gr_idx	
    <2f3>   DW_AT_decl_file   : 3	
    <2f4>   DW_AT_decl_line   : 165	
    <2f5>   DW_AT_type        : <0x38a>	
    <2f9>   DW_AT_data_member_location: 296	
 <2><2fb>: Abbrev Number: 11 (DW_TAG_member)
    <2fc>   DW_AT_name        : ngr	
    <300>   DW_AT_decl_file   : 3	
    <301>   DW_AT_decl_line   : 166	
    <302>   DW_AT_type        : <0x34>	
    <306>   DW_AT_data_member_location: 304	
 <2><308>: Abbrev Number: 12 (DW_TAG_member)
    <309>   DW_AT_name        : (indirect string, offset: 0x2607): index	
    <30d>   DW_AT_decl_file   : 3	
    <30e>   DW_AT_decl_line   : 170	
    <30f>   DW_AT_type        : <0x38a>	
    <313>   DW_AT_data_member_location: 312	
 <2><315>: Abbrev Number: 12 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0x247): nseqalloc	
    <31a>   DW_AT_decl_file   : 3	
    <31b>   DW_AT_decl_line   : 171	
    <31c>   DW_AT_type        : <0x34>	
    <320>   DW_AT_data_member_location: 320	
 <2><322>: Abbrev Number: 12 (DW_TAG_member)
    <323>   DW_AT_name        : (indirect string, offset: 0x29c): nseqlump	
    <327>   DW_AT_decl_file   : 3	
    <328>   DW_AT_decl_line   : 172	
    <329>   DW_AT_type        : <0x34>	
    <32d>   DW_AT_data_member_location: 324	
 <2><32f>: Abbrev Number: 12 (DW_TAG_member)
    <330>   DW_AT_name        : (indirect string, offset: 0x1a77): sqlen	
    <334>   DW_AT_decl_file   : 3	
    <335>   DW_AT_decl_line   : 173	
    <336>   DW_AT_type        : <0x79>	
    <33a>   DW_AT_data_member_location: 328	
 <2><33c>: Abbrev Number: 12 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0x139): sslen	
    <341>   DW_AT_decl_file   : 3	
    <342>   DW_AT_decl_line   : 174	
    <343>   DW_AT_type        : <0x79>	
    <347>   DW_AT_data_member_location: 336	
 <2><349>: Abbrev Number: 12 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x2e2): salen	
    <34e>   DW_AT_decl_file   : 3	
    <34f>   DW_AT_decl_line   : 175	
    <350>   DW_AT_type        : <0x79>	
    <354>   DW_AT_data_member_location: 344	
 <2><356>: Abbrev Number: 12 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x131): lastidx	
    <35b>   DW_AT_decl_file   : 3	
    <35c>   DW_AT_decl_line   : 176	
    <35d>   DW_AT_type        : <0x34>	
    <361>   DW_AT_data_member_location: 352	
 <2><363>: Abbrev Number: 0
 <1><364>: Abbrev Number: 13 (DW_TAG_array_type)
    <365>   DW_AT_type        : <0x8d>	
    <369>   DW_AT_sibling     : <0x374>	
 <2><36d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <36e>   DW_AT_type        : <0x65>	
    <372>   DW_AT_upper_bound : 5	
 <2><373>: Abbrev Number: 0
 <1><374>: Abbrev Number: 13 (DW_TAG_array_type)
    <375>   DW_AT_type        : <0x34>	
    <379>   DW_AT_sibling     : <0x384>	
 <2><37d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <37e>   DW_AT_type        : <0x65>	
    <382>   DW_AT_upper_bound : 5	
 <2><383>: Abbrev Number: 0
 <1><384>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <385>   DW_AT_byte_size   : 8	
    <386>   DW_AT_type        : <0x11c>	
 <1><38a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <38b>   DW_AT_byte_size   : 8	
    <38c>   DW_AT_type        : <0x111>	
 <1><390>: Abbrev Number: 9 (DW_TAG_typedef)
    <391>   DW_AT_name        : MSA	
    <395>   DW_AT_decl_file   : 3	
    <396>   DW_AT_decl_line   : 177	
    <397>   DW_AT_type        : <0x128>	
 <1><39b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <39c>   DW_AT_byte_size   : 8	
    <39d>   DW_AT_type        : <0x390>	
 <1><3a1>: Abbrev Number: 15 (DW_TAG_subprogram)
    <3a2>   DW_AT_external    : 1	
    <3a2>   DW_AT_name        : (indirect string, offset: 0x26d): DetermineAlphabet	
    <3a6>   DW_AT_decl_file   : 1	
    <3a7>   DW_AT_decl_line   : 44	
    <3a8>   DW_AT_prototyped  : 1	
    <3a8>   DW_AT_low_pc      : 0x40129e	
    <3b0>   DW_AT_high_pc     : 0x12d	
    <3b8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3ba>   DW_AT_GNU_all_tail_call_sites: 1	
    <3ba>   DW_AT_sibling     : <0x421>	
 <2><3be>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x29a3): rseqs	
    <3c3>   DW_AT_decl_file   : 1	
    <3c4>   DW_AT_decl_line   : 44	
    <3c5>   DW_AT_type        : <0x11c>	
    <3c9>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><3cc>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x12d5): nseq	
    <3d1>   DW_AT_decl_file   : 1	
    <3d2>   DW_AT_decl_line   : 44	
    <3d3>   DW_AT_type        : <0x34>	
    <3d7>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><3da>: Abbrev Number: 17 (DW_TAG_variable)
    <3db>   DW_AT_name        : idx	
    <3df>   DW_AT_decl_file   : 1	
    <3e0>   DW_AT_decl_line   : 46	
    <3e1>   DW_AT_type        : <0x34>	
    <3e5>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><3e8>: Abbrev Number: 18 (DW_TAG_variable)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x2d00): other	
    <3ed>   DW_AT_decl_file   : 1	
    <3ee>   DW_AT_decl_line   : 47	
    <3ef>   DW_AT_type        : <0x34>	
    <3f3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><3f6>: Abbrev Number: 18 (DW_TAG_variable)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x2c6): nucleic	
    <3fb>   DW_AT_decl_file   : 1	
    <3fc>   DW_AT_decl_line   : 47	
    <3fd>   DW_AT_type        : <0x34>	
    <401>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><404>: Abbrev Number: 18 (DW_TAG_variable)
    <405>   DW_AT_name        : (indirect string, offset: 0x2c54): amino	
    <409>   DW_AT_decl_file   : 1	
    <40a>   DW_AT_decl_line   : 47	
    <40b>   DW_AT_type        : <0x34>	
    <40f>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><412>: Abbrev Number: 18 (DW_TAG_variable)
    <413>   DW_AT_name        : (indirect string, offset: 0x2864): type	
    <417>   DW_AT_decl_file   : 1	
    <418>   DW_AT_decl_line   : 48	
    <419>   DW_AT_type        : <0x34>	
    <41d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><420>: Abbrev Number: 0
 <1><421>: Abbrev Number: 15 (DW_TAG_subprogram)
    <422>   DW_AT_external    : 1	
    <422>   DW_AT_name        : (indirect string, offset: 0x8e): SetAlphabet	
    <426>   DW_AT_decl_file   : 1	
    <427>   DW_AT_decl_line   : 88	
    <428>   DW_AT_prototyped  : 1	
    <428>   DW_AT_low_pc      : 0x4013cb	
    <430>   DW_AT_high_pc     : 0x32a	
    <438>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <43a>   DW_AT_GNU_all_tail_call_sites: 1	
    <43a>   DW_AT_sibling     : <0x459>	
 <2><43e>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <43f>   DW_AT_name        : (indirect string, offset: 0x2864): type	
    <443>   DW_AT_decl_file   : 1	
    <444>   DW_AT_decl_line   : 88	
    <445>   DW_AT_type        : <0x34>	
    <449>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><44c>: Abbrev Number: 17 (DW_TAG_variable)
    <44d>   DW_AT_name        : x	
    <44f>   DW_AT_decl_file   : 1	
    <450>   DW_AT_decl_line   : 90	
    <451>   DW_AT_type        : <0x34>	
    <455>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 19 (DW_TAG_subprogram)
    <45a>   DW_AT_external    : 1	
    <45a>   DW_AT_name        : (indirect string, offset: 0x2d): SymbolIndex	
    <45e>   DW_AT_decl_file   : 1	
    <45f>   DW_AT_decl_line   : 184	
    <460>   DW_AT_prototyped  : 1	
    <460>   DW_AT_type        : <0x34>	
    <464>   DW_AT_low_pc      : 0x4016f5	
    <46c>   DW_AT_high_pc     : 0x4e	
    <474>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <476>   DW_AT_GNU_all_tail_call_sites: 1	
    <476>   DW_AT_sibling     : <0x495>	
 <2><47a>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <47b>   DW_AT_name        : sym	
    <47f>   DW_AT_decl_file   : 1	
    <480>   DW_AT_decl_line   : 184	
    <481>   DW_AT_type        : <0x72>	
    <485>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><488>: Abbrev Number: 17 (DW_TAG_variable)
    <489>   DW_AT_name        : s	
    <48b>   DW_AT_decl_file   : 1	
    <48c>   DW_AT_decl_line   : 186	
    <48d>   DW_AT_type        : <0x6c>	
    <491>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><494>: Abbrev Number: 0
 <1><495>: Abbrev Number: 19 (DW_TAG_subprogram)
    <496>   DW_AT_external    : 1	
    <496>   DW_AT_name        : (indirect string, offset: 0xb8): DigitizeSequence	
    <49a>   DW_AT_decl_file   : 1	
    <49b>   DW_AT_decl_line   : 210	
    <49c>   DW_AT_prototyped  : 1	
    <49c>   DW_AT_type        : <0x6c>	
    <4a0>   DW_AT_low_pc      : 0x401743	
    <4a8>   DW_AT_high_pc     : 0x9c	
    <4b0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4b2>   DW_AT_GNU_all_tail_call_sites: 1	
    <4b2>   DW_AT_sibling     : <0x4eb>	
 <2><4b6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <4b7>   DW_AT_name        : seq	
    <4bb>   DW_AT_decl_file   : 1	
    <4bc>   DW_AT_decl_line   : 210	
    <4bd>   DW_AT_type        : <0x6c>	
    <4c1>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><4c4>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <4c5>   DW_AT_name        : L	
    <4c7>   DW_AT_decl_file   : 1	
    <4c8>   DW_AT_decl_line   : 210	
    <4c9>   DW_AT_type        : <0x34>	
    <4cd>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><4d0>: Abbrev Number: 17 (DW_TAG_variable)
    <4d1>   DW_AT_name        : dsq	
    <4d5>   DW_AT_decl_file   : 1	
    <4d6>   DW_AT_decl_line   : 212	
    <4d7>   DW_AT_type        : <0x6c>	
    <4db>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><4de>: Abbrev Number: 17 (DW_TAG_variable)
    <4df>   DW_AT_name        : i	
    <4e1>   DW_AT_decl_file   : 1	
    <4e2>   DW_AT_decl_line   : 213	
    <4e3>   DW_AT_type        : <0x34>	
    <4e7>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><4ea>: Abbrev Number: 0
 <1><4eb>: Abbrev Number: 19 (DW_TAG_subprogram)
    <4ec>   DW_AT_external    : 1	
    <4ec>   DW_AT_name        : (indirect string, offset: 0x153): DedigitizeSequence	
    <4f0>   DW_AT_decl_file   : 1	
    <4f1>   DW_AT_decl_line   : 230	
    <4f2>   DW_AT_prototyped  : 1	
    <4f2>   DW_AT_type        : <0x6c>	
    <4f6>   DW_AT_low_pc      : 0x4017df	
    <4fe>   DW_AT_high_pc     : 0x86	
    <506>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <508>   DW_AT_GNU_all_tail_call_sites: 1	
    <508>   DW_AT_sibling     : <0x541>	
 <2><50c>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <50d>   DW_AT_name        : dsq	
    <511>   DW_AT_decl_file   : 1	
    <512>   DW_AT_decl_line   : 230	
    <513>   DW_AT_type        : <0x6c>	
    <517>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><51a>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <51b>   DW_AT_name        : L	
    <51d>   DW_AT_decl_file   : 1	
    <51e>   DW_AT_decl_line   : 230	
    <51f>   DW_AT_type        : <0x34>	
    <523>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><526>: Abbrev Number: 17 (DW_TAG_variable)
    <527>   DW_AT_name        : seq	
    <52b>   DW_AT_decl_file   : 1	
    <52c>   DW_AT_decl_line   : 232	
    <52d>   DW_AT_type        : <0x6c>	
    <531>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><534>: Abbrev Number: 17 (DW_TAG_variable)
    <535>   DW_AT_name        : i	
    <537>   DW_AT_decl_file   : 1	
    <538>   DW_AT_decl_line   : 233	
    <539>   DW_AT_type        : <0x34>	
    <53d>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><540>: Abbrev Number: 0
 <1><541>: Abbrev Number: 21 (DW_TAG_subprogram)
    <542>   DW_AT_external    : 1	
    <542>   DW_AT_name        : (indirect string, offset: 0x1b): DigitizeAlignment	
    <546>   DW_AT_decl_file   : 1	
    <547>   DW_AT_decl_line   : 257	
    <549>   DW_AT_prototyped  : 1	
    <549>   DW_AT_low_pc      : 0x401865	
    <551>   DW_AT_high_pc     : 0x227	
    <559>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <55b>   DW_AT_GNU_all_tail_call_sites: 1	
    <55b>   DW_AT_sibling     : <0x5bc>	
 <2><55f>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <560>   DW_AT_name        : msa	
    <564>   DW_AT_decl_file   : 1	
    <565>   DW_AT_decl_line   : 257	
    <567>   DW_AT_type        : <0x39b>	
    <56b>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><56f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <570>   DW_AT_name        : (indirect string, offset: 0x14a): ret_dsqs	
    <574>   DW_AT_decl_file   : 1	
    <575>   DW_AT_decl_line   : 257	
    <577>   DW_AT_type        : <0x384>	
    <57b>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><57f>: Abbrev Number: 24 (DW_TAG_variable)
    <580>   DW_AT_name        : dsq	
    <584>   DW_AT_decl_file   : 1	
    <585>   DW_AT_decl_line   : 259	
    <587>   DW_AT_type        : <0x11c>	
    <58b>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><58e>: Abbrev Number: 24 (DW_TAG_variable)
    <58f>   DW_AT_name        : idx	
    <593>   DW_AT_decl_file   : 1	
    <594>   DW_AT_decl_line   : 260	
    <596>   DW_AT_type        : <0x34>	
    <59a>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><59d>: Abbrev Number: 25 (DW_TAG_variable)
    <59e>   DW_AT_name        : (indirect string, offset: 0x268): dpos	
    <5a2>   DW_AT_decl_file   : 1	
    <5a3>   DW_AT_decl_line   : 261	
    <5a5>   DW_AT_type        : <0x34>	
    <5a9>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><5ac>: Abbrev Number: 25 (DW_TAG_variable)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x2e8): apos	
    <5b1>   DW_AT_decl_file   : 1	
    <5b2>   DW_AT_decl_line   : 262	
    <5b4>   DW_AT_type        : <0x34>	
    <5b8>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><5bb>: Abbrev Number: 0
 <1><5bc>: Abbrev Number: 26 (DW_TAG_subprogram)
    <5bd>   DW_AT_external    : 1	
    <5bd>   DW_AT_name        : (indirect string, offset: 0x285): P7CountSymbol	
    <5c1>   DW_AT_decl_file   : 1	
    <5c2>   DW_AT_decl_line   : 293	
    <5c4>   DW_AT_prototyped  : 1	
    <5c4>   DW_AT_low_pc      : 0x401a8c	
    <5cc>   DW_AT_high_pc     : 0xf7	
    <5d4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5d6>   DW_AT_GNU_all_call_sites: 1	
    <5d6>   DW_AT_sibling     : <0x614>	
 <2><5da>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5db>   DW_AT_name        : (indirect string, offset: 0x2f4): counters	
    <5df>   DW_AT_decl_file   : 1	
    <5e0>   DW_AT_decl_line   : 293	
    <5e2>   DW_AT_type        : <0x122>	
    <5e6>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><5e9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x2ed): symidx	
    <5ee>   DW_AT_decl_file   : 1	
    <5ef>   DW_AT_decl_line   : 293	
    <5f1>   DW_AT_type        : <0x72>	
    <5f5>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><5f8>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5f9>   DW_AT_name        : wt	
    <5fc>   DW_AT_decl_file   : 1	
    <5fd>   DW_AT_decl_line   : 293	
    <5ff>   DW_AT_type        : <0x8d>	
    <603>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><606>: Abbrev Number: 24 (DW_TAG_variable)
    <607>   DW_AT_name        : x	
    <609>   DW_AT_decl_file   : 1	
    <60a>   DW_AT_decl_line   : 295	
    <60c>   DW_AT_type        : <0x34>	
    <610>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><613>: Abbrev Number: 0
 <1><614>: Abbrev Number: 21 (DW_TAG_subprogram)
    <615>   DW_AT_external    : 1	
    <615>   DW_AT_name        : (indirect string, offset: 0x73): DefaultGeneticCode	
    <619>   DW_AT_decl_file   : 1	
    <61a>   DW_AT_decl_line   : 320	
    <61c>   DW_AT_prototyped  : 1	
    <61c>   DW_AT_low_pc      : 0x401b83	
    <624>   DW_AT_high_pc     : 0x9b	
    <62c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <62e>   DW_AT_GNU_all_tail_call_sites: 1	
    <62e>   DW_AT_sibling     : <0x64f>	
 <2><632>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <633>   DW_AT_name        : (indirect string, offset: 0x20a): aacode	
    <637>   DW_AT_decl_file   : 1	
    <638>   DW_AT_decl_line   : 320	
    <63a>   DW_AT_type        : <0x79>	
    <63e>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><641>: Abbrev Number: 24 (DW_TAG_variable)
    <642>   DW_AT_name        : x	
    <644>   DW_AT_decl_file   : 1	
    <645>   DW_AT_decl_line   : 322	
    <647>   DW_AT_type        : <0x34>	
    <64b>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><64e>: Abbrev Number: 0
 <1><64f>: Abbrev Number: 26 (DW_TAG_subprogram)
    <650>   DW_AT_external    : 1	
    <650>   DW_AT_name        : (indirect string, offset: 0x218): DefaultCodonBias	
    <654>   DW_AT_decl_file   : 1	
    <655>   DW_AT_decl_line   : 343	
    <657>   DW_AT_prototyped  : 1	
    <657>   DW_AT_low_pc      : 0x401c1e	
    <65f>   DW_AT_high_pc     : 0x466	
    <667>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <669>   DW_AT_GNU_all_call_sites: 1	
    <669>   DW_AT_sibling     : <0x67d>	
 <2><66d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <66e>   DW_AT_name        : (indirect string, offset: 0xaf): codebias	
    <672>   DW_AT_decl_file   : 1	
    <673>   DW_AT_decl_line   : 343	
    <675>   DW_AT_type        : <0x122>	
    <679>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><67c>: Abbrev Number: 0
 <1><67d>: Abbrev Number: 27 (DW_TAG_subprogram)
    <67e>   DW_AT_name        : (indirect string, offset: 0x2b0): set_degenerate	
    <682>   DW_AT_decl_file   : 1	
    <683>   DW_AT_decl_line   : 419	
    <685>   DW_AT_prototyped  : 1	
    <685>   DW_AT_low_pc      : 0x402084	
    <68d>   DW_AT_high_pc     : 0xb5	
    <695>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <697>   DW_AT_GNU_all_tail_call_sites: 1	
    <697>   DW_AT_sibling     : <0x6ba>	
 <2><69b>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <69c>   DW_AT_name        : (indirect string, offset: 0x25a): iupac	
    <6a0>   DW_AT_decl_file   : 1	
    <6a1>   DW_AT_decl_line   : 419	
    <6a3>   DW_AT_type        : <0x72>	
    <6a7>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><6aa>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x2916): syms	
    <6af>   DW_AT_decl_file   : 1	
    <6b0>   DW_AT_decl_line   : 419	
    <6b2>   DW_AT_type        : <0x6c>	
    <6b6>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><6b9>: Abbrev Number: 0
 <1><6ba>: Abbrev Number: 13 (DW_TAG_array_type)
    <6bb>   DW_AT_type        : <0x6c>	
    <6bf>   DW_AT_sibling     : <0x6c5>	
 <2><6c3>: Abbrev Number: 28 (DW_TAG_subrange_type)
 <2><6c4>: Abbrev Number: 0
 <1><6c5>: Abbrev Number: 29 (DW_TAG_variable)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x1ea): stdcode1	
    <6ca>   DW_AT_decl_file   : 4	
    <6cb>   DW_AT_decl_line   : 126	
    <6cc>   DW_AT_type        : <0x6ba>	
    <6d0>   DW_AT_external    : 1	
    <6d0>   DW_AT_declaration : 1	
 <1><6d0>: Abbrev Number: 13 (DW_TAG_array_type)
    <6d1>   DW_AT_type        : <0x72>	
    <6d5>   DW_AT_sibling     : <0x6e0>	
 <2><6d9>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <6da>   DW_AT_type        : <0x65>	
    <6de>   DW_AT_upper_bound : 24	
 <2><6df>: Abbrev Number: 0
 <1><6e0>: Abbrev Number: 29 (DW_TAG_variable)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x276): Alphabet	
    <6e5>   DW_AT_decl_file   : 5	
    <6e6>   DW_AT_decl_line   : 57	
    <6e7>   DW_AT_type        : <0x6d0>	
    <6eb>   DW_AT_external    : 1	
    <6eb>   DW_AT_declaration : 1	
 <1><6eb>: Abbrev Number: 29 (DW_TAG_variable)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x304): Alphabet_type	
    <6f0>   DW_AT_decl_file   : 5	
    <6f1>   DW_AT_decl_line   : 58	
    <6f2>   DW_AT_type        : <0x34>	
    <6f6>   DW_AT_external    : 1	
    <6f6>   DW_AT_declaration : 1	
 <1><6f6>: Abbrev Number: 29 (DW_TAG_variable)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xa1): Alphabet_size	
    <6fb>   DW_AT_decl_file   : 5	
    <6fc>   DW_AT_decl_line   : 59	
    <6fd>   DW_AT_type        : <0x34>	
    <701>   DW_AT_external    : 1	
    <701>   DW_AT_declaration : 1	
 <1><701>: Abbrev Number: 29 (DW_TAG_variable)
    <702>   DW_AT_name        : (indirect string, offset: 0x251): Alphabet_iupac	
    <706>   DW_AT_decl_file   : 5	
    <707>   DW_AT_decl_line   : 60	
    <708>   DW_AT_type        : <0x34>	
    <70c>   DW_AT_external    : 1	
    <70c>   DW_AT_declaration : 1	
 <1><70c>: Abbrev Number: 13 (DW_TAG_array_type)
    <70d>   DW_AT_type        : <0x72>	
    <711>   DW_AT_sibling     : <0x722>	
 <2><715>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <716>   DW_AT_type        : <0x65>	
    <71a>   DW_AT_upper_bound : 23	
 <2><71b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <71c>   DW_AT_type        : <0x65>	
    <720>   DW_AT_upper_bound : 19	
 <2><721>: Abbrev Number: 0
 <1><722>: Abbrev Number: 29 (DW_TAG_variable)
    <723>   DW_AT_name        : (indirect string, offset: 0x13f): Degenerate	
    <727>   DW_AT_decl_file   : 5	
    <728>   DW_AT_decl_line   : 61	
    <729>   DW_AT_type        : <0x70c>	
    <72d>   DW_AT_external    : 1	
    <72d>   DW_AT_declaration : 1	
 <1><72d>: Abbrev Number: 13 (DW_TAG_array_type)
    <72e>   DW_AT_type        : <0x34>	
    <732>   DW_AT_sibling     : <0x73d>	
 <2><736>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <737>   DW_AT_type        : <0x65>	
    <73b>   DW_AT_upper_bound : 23	
 <2><73c>: Abbrev Number: 0
 <1><73d>: Abbrev Number: 29 (DW_TAG_variable)
    <73e>   DW_AT_name        : (indirect string, offset: 0x68): DegenCount	
    <742>   DW_AT_decl_file   : 5	
    <743>   DW_AT_decl_line   : 62	
    <744>   DW_AT_type        : <0x72d>	
    <748>   DW_AT_external    : 1	
    <748>   DW_AT_declaration : 1	
 <1><748>: Abbrev Number: 0
  Compilation Unit @ offset 0x749:
   Length:        0x1aa7 (32-bit)
   Version:       4
   Abbrev Offset: 0x1c9
   Pointer Size:  8
 <0><754>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <755>   DW_AT_producer    : (indirect string, offset: 0x197): GNU C 4.8.1 -mtune=generic -march=x86-64 -g -fno-strict-aliasing -fstack-protector	
    <759>   DW_AT_language    : 1	(ANSI C)
    <75a>   DW_AT_name        : (indirect string, offset: 0x5b3): core_algorithms.c	
    <75e>   DW_AT_comp_dir    : (indirect string, offset: 0xc9): /home/yunqi/SPEC2006/benchspec/CPU2006/456.hmmer/build/build_base_amd64-m64-gcc43-nn.0000	
    <762>   DW_AT_low_pc      : 0x402139	
    <76a>   DW_AT_high_pc     : 0xafa7	
    <772>   DW_AT_stmt_list   : 0x258	
 <1><776>: Abbrev Number: 2 (DW_TAG_base_type)
    <777>   DW_AT_byte_size   : 8	
    <778>   DW_AT_encoding    : 7	(unsigned)
    <779>   DW_AT_name        : (indirect string, offset: 0x1f8): long unsigned int	
 <1><77d>: Abbrev Number: 2 (DW_TAG_base_type)
    <77e>   DW_AT_byte_size   : 1	
    <77f>   DW_AT_encoding    : 8	(unsigned char)
    <780>   DW_AT_name        : (indirect string, offset: 0x17a): unsigned char	
 <1><784>: Abbrev Number: 2 (DW_TAG_base_type)
    <785>   DW_AT_byte_size   : 2	
    <786>   DW_AT_encoding    : 7	(unsigned)
    <787>   DW_AT_name        : (indirect string, offset: 0x229): short unsigned int	
 <1><78b>: Abbrev Number: 2 (DW_TAG_base_type)
    <78c>   DW_AT_byte_size   : 4	
    <78d>   DW_AT_encoding    : 7	(unsigned)
    <78e>   DW_AT_name        : (indirect string, offset: 0x1fd): unsigned int	
 <1><792>: Abbrev Number: 2 (DW_TAG_base_type)
    <793>   DW_AT_byte_size   : 1	
    <794>   DW_AT_encoding    : 6	(signed char)
    <795>   DW_AT_name        : (indirect string, offset: 0x17c): signed char	
 <1><799>: Abbrev Number: 2 (DW_TAG_base_type)
    <79a>   DW_AT_byte_size   : 2	
    <79b>   DW_AT_encoding    : 5	(signed)
    <79c>   DW_AT_name        : (indirect string, offset: 0x4a): short int	
 <1><7a0>: Abbrev Number: 3 (DW_TAG_base_type)
    <7a1>   DW_AT_byte_size   : 4	
    <7a2>   DW_AT_encoding    : 5	(signed)
    <7a3>   DW_AT_name        : int	
 <1><7a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <7a8>   DW_AT_byte_size   : 8	
    <7a9>   DW_AT_encoding    : 5	(signed)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x128): long int	
 <1><7ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <7af>   DW_AT_byte_size   : 8	
    <7b0>   DW_AT_encoding    : 7	(unsigned)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x54): sizetype	
 <1><7b5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7b6>   DW_AT_byte_size   : 8	
 <1><7b7>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7b8>   DW_AT_byte_size   : 8	
    <7b9>   DW_AT_type        : <0x7bd>	
 <1><7bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <7be>   DW_AT_byte_size   : 1	
    <7bf>   DW_AT_encoding    : 6	(signed char)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x183): char	
 <1><7c4>: Abbrev Number: 2 (DW_TAG_base_type)
    <7c5>   DW_AT_byte_size   : 4	
    <7c6>   DW_AT_encoding    : 4	(float)
    <7c7>   DW_AT_name        : (indirect string, offset: 0x0): float	
 <1><7cb>: Abbrev Number: 2 (DW_TAG_base_type)
    <7cc>   DW_AT_byte_size   : 8	
    <7cd>   DW_AT_encoding    : 4	(float)
    <7ce>   DW_AT_name        : (indirect string, offset: 0x2db): double	
 <1><7d2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7d3>   DW_AT_byte_size   : 8	
    <7d4>   DW_AT_type        : <0x7a0>	
 <1><7d8>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d9>   DW_AT_byte_size   : 8	
    <7da>   DW_AT_encoding    : 5	(signed)
    <7db>   DW_AT_name        : (indirect string, offset: 0x123): long long int	
 <1><7df>: Abbrev Number: 2 (DW_TAG_base_type)
    <7e0>   DW_AT_byte_size   : 8	
    <7e1>   DW_AT_encoding    : 7	(unsigned)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x1f3): long long unsigned int	
 <1><7e6>: Abbrev Number: 6 (DW_TAG_structure_type)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x293): gki_elem	
    <7eb>   DW_AT_byte_size   : 24	
    <7ec>   DW_AT_decl_file   : 2	
    <7ed>   DW_AT_decl_line   : 26	
    <7ee>   DW_AT_sibling     : <0x817>	
 <2><7f2>: Abbrev Number: 7 (DW_TAG_member)
    <7f3>   DW_AT_name        : key	
    <7f7>   DW_AT_decl_file   : 2	
    <7f8>   DW_AT_decl_line   : 27	
    <7f9>   DW_AT_type        : <0x7b7>	
    <7fd>   DW_AT_data_member_location: 0	
 <2><7fe>: Abbrev Number: 7 (DW_TAG_member)
    <7ff>   DW_AT_name        : idx	
    <803>   DW_AT_decl_file   : 2	
    <804>   DW_AT_decl_line   : 28	
    <805>   DW_AT_type        : <0x7a0>	
    <809>   DW_AT_data_member_location: 8	
 <2><80a>: Abbrev Number: 7 (DW_TAG_member)
    <80b>   DW_AT_name        : nxt	
    <80f>   DW_AT_decl_file   : 2	
    <810>   DW_AT_decl_line   : 29	
    <811>   DW_AT_type        : <0x817>	
    <815>   DW_AT_data_member_location: 16	
 <2><816>: Abbrev Number: 0
 <1><817>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <818>   DW_AT_byte_size   : 8	
    <819>   DW_AT_type        : <0x7e6>	
 <1><81d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <81e>   DW_AT_byte_size   : 24	
    <81f>   DW_AT_decl_file   : 2	
    <820>   DW_AT_decl_line   : 36	
    <821>   DW_AT_sibling     : <0x856>	
 <2><825>: Abbrev Number: 9 (DW_TAG_member)
    <826>   DW_AT_name        : (indirect string, offset: 0x2d5): table	
    <82a>   DW_AT_decl_file   : 2	
    <82b>   DW_AT_decl_line   : 37	
    <82c>   DW_AT_type        : <0x856>	
    <830>   DW_AT_data_member_location: 0	
 <2><831>: Abbrev Number: 9 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x23c): primelevel	
    <836>   DW_AT_decl_file   : 2	
    <837>   DW_AT_decl_line   : 39	
    <838>   DW_AT_type        : <0x7a0>	
    <83c>   DW_AT_data_member_location: 8	
 <2><83d>: Abbrev Number: 9 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x16d): nhash	
    <842>   DW_AT_decl_file   : 2	
    <843>   DW_AT_decl_line   : 40	
    <844>   DW_AT_type        : <0x7a0>	
    <848>   DW_AT_data_member_location: 12	
 <2><849>: Abbrev Number: 9 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x2275): nkeys	
    <84e>   DW_AT_decl_file   : 2	
    <84f>   DW_AT_decl_line   : 41	
    <850>   DW_AT_type        : <0x7a0>	
    <854>   DW_AT_data_member_location: 16	
 <2><855>: Abbrev Number: 0
 <1><856>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <857>   DW_AT_byte_size   : 8	
    <858>   DW_AT_type        : <0x817>	
 <1><85c>: Abbrev Number: 10 (DW_TAG_typedef)
    <85d>   DW_AT_name        : GKI	
    <861>   DW_AT_decl_file   : 2	
    <862>   DW_AT_decl_line   : 42	
    <863>   DW_AT_type        : <0x81d>	
 <1><867>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <868>   DW_AT_byte_size   : 8	
    <869>   DW_AT_type        : <0x7b7>	
 <1><86d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <86e>   DW_AT_byte_size   : 8	
    <86f>   DW_AT_type        : <0x7c4>	
 <1><873>: Abbrev Number: 11 (DW_TAG_structure_type)
    <874>   DW_AT_name        : (indirect string, offset: 0x2a5): msa_struct	
    <878>   DW_AT_byte_size   : 360	
    <87a>   DW_AT_decl_file   : 3	
    <87b>   DW_AT_decl_line   : 112	
    <87c>   DW_AT_sibling     : <0xaaf>	
 <2><880>: Abbrev Number: 9 (DW_TAG_member)
    <881>   DW_AT_name        : (indirect string, offset: 0x2844): aseq	
    <885>   DW_AT_decl_file   : 3	
    <886>   DW_AT_decl_line   : 115	
    <887>   DW_AT_type        : <0x867>	
    <88b>   DW_AT_data_member_location: 0	
 <2><88c>: Abbrev Number: 9 (DW_TAG_member)
    <88d>   DW_AT_name        : (indirect string, offset: 0x2855): sqname	
    <891>   DW_AT_decl_file   : 3	
    <892>   DW_AT_decl_line   : 116	
    <893>   DW_AT_type        : <0x867>	
    <897>   DW_AT_data_member_location: 8	
 <2><898>: Abbrev Number: 7 (DW_TAG_member)
    <899>   DW_AT_name        : wgt	
    <89d>   DW_AT_decl_file   : 3	
    <89e>   DW_AT_decl_line   : 117	
    <89f>   DW_AT_type        : <0x86d>	
    <8a3>   DW_AT_data_member_location: 16	
 <2><8a4>: Abbrev Number: 9 (DW_TAG_member)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x2871): alen	
    <8a9>   DW_AT_decl_file   : 3	
    <8aa>   DW_AT_decl_line   : 118	
    <8ab>   DW_AT_type        : <0x7a0>	
    <8af>   DW_AT_data_member_location: 24	
 <2><8b0>: Abbrev Number: 9 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x12d5): nseq	
    <8b5>   DW_AT_decl_file   : 3	
    <8b6>   DW_AT_decl_line   : 119	
    <8b7>   DW_AT_type        : <0x7a0>	
    <8bb>   DW_AT_data_member_location: 28	
 <2><8bc>: Abbrev Number: 9 (DW_TAG_member)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x32bd): flags	
    <8c1>   DW_AT_decl_file   : 3	
    <8c2>   DW_AT_decl_line   : 123	
    <8c3>   DW_AT_type        : <0x7a0>	
    <8c7>   DW_AT_data_member_location: 32	
 <2><8c8>: Abbrev Number: 9 (DW_TAG_member)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x2864): type	
    <8cd>   DW_AT_decl_file   : 3	
    <8ce>   DW_AT_decl_line   : 124	
    <8cf>   DW_AT_type        : <0x7a0>	
    <8d3>   DW_AT_data_member_location: 36	
 <2><8d4>: Abbrev Number: 9 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0x19c0): name	
    <8d9>   DW_AT_decl_file   : 3	
    <8da>   DW_AT_decl_line   : 125	
    <8db>   DW_AT_type        : <0x7b7>	
    <8df>   DW_AT_data_member_location: 40	
 <2><8e0>: Abbrev Number: 9 (DW_TAG_member)
    <8e1>   DW_AT_name        : (indirect string, offset: 0x1a62): desc	
    <8e5>   DW_AT_decl_file   : 3	
    <8e6>   DW_AT_decl_line   : 126	
    <8e7>   DW_AT_type        : <0x7b7>	
    <8eb>   DW_AT_data_member_location: 48	
 <2><8ec>: Abbrev Number: 7 (DW_TAG_member)
    <8ed>   DW_AT_name        : acc	
    <8f1>   DW_AT_decl_file   : 3	
    <8f2>   DW_AT_decl_line   : 127	
    <8f3>   DW_AT_type        : <0x7b7>	
    <8f7>   DW_AT_data_member_location: 56	
 <2><8f8>: Abbrev Number: 7 (DW_TAG_member)
    <8f9>   DW_AT_name        : au	
    <8fc>   DW_AT_decl_file   : 3	
    <8fd>   DW_AT_decl_line   : 128	
    <8fe>   DW_AT_type        : <0x7b7>	
    <902>   DW_AT_data_member_location: 64	
 <2><903>: Abbrev Number: 9 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x260): ss_cons	
    <908>   DW_AT_decl_file   : 3	
    <909>   DW_AT_decl_line   : 129	
    <90a>   DW_AT_type        : <0x7b7>	
    <90e>   DW_AT_data_member_location: 72	
 <2><90f>: Abbrev Number: 9 (DW_TAG_member)
    <910>   DW_AT_name        : (indirect string, offset: 0x86): sa_cons	
    <914>   DW_AT_decl_file   : 3	
    <915>   DW_AT_decl_line   : 130	
    <916>   DW_AT_type        : <0x7b7>	
    <91a>   DW_AT_data_member_location: 80	
 <2><91b>: Abbrev Number: 7 (DW_TAG_member)
    <91c>   DW_AT_name        : rf	
    <91f>   DW_AT_decl_file   : 3	
    <920>   DW_AT_decl_line   : 131	
    <921>   DW_AT_type        : <0x7b7>	
    <925>   DW_AT_data_member_location: 88	
 <2><926>: Abbrev Number: 9 (DW_TAG_member)
    <927>   DW_AT_name        : (indirect string, offset: 0x27f): sqacc	
    <92b>   DW_AT_decl_file   : 3	
    <92c>   DW_AT_decl_line   : 132	
    <92d>   DW_AT_type        : <0x867>	
    <931>   DW_AT_data_member_location: 96	
 <2><932>: Abbrev Number: 9 (DW_TAG_member)
    <933>   DW_AT_name        : (indirect string, offset: 0x173): sqdesc	
    <937>   DW_AT_decl_file   : 3	
    <938>   DW_AT_decl_line   : 133	
    <939>   DW_AT_type        : <0x867>	
    <93d>   DW_AT_data_member_location: 104	
 <2><93e>: Abbrev Number: 7 (DW_TAG_member)
    <93f>   DW_AT_name        : ss	
    <942>   DW_AT_decl_file   : 3	
    <943>   DW_AT_decl_line   : 134	
    <944>   DW_AT_type        : <0x867>	
    <948>   DW_AT_data_member_location: 112	
 <2><949>: Abbrev Number: 7 (DW_TAG_member)
    <94a>   DW_AT_name        : sa	
    <94d>   DW_AT_decl_file   : 3	
    <94e>   DW_AT_decl_line   : 135	
    <94f>   DW_AT_type        : <0x867>	
    <953>   DW_AT_data_member_location: 120	
 <2><954>: Abbrev Number: 9 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0x6): cutoff	
    <959>   DW_AT_decl_file   : 3	
    <95a>   DW_AT_decl_line   : 136	
    <95b>   DW_AT_type        : <0xaaf>	
    <95f>   DW_AT_data_member_location: 128	
 <2><960>: Abbrev Number: 9 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0xd): cutoff_is_set	
    <965>   DW_AT_decl_file   : 3	
    <966>   DW_AT_decl_line   : 137	
    <967>   DW_AT_type        : <0xabf>	
    <96b>   DW_AT_data_member_location: 152	
 <2><96c>: Abbrev Number: 9 (DW_TAG_member)
    <96d>   DW_AT_name        : (indirect string, offset: 0x3543): comment	
    <971>   DW_AT_decl_file   : 3	
    <972>   DW_AT_decl_line   : 144	
    <973>   DW_AT_type        : <0x867>	
    <977>   DW_AT_data_member_location: 176	
 <2><978>: Abbrev Number: 9 (DW_TAG_member)
    <979>   DW_AT_name        : (indirect string, offset: 0x18e): ncomment	
    <97d>   DW_AT_decl_file   : 3	
    <97e>   DW_AT_decl_line   : 145	
    <97f>   DW_AT_type        : <0x7a0>	
    <983>   DW_AT_data_member_location: 184	
 <2><984>: Abbrev Number: 9 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0x188): alloc_ncomment	
    <989>   DW_AT_decl_file   : 3	
    <98a>   DW_AT_decl_line   : 146	
    <98b>   DW_AT_type        : <0x7a0>	
    <98f>   DW_AT_data_member_location: 188	
 <2><990>: Abbrev Number: 9 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0x2ce): gf_tag	
    <995>   DW_AT_decl_file   : 3	
    <996>   DW_AT_decl_line   : 148	
    <997>   DW_AT_type        : <0x867>	
    <99b>   DW_AT_data_member_location: 192	
 <2><99c>: Abbrev Number: 7 (DW_TAG_member)
    <99d>   DW_AT_name        : gf	
    <9a0>   DW_AT_decl_file   : 3	
    <9a1>   DW_AT_decl_line   : 149	
    <9a2>   DW_AT_type        : <0x867>	
    <9a6>   DW_AT_data_member_location: 200	
 <2><9a7>: Abbrev Number: 7 (DW_TAG_member)
    <9a8>   DW_AT_name        : ngf	
    <9ac>   DW_AT_decl_file   : 3	
    <9ad>   DW_AT_decl_line   : 150	
    <9ae>   DW_AT_type        : <0x7a0>	
    <9b2>   DW_AT_data_member_location: 208	
 <2><9b3>: Abbrev Number: 9 (DW_TAG_member)
    <9b4>   DW_AT_name        : (indirect string, offset: 0x39): alloc_ngf	
    <9b8>   DW_AT_decl_file   : 3	
    <9b9>   DW_AT_decl_line   : 151	
    <9ba>   DW_AT_type        : <0x7a0>	
    <9be>   DW_AT_data_member_location: 212	
 <2><9bf>: Abbrev Number: 9 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x166): gs_tag	
    <9c4>   DW_AT_decl_file   : 3	
    <9c5>   DW_AT_decl_line   : 153	
    <9c6>   DW_AT_type        : <0x867>	
    <9ca>   DW_AT_data_member_location: 216	
 <2><9cb>: Abbrev Number: 7 (DW_TAG_member)
    <9cc>   DW_AT_name        : gs	
    <9cf>   DW_AT_decl_file   : 3	
    <9d0>   DW_AT_decl_line   : 154	
    <9d1>   DW_AT_type        : <0xacf>	
    <9d5>   DW_AT_data_member_location: 224	
 <2><9d6>: Abbrev Number: 9 (DW_TAG_member)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x211): gs_idx	
    <9db>   DW_AT_decl_file   : 3	
    <9dc>   DW_AT_decl_line   : 155	
    <9dd>   DW_AT_type        : <0xad5>	
    <9e1>   DW_AT_data_member_location: 232	
 <2><9e2>: Abbrev Number: 7 (DW_TAG_member)
    <9e3>   DW_AT_name        : ngs	
    <9e7>   DW_AT_decl_file   : 3	
    <9e8>   DW_AT_decl_line   : 156	
    <9e9>   DW_AT_type        : <0x7a0>	
    <9ed>   DW_AT_data_member_location: 240	
 <2><9ee>: Abbrev Number: 9 (DW_TAG_member)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x2bf): gc_tag	
    <9f3>   DW_AT_decl_file   : 3	
    <9f4>   DW_AT_decl_line   : 158	
    <9f5>   DW_AT_type        : <0x867>	
    <9f9>   DW_AT_data_member_location: 248	
 <2><9fa>: Abbrev Number: 12 (DW_TAG_member)
    <9fb>   DW_AT_name        : gc	
    <9fe>   DW_AT_decl_file   : 3	
    <9ff>   DW_AT_decl_line   : 159	
    <a00>   DW_AT_type        : <0x867>	
    <a04>   DW_AT_data_member_location: 256	
 <2><a06>: Abbrev Number: 13 (DW_TAG_member)
    <a07>   DW_AT_name        : (indirect string, offset: 0x2fd): gc_idx	
    <a0b>   DW_AT_decl_file   : 3	
    <a0c>   DW_AT_decl_line   : 160	
    <a0d>   DW_AT_type        : <0xad5>	
    <a11>   DW_AT_data_member_location: 264	
 <2><a13>: Abbrev Number: 12 (DW_TAG_member)
    <a14>   DW_AT_name        : ngc	
    <a18>   DW_AT_decl_file   : 3	
    <a19>   DW_AT_decl_line   : 161	
    <a1a>   DW_AT_type        : <0x7a0>	
    <a1e>   DW_AT_data_member_location: 272	
 <2><a20>: Abbrev Number: 13 (DW_TAG_member)
    <a21>   DW_AT_name        : (indirect string, offset: 0x43): gr_tag	
    <a25>   DW_AT_decl_file   : 3	
    <a26>   DW_AT_decl_line   : 163	
    <a27>   DW_AT_type        : <0x867>	
    <a2b>   DW_AT_data_member_location: 280	
 <2><a2d>: Abbrev Number: 12 (DW_TAG_member)
    <a2e>   DW_AT_name        : gr	
    <a31>   DW_AT_decl_file   : 3	
    <a32>   DW_AT_decl_line   : 164	
    <a33>   DW_AT_type        : <0xacf>	
    <a37>   DW_AT_data_member_location: 288	
 <2><a39>: Abbrev Number: 13 (DW_TAG_member)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x9a): gr_idx	
    <a3e>   DW_AT_decl_file   : 3	
    <a3f>   DW_AT_decl_line   : 165	
    <a40>   DW_AT_type        : <0xad5>	
    <a44>   DW_AT_data_member_location: 296	
 <2><a46>: Abbrev Number: 12 (DW_TAG_member)
    <a47>   DW_AT_name        : ngr	
    <a4b>   DW_AT_decl_file   : 3	
    <a4c>   DW_AT_decl_line   : 166	
    <a4d>   DW_AT_type        : <0x7a0>	
    <a51>   DW_AT_data_member_location: 304	
 <2><a53>: Abbrev Number: 13 (DW_TAG_member)
    <a54>   DW_AT_name        : (indirect string, offset: 0x2607): index	
    <a58>   DW_AT_decl_file   : 3	
    <a59>   DW_AT_decl_line   : 170	
    <a5a>   DW_AT_type        : <0xad5>	
    <a5e>   DW_AT_data_member_location: 312	
 <2><a60>: Abbrev Number: 13 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0x247): nseqalloc	
    <a65>   DW_AT_decl_file   : 3	
    <a66>   DW_AT_decl_line   : 171	
    <a67>   DW_AT_type        : <0x7a0>	
    <a6b>   DW_AT_data_member_location: 320	
 <2><a6d>: Abbrev Number: 13 (DW_TAG_member)
    <a6e>   DW_AT_name        : (indirect string, offset: 0x29c): nseqlump	
    <a72>   DW_AT_decl_file   : 3	
    <a73>   DW_AT_decl_line   : 172	
    <a74>   DW_AT_type        : <0x7a0>	
    <a78>   DW_AT_data_member_location: 324	
 <2><a7a>: Abbrev Number: 13 (DW_TAG_member)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x1a77): sqlen	
    <a7f>   DW_AT_decl_file   : 3	
    <a80>   DW_AT_decl_line   : 173	
    <a81>   DW_AT_type        : <0x7d2>	
    <a85>   DW_AT_data_member_location: 328	
 <2><a87>: Abbrev Number: 13 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0x139): sslen	
    <a8c>   DW_AT_decl_file   : 3	
    <a8d>   DW_AT_decl_line   : 174	
    <a8e>   DW_AT_type        : <0x7d2>	
    <a92>   DW_AT_data_member_location: 336	
 <2><a94>: Abbrev Number: 13 (DW_TAG_member)
    <a95>   DW_AT_name        : (indirect string, offset: 0x2e2): salen	
    <a99>   DW_AT_decl_file   : 3	
    <a9a>   DW_AT_decl_line   : 175	
    <a9b>   DW_AT_type        : <0x7d2>	
    <a9f>   DW_AT_data_member_location: 344	
 <2><aa1>: Abbrev Number: 13 (DW_TAG_member)
    <aa2>   DW_AT_name        : (indirect string, offset: 0x131): lastidx	
    <aa6>   DW_AT_decl_file   : 3	
    <aa7>   DW_AT_decl_line   : 176	
    <aa8>   DW_AT_type        : <0x7a0>	
    <aac>   DW_AT_data_member_location: 352	
 <2><aae>: Abbrev Number: 0
 <1><aaf>: Abbrev Number: 14 (DW_TAG_array_type)
    <ab0>   DW_AT_type        : <0x7c4>	
    <ab4>   DW_AT_sibling     : <0xabf>	
 <2><ab8>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ab9>   DW_AT_type        : <0x7ae>	
    <abd>   DW_AT_upper_bound : 5	
 <2><abe>: Abbrev Number: 0
 <1><abf>: Abbrev Number: 14 (DW_TAG_array_type)
    <ac0>   DW_AT_type        : <0x7a0>	
    <ac4>   DW_AT_sibling     : <0xacf>	
 <2><ac8>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ac9>   DW_AT_type        : <0x7ae>	
    <acd>   DW_AT_upper_bound : 5	
 <2><ace>: Abbrev Number: 0
 <1><acf>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ad0>   DW_AT_byte_size   : 8	
    <ad1>   DW_AT_type        : <0x867>	
 <1><ad5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ad6>   DW_AT_byte_size   : 8	
    <ad7>   DW_AT_type        : <0x85c>	
 <1><adb>: Abbrev Number: 10 (DW_TAG_typedef)
    <adc>   DW_AT_name        : MSA	
    <ae0>   DW_AT_decl_file   : 3	
    <ae1>   DW_AT_decl_line   : 177	
    <ae2>   DW_AT_type        : <0x873>	
 <1><ae6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ae7>   DW_AT_byte_size   : 8	
    <ae8>   DW_AT_type        : <0xadb>	
 <1><aec>: Abbrev Number: 11 (DW_TAG_structure_type)
    <aed>   DW_AT_name        : (indirect string, offset: 0x641): plan7_s	
    <af1>   DW_AT_byte_size   : 464	
    <af3>   DW_AT_decl_file   : 4	
    <af4>   DW_AT_decl_line   : 101	
    <af5>   DW_AT_sibling     : <0xd43>	
 <2><af9>: Abbrev Number: 9 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x19c0): name	
    <afe>   DW_AT_decl_file   : 4	
    <aff>   DW_AT_decl_line   : 113	
    <b00>   DW_AT_type        : <0x7b7>	
    <b04>   DW_AT_data_member_location: 0	
 <2><b05>: Abbrev Number: 7 (DW_TAG_member)
    <b06>   DW_AT_name        : acc	
    <b0a>   DW_AT_decl_file   : 4	
    <b0b>   DW_AT_decl_line   : 114	
    <b0c>   DW_AT_type        : <0x7b7>	
    <b10>   DW_AT_data_member_location: 8	
 <2><b11>: Abbrev Number: 9 (DW_TAG_member)
    <b12>   DW_AT_name        : (indirect string, offset: 0x1a62): desc	
    <b16>   DW_AT_decl_file   : 4	
    <b17>   DW_AT_decl_line   : 115	
    <b18>   DW_AT_type        : <0x7b7>	
    <b1c>   DW_AT_data_member_location: 16	
 <2><b1d>: Abbrev Number: 7 (DW_TAG_member)
    <b1e>   DW_AT_name        : rf	
    <b21>   DW_AT_decl_file   : 4	
    <b22>   DW_AT_decl_line   : 116	
    <b23>   DW_AT_type        : <0x7b7>	
    <b27>   DW_AT_data_member_location: 24	
 <2><b28>: Abbrev Number: 7 (DW_TAG_member)
    <b29>   DW_AT_name        : cs	
    <b2c>   DW_AT_decl_file   : 4	
    <b2d>   DW_AT_decl_line   : 117	
    <b2e>   DW_AT_type        : <0x7b7>	
    <b32>   DW_AT_data_member_location: 32	
 <2><b33>: Abbrev Number: 7 (DW_TAG_member)
    <b34>   DW_AT_name        : ca	
    <b37>   DW_AT_decl_file   : 4	
    <b38>   DW_AT_decl_line   : 118	
    <b39>   DW_AT_type        : <0x7b7>	
    <b3d>   DW_AT_data_member_location: 40	
 <2><b3e>: Abbrev Number: 9 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x68d): comlog	
    <b43>   DW_AT_decl_file   : 4	
    <b44>   DW_AT_decl_line   : 119	
    <b45>   DW_AT_type        : <0x7b7>	
    <b49>   DW_AT_data_member_location: 48	
 <2><b4a>: Abbrev Number: 9 (DW_TAG_member)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x12d5): nseq	
    <b4f>   DW_AT_decl_file   : 4	
    <b50>   DW_AT_decl_line   : 120	
    <b51>   DW_AT_type        : <0x7a0>	
    <b55>   DW_AT_data_member_location: 56	
 <2><b56>: Abbrev Number: 9 (DW_TAG_member)
    <b57>   DW_AT_name        : (indirect string, offset: 0x541): ctime	
    <b5b>   DW_AT_decl_file   : 4	
    <b5c>   DW_AT_decl_line   : 121	
    <b5d>   DW_AT_type        : <0x7b7>	
    <b61>   DW_AT_data_member_location: 64	
 <2><b62>: Abbrev Number: 7 (DW_TAG_member)
    <b63>   DW_AT_name        : map	
    <b67>   DW_AT_decl_file   : 4	
    <b68>   DW_AT_decl_line   : 122	
    <b69>   DW_AT_type        : <0x7d2>	
    <b6d>   DW_AT_data_member_location: 72	
 <2><b6e>: Abbrev Number: 9 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x2d5c): checksum	
    <b73>   DW_AT_decl_file   : 4	
    <b74>   DW_AT_decl_line   : 123	
    <b75>   DW_AT_type        : <0x7a0>	
    <b79>   DW_AT_data_member_location: 80	
 <2><b7a>: Abbrev Number: 9 (DW_TAG_member)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x423): tpri	
    <b7f>   DW_AT_decl_file   : 4	
    <b80>   DW_AT_decl_line   : 134	
    <b81>   DW_AT_type        : <0x7d2>	
    <b85>   DW_AT_data_member_location: 88	
 <2><b86>: Abbrev Number: 9 (DW_TAG_member)
    <b87>   DW_AT_name        : (indirect string, offset: 0x4b0): mpri	
    <b8b>   DW_AT_decl_file   : 4	
    <b8c>   DW_AT_decl_line   : 135	
    <b8d>   DW_AT_type        : <0x7d2>	
    <b91>   DW_AT_data_member_location: 96	
 <2><b92>: Abbrev Number: 9 (DW_TAG_member)
    <b93>   DW_AT_name        : (indirect string, offset: 0x4a4): ipri	
    <b97>   DW_AT_decl_file   : 4	
    <b98>   DW_AT_decl_line   : 136	
    <b99>   DW_AT_type        : <0x7d2>	
    <b9d>   DW_AT_data_member_location: 104	
 <2><b9e>: Abbrev Number: 7 (DW_TAG_member)
    <b9f>   DW_AT_name        : ga1	
    <ba3>   DW_AT_decl_file   : 4	
    <ba4>   DW_AT_decl_line   : 144	
    <ba5>   DW_AT_type        : <0x7c4>	
    <ba9>   DW_AT_data_member_location: 112	
 <2><baa>: Abbrev Number: 7 (DW_TAG_member)
    <bab>   DW_AT_name        : ga2	
    <baf>   DW_AT_decl_file   : 4	
    <bb0>   DW_AT_decl_line   : 144	
    <bb1>   DW_AT_type        : <0x7c4>	
    <bb5>   DW_AT_data_member_location: 116	
 <2><bb6>: Abbrev Number: 7 (DW_TAG_member)
    <bb7>   DW_AT_name        : tc1	
    <bbb>   DW_AT_decl_file   : 4	
    <bbc>   DW_AT_decl_line   : 145	
    <bbd>   DW_AT_type        : <0x7c4>	
    <bc1>   DW_AT_data_member_location: 120	
 <2><bc2>: Abbrev Number: 7 (DW_TAG_member)
    <bc3>   DW_AT_name        : tc2	
    <bc7>   DW_AT_decl_file   : 4	
    <bc8>   DW_AT_decl_line   : 145	
    <bc9>   DW_AT_type        : <0x7c4>	
    <bcd>   DW_AT_data_member_location: 124	
 <2><bce>: Abbrev Number: 7 (DW_TAG_member)
    <bcf>   DW_AT_name        : nc1	
    <bd3>   DW_AT_decl_file   : 4	
    <bd4>   DW_AT_decl_line   : 146	
    <bd5>   DW_AT_type        : <0x7c4>	
    <bd9>   DW_AT_data_member_location: 128	
 <2><bda>: Abbrev Number: 7 (DW_TAG_member)
    <bdb>   DW_AT_name        : nc2	
    <bdf>   DW_AT_decl_file   : 4	
    <be0>   DW_AT_decl_line   : 146	
    <be1>   DW_AT_type        : <0x7c4>	
    <be5>   DW_AT_data_member_location: 132	
 <2><be6>: Abbrev Number: 7 (DW_TAG_member)
    <be7>   DW_AT_name        : M	
    <be9>   DW_AT_decl_file   : 4	
    <bea>   DW_AT_decl_line   : 155	
    <beb>   DW_AT_type        : <0x7a0>	
    <bef>   DW_AT_data_member_location: 136	
 <2><bf0>: Abbrev Number: 7 (DW_TAG_member)
    <bf1>   DW_AT_name        : t	
    <bf3>   DW_AT_decl_file   : 4	
    <bf4>   DW_AT_decl_line   : 156	
    <bf5>   DW_AT_type        : <0xd43>	
    <bf9>   DW_AT_data_member_location: 144	
 <2><bfa>: Abbrev Number: 7 (DW_TAG_member)
    <bfb>   DW_AT_name        : mat	
    <bff>   DW_AT_decl_file   : 4	
    <c00>   DW_AT_decl_line   : 157	
    <c01>   DW_AT_type        : <0xd43>	
    <c05>   DW_AT_data_member_location: 152	
 <2><c06>: Abbrev Number: 7 (DW_TAG_member)
    <c07>   DW_AT_name        : ins	
    <c0b>   DW_AT_decl_file   : 4	
    <c0c>   DW_AT_decl_line   : 158	
    <c0d>   DW_AT_type        : <0xd43>	
    <c11>   DW_AT_data_member_location: 160	
 <2><c12>: Abbrev Number: 9 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0x321): tbd1	
    <c17>   DW_AT_decl_file   : 4	
    <c18>   DW_AT_decl_line   : 159	
    <c19>   DW_AT_type        : <0x7c4>	
    <c1d>   DW_AT_data_member_location: 168	
 <2><c1e>: Abbrev Number: 7 (DW_TAG_member)
    <c1f>   DW_AT_name        : xt	
    <c22>   DW_AT_decl_file   : 4	
    <c23>   DW_AT_decl_line   : 168	
    <c24>   DW_AT_type        : <0xd49>	
    <c28>   DW_AT_data_member_location: 172	
 <2><c29>: Abbrev Number: 9 (DW_TAG_member)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x557): begin	
    <c2e>   DW_AT_decl_file   : 4	
    <c2f>   DW_AT_decl_line   : 169	
    <c30>   DW_AT_type        : <0x86d>	
    <c34>   DW_AT_data_member_location: 208	
 <2><c35>: Abbrev Number: 7 (DW_TAG_member)
    <c36>   DW_AT_name        : end	
    <c3a>   DW_AT_decl_file   : 4	
    <c3b>   DW_AT_decl_line   : 170	
    <c3c>   DW_AT_type        : <0x86d>	
    <c40>   DW_AT_data_member_location: 216	
 <2><c41>: Abbrev Number: 9 (DW_TAG_member)
    <c42>   DW_AT_name        : (indirect string, offset: 0x15bc): null	
    <c46>   DW_AT_decl_file   : 4	
    <c47>   DW_AT_decl_line   : 174	
    <c48>   DW_AT_type        : <0xd5f>	
    <c4c>   DW_AT_data_member_location: 224	
 <2><c4d>: Abbrev Number: 12 (DW_TAG_member)
    <c4e>   DW_AT_name        : p1	
    <c51>   DW_AT_decl_file   : 4	
    <c52>   DW_AT_decl_line   : 175	
    <c53>   DW_AT_type        : <0x7c4>	
    <c57>   DW_AT_data_member_location: 304	
 <2><c59>: Abbrev Number: 12 (DW_TAG_member)
    <c5a>   DW_AT_name        : tsc	
    <c5e>   DW_AT_decl_file   : 4	
    <c5f>   DW_AT_decl_line   : 197	
    <c60>   DW_AT_type        : <0xd6f>	
    <c64>   DW_AT_data_member_location: 312	
 <2><c66>: Abbrev Number: 12 (DW_TAG_member)
    <c67>   DW_AT_name        : msc	
    <c6b>   DW_AT_decl_file   : 4	
    <c6c>   DW_AT_decl_line   : 198	
    <c6d>   DW_AT_type        : <0xd6f>	
    <c71>   DW_AT_data_member_location: 320	
 <2><c73>: Abbrev Number: 12 (DW_TAG_member)
    <c74>   DW_AT_name        : isc	
    <c78>   DW_AT_decl_file   : 4	
    <c79>   DW_AT_decl_line   : 199	
    <c7a>   DW_AT_type        : <0xd6f>	
    <c7e>   DW_AT_data_member_location: 328	
 <2><c80>: Abbrev Number: 12 (DW_TAG_member)
    <c81>   DW_AT_name        : xsc	
    <c85>   DW_AT_decl_file   : 4	
    <c86>   DW_AT_decl_line   : 200	
    <c87>   DW_AT_type        : <0xd75>	
    <c8b>   DW_AT_data_member_location: 336	
 <2><c8d>: Abbrev Number: 12 (DW_TAG_member)
    <c8e>   DW_AT_name        : bsc	
    <c92>   DW_AT_decl_file   : 4	
    <c93>   DW_AT_decl_line   : 201	
    <c94>   DW_AT_type        : <0x7d2>	
    <c98>   DW_AT_data_member_location: 368	
 <2><c9a>: Abbrev Number: 12 (DW_TAG_member)
    <c9b>   DW_AT_name        : esc	
    <c9f>   DW_AT_decl_file   : 4	
    <ca0>   DW_AT_decl_line   : 202	
    <ca1>   DW_AT_type        : <0x7d2>	
    <ca5>   DW_AT_data_member_location: 376	
 <2><ca7>: Abbrev Number: 13 (DW_TAG_member)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x3e5): tsc_mem	
    <cac>   DW_AT_decl_file   : 4	
    <cad>   DW_AT_decl_line   : 203	
    <cae>   DW_AT_type        : <0x7d2>	
    <cb2>   DW_AT_data_member_location: 384	
 <2><cb4>: Abbrev Number: 13 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x639): msc_mem	
    <cb9>   DW_AT_decl_file   : 4	
    <cba>   DW_AT_decl_line   : 203	
    <cbb>   DW_AT_type        : <0x7d2>	
    <cbf>   DW_AT_data_member_location: 392	
 <2><cc1>: Abbrev Number: 13 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x57d): isc_mem	
    <cc6>   DW_AT_decl_file   : 4	
    <cc7>   DW_AT_decl_line   : 203	
    <cc8>   DW_AT_type        : <0x7d2>	
    <ccc>   DW_AT_data_member_location: 400	
 <2><cce>: Abbrev Number: 13 (DW_TAG_member)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x326): bsc_mem	
    <cd3>   DW_AT_decl_file   : 4	
    <cd4>   DW_AT_decl_line   : 203	
    <cd5>   DW_AT_type        : <0x7d2>	
    <cd9>   DW_AT_data_member_location: 408	
 <2><cdb>: Abbrev Number: 13 (DW_TAG_member)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x38b): esc_mem	
    <ce0>   DW_AT_decl_file   : 4	
    <ce1>   DW_AT_decl_line   : 203	
    <ce2>   DW_AT_type        : <0x7d2>	
    <ce6>   DW_AT_data_member_location: 416	
 <2><ce8>: Abbrev Number: 13 (DW_TAG_member)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x699): dnam	
    <ced>   DW_AT_decl_file   : 4	
    <cee>   DW_AT_decl_line   : 214	
    <cef>   DW_AT_type        : <0xd6f>	
    <cf3>   DW_AT_data_member_location: 424	
 <2><cf5>: Abbrev Number: 13 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x694): dnai	
    <cfa>   DW_AT_decl_file   : 4	
    <cfb>   DW_AT_decl_line   : 215	
    <cfc>   DW_AT_type        : <0xd6f>	
    <d00>   DW_AT_data_member_location: 432	
 <2><d02>: Abbrev Number: 13 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0x674): dna2	
    <d07>   DW_AT_decl_file   : 4	
    <d08>   DW_AT_decl_line   : 216	
    <d09>   DW_AT_type        : <0x7a0>	
    <d0d>   DW_AT_data_member_location: 440	
 <2><d0f>: Abbrev Number: 13 (DW_TAG_member)
    <d10>   DW_AT_name        : (indirect string, offset: 0x679): dna4	
    <d14>   DW_AT_decl_file   : 4	
    <d15>   DW_AT_decl_line   : 217	
    <d16>   DW_AT_type        : <0x7a0>	
    <d1a>   DW_AT_data_member_location: 444	
 <2><d1c>: Abbrev Number: 12 (DW_TAG_member)
    <d1d>   DW_AT_name        : mu	
    <d20>   DW_AT_decl_file   : 4	
    <d21>   DW_AT_decl_line   : 222	
    <d22>   DW_AT_type        : <0x7c4>	
    <d26>   DW_AT_data_member_location: 448	
 <2><d28>: Abbrev Number: 13 (DW_TAG_member)
    <d29>   DW_AT_name        : (indirect string, offset: 0xcc5): lambda	
    <d2d>   DW_AT_decl_file   : 4	
    <d2e>   DW_AT_decl_line   : 223	
    <d2f>   DW_AT_type        : <0x7c4>	
    <d33>   DW_AT_data_member_location: 452	
 <2><d35>: Abbrev Number: 13 (DW_TAG_member)
    <d36>   DW_AT_name        : (indirect string, offset: 0x32bd): flags	
    <d3a>   DW_AT_decl_file   : 4	
    <d3b>   DW_AT_decl_line   : 225	
    <d3c>   DW_AT_type        : <0x7a0>	
    <d40>   DW_AT_data_member_location: 456	
 <2><d42>: Abbrev Number: 0
 <1><d43>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d44>   DW_AT_byte_size   : 8	
    <d45>   DW_AT_type        : <0x86d>	
 <1><d49>: Abbrev Number: 14 (DW_TAG_array_type)
    <d4a>   DW_AT_type        : <0x7c4>	
    <d4e>   DW_AT_sibling     : <0xd5f>	
 <2><d52>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d53>   DW_AT_type        : <0x7ae>	
    <d57>   DW_AT_upper_bound : 3	
 <2><d58>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d59>   DW_AT_type        : <0x7ae>	
    <d5d>   DW_AT_upper_bound : 1	
 <2><d5e>: Abbrev Number: 0
 <1><d5f>: Abbrev Number: 14 (DW_TAG_array_type)
    <d60>   DW_AT_type        : <0x7c4>	
    <d64>   DW_AT_sibling     : <0xd6f>	
 <2><d68>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d69>   DW_AT_type        : <0x7ae>	
    <d6d>   DW_AT_upper_bound : 19	
 <2><d6e>: Abbrev Number: 0
 <1><d6f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d70>   DW_AT_byte_size   : 8	
    <d71>   DW_AT_type        : <0x7d2>	
 <1><d75>: Abbrev Number: 14 (DW_TAG_array_type)
    <d76>   DW_AT_type        : <0x7a0>	
    <d7a>   DW_AT_sibling     : <0xd8b>	
 <2><d7e>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d7f>   DW_AT_type        : <0x7ae>	
    <d83>   DW_AT_upper_bound : 3	
 <2><d84>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d85>   DW_AT_type        : <0x7ae>	
    <d89>   DW_AT_upper_bound : 1	
 <2><d8a>: Abbrev Number: 0
 <1><d8b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d8c>   DW_AT_name        : (indirect string, offset: 0x3da): dpmatrix_s	
    <d90>   DW_AT_byte_size   : 80	
    <d91>   DW_AT_decl_file   : 4	
    <d92>   DW_AT_decl_line   : 289	
    <d94>   DW_AT_sibling     : <0xe35>	
 <2><d98>: Abbrev Number: 17 (DW_TAG_member)
    <d99>   DW_AT_name        : xmx	
    <d9d>   DW_AT_decl_file   : 4	
    <d9e>   DW_AT_decl_line   : 290	
    <da0>   DW_AT_type        : <0xd6f>	
    <da4>   DW_AT_data_member_location: 0	
 <2><da5>: Abbrev Number: 17 (DW_TAG_member)
    <da6>   DW_AT_name        : mmx	
    <daa>   DW_AT_decl_file   : 4	
    <dab>   DW_AT_decl_line   : 291	
    <dad>   DW_AT_type        : <0xd6f>	
    <db1>   DW_AT_data_member_location: 8	
 <2><db2>: Abbrev Number: 17 (DW_TAG_member)
    <db3>   DW_AT_name        : imx	
    <db7>   DW_AT_decl_file   : 4	
    <db8>   DW_AT_decl_line   : 292	
    <dba>   DW_AT_type        : <0xd6f>	
    <dbe>   DW_AT_data_member_location: 16	
 <2><dbf>: Abbrev Number: 17 (DW_TAG_member)
    <dc0>   DW_AT_name        : dmx	
    <dc4>   DW_AT_decl_file   : 4	
    <dc5>   DW_AT_decl_line   : 293	
    <dc7>   DW_AT_type        : <0xd6f>	
    <dcb>   DW_AT_data_member_location: 24	
 <2><dcc>: Abbrev Number: 18 (DW_TAG_member)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x383): xmx_mem	
    <dd1>   DW_AT_decl_file   : 4	
    <dd2>   DW_AT_decl_line   : 299	
    <dd4>   DW_AT_type        : <0x7b5>	
    <dd8>   DW_AT_data_member_location: 32	
 <2><dd9>: Abbrev Number: 18 (DW_TAG_member)
    <dda>   DW_AT_name        : (indirect string, offset: 0x416): mmx_mem	
    <dde>   DW_AT_decl_file   : 4	
    <ddf>   DW_AT_decl_line   : 299	
    <de1>   DW_AT_type        : <0x7b5>	
    <de5>   DW_AT_data_member_location: 40	
 <2><de6>: Abbrev Number: 18 (DW_TAG_member)
    <de7>   DW_AT_name        : (indirect string, offset: 0x338): imx_mem	
    <deb>   DW_AT_decl_file   : 4	
    <dec>   DW_AT_decl_line   : 299	
    <dee>   DW_AT_type        : <0x7b5>	
    <df2>   DW_AT_data_member_location: 48	
 <2><df3>: Abbrev Number: 18 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0x513): dmx_mem	
    <df8>   DW_AT_decl_file   : 4	
    <df9>   DW_AT_decl_line   : 299	
    <dfb>   DW_AT_type        : <0x7b5>	
    <dff>   DW_AT_data_member_location: 56	
 <2><e00>: Abbrev Number: 18 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0x552): maxN	
    <e05>   DW_AT_decl_file   : 4	
    <e06>   DW_AT_decl_line   : 308	
    <e08>   DW_AT_type        : <0x7a0>	
    <e0c>   DW_AT_data_member_location: 64	
 <2><e0d>: Abbrev Number: 18 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x54d): maxM	
    <e12>   DW_AT_decl_file   : 4	
    <e13>   DW_AT_decl_line   : 309	
    <e15>   DW_AT_type        : <0x7a0>	
    <e19>   DW_AT_data_member_location: 68	
 <2><e1a>: Abbrev Number: 18 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x4e4): padN	
    <e1f>   DW_AT_decl_file   : 4	
    <e20>   DW_AT_decl_line   : 311	
    <e22>   DW_AT_type        : <0x7a0>	
    <e26>   DW_AT_data_member_location: 72	
 <2><e27>: Abbrev Number: 18 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0x4df): padM	
    <e2c>   DW_AT_decl_file   : 4	
    <e2d>   DW_AT_decl_line   : 312	
    <e2f>   DW_AT_type        : <0x7a0>	
    <e33>   DW_AT_data_member_location: 76	
 <2><e34>: Abbrev Number: 0
 <1><e35>: Abbrev Number: 16 (DW_TAG_structure_type)
    <e36>   DW_AT_name        : (indirect string, offset: 0x355): dpshadow_s	
    <e3a>   DW_AT_byte_size   : 40	
    <e3b>   DW_AT_decl_file   : 4	
    <e3c>   DW_AT_decl_line   : 320	
    <e3e>   DW_AT_sibling     : <0xe84>	
 <2><e42>: Abbrev Number: 17 (DW_TAG_member)
    <e43>   DW_AT_name        : xtb	
    <e47>   DW_AT_decl_file   : 4	
    <e48>   DW_AT_decl_line   : 321	
    <e4a>   DW_AT_type        : <0x867>	
    <e4e>   DW_AT_data_member_location: 0	
 <2><e4f>: Abbrev Number: 17 (DW_TAG_member)
    <e50>   DW_AT_name        : mtb	
    <e54>   DW_AT_decl_file   : 4	
    <e55>   DW_AT_decl_line   : 322	
    <e57>   DW_AT_type        : <0x867>	
    <e5b>   DW_AT_data_member_location: 8	
 <2><e5c>: Abbrev Number: 17 (DW_TAG_member)
    <e5d>   DW_AT_name        : itb	
    <e61>   DW_AT_decl_file   : 4	
    <e62>   DW_AT_decl_line   : 323	
    <e64>   DW_AT_type        : <0x867>	
    <e68>   DW_AT_data_member_location: 16	
 <2><e69>: Abbrev Number: 17 (DW_TAG_member)
    <e6a>   DW_AT_name        : dtb	
    <e6e>   DW_AT_decl_file   : 4	
    <e6f>   DW_AT_decl_line   : 324	
    <e71>   DW_AT_type        : <0x867>	
    <e75>   DW_AT_data_member_location: 24	
 <2><e76>: Abbrev Number: 18 (DW_TAG_member)
    <e77>   DW_AT_name        : (indirect string, offset: 0x333): esrc	
    <e7b>   DW_AT_decl_file   : 4	
    <e7c>   DW_AT_decl_line   : 325	
    <e7e>   DW_AT_type        : <0x7d2>	
    <e82>   DW_AT_data_member_location: 32	
 <2><e83>: Abbrev Number: 0
 <1><e84>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <e85>   DW_AT_byte_size   : 8	
    <e86>   DW_AT_type        : <0xaec>	
 <1><e8a>: Abbrev Number: 16 (DW_TAG_structure_type)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x5c5): p7trace_s	
    <e8f>   DW_AT_byte_size   : 32	
    <e90>   DW_AT_decl_file   : 4	
    <e91>   DW_AT_decl_line   : 374	
    <e93>   DW_AT_sibling     : <0xecc>	
 <2><e97>: Abbrev Number: 18 (DW_TAG_member)
    <e98>   DW_AT_name        : (indirect string, offset: 0x98e): tlen	
    <e9c>   DW_AT_decl_file   : 4	
    <e9d>   DW_AT_decl_line   : 375	
    <e9f>   DW_AT_type        : <0x7a0>	
    <ea3>   DW_AT_data_member_location: 0	
 <2><ea4>: Abbrev Number: 18 (DW_TAG_member)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x439): statetype	
    <ea9>   DW_AT_decl_file   : 4	
    <eaa>   DW_AT_decl_line   : 376	
    <eac>   DW_AT_type        : <0x7b7>	
    <eb0>   DW_AT_data_member_location: 8	
 <2><eb1>: Abbrev Number: 18 (DW_TAG_member)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x39a): nodeidx	
    <eb6>   DW_AT_decl_file   : 4	
    <eb7>   DW_AT_decl_line   : 377	
    <eb9>   DW_AT_type        : <0x7d2>	
    <ebd>   DW_AT_data_member_location: 16	
 <2><ebe>: Abbrev Number: 17 (DW_TAG_member)
    <ebf>   DW_AT_name        : pos	
    <ec3>   DW_AT_decl_file   : 4	
    <ec4>   DW_AT_decl_line   : 378	
    <ec6>   DW_AT_type        : <0x7d2>	
    <eca>   DW_AT_data_member_location: 24	
 <2><ecb>: Abbrev Number: 0
 <1><ecc>: Abbrev Number: 16 (DW_TAG_structure_type)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x36d): fancyali_s	
    <ed1>   DW_AT_byte_size   : 72	
    <ed2>   DW_AT_decl_file   : 4	
    <ed3>   DW_AT_decl_line   : 447	
    <ed5>   DW_AT_sibling     : <0xf5c>	
 <2><ed9>: Abbrev Number: 18 (DW_TAG_member)
    <eda>   DW_AT_name        : (indirect string, offset: 0x34e): rfline	
    <ede>   DW_AT_decl_file   : 4	
    <edf>   DW_AT_decl_line   : 448	
    <ee1>   DW_AT_type        : <0x7b7>	
    <ee5>   DW_AT_data_member_location: 0	
 <2><ee6>: Abbrev Number: 18 (DW_TAG_member)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x393): csline	
    <eeb>   DW_AT_decl_file   : 4	
    <eec>   DW_AT_decl_line   : 449	
    <eee>   DW_AT_type        : <0x7b7>	
    <ef2>   DW_AT_data_member_location: 8	
 <2><ef3>: Abbrev Number: 18 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x14b0): model	
    <ef8>   DW_AT_decl_file   : 4	
    <ef9>   DW_AT_decl_line   : 450	
    <efb>   DW_AT_type        : <0x7b7>	
    <eff>   DW_AT_data_member_location: 16	
 <2><f00>: Abbrev Number: 18 (DW_TAG_member)
    <f01>   DW_AT_name        : (indirect string, offset: 0x2ba0): mline	
    <f05>   DW_AT_decl_file   : 4	
    <f06>   DW_AT_decl_line   : 451	
    <f08>   DW_AT_type        : <0x7b7>	
    <f0c>   DW_AT_data_member_location: 24	
 <2><f0d>: Abbrev Number: 18 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0x2844): aseq	
    <f12>   DW_AT_decl_file   : 4	
    <f13>   DW_AT_decl_line   : 452	
    <f15>   DW_AT_type        : <0x7b7>	
    <f19>   DW_AT_data_member_location: 32	
 <2><f1a>: Abbrev Number: 17 (DW_TAG_member)
    <f1b>   DW_AT_name        : len	
    <f1f>   DW_AT_decl_file   : 4	
    <f20>   DW_AT_decl_line   : 453	
    <f22>   DW_AT_type        : <0x7a0>	
    <f26>   DW_AT_data_member_location: 40	
 <2><f27>: Abbrev Number: 18 (DW_TAG_member)
    <f28>   DW_AT_name        : (indirect string, offset: 0x547): query	
    <f2c>   DW_AT_decl_file   : 4	
    <f2d>   DW_AT_decl_line   : 454	
    <f2f>   DW_AT_type        : <0x7b7>	
    <f33>   DW_AT_data_member_location: 48	
 <2><f34>: Abbrev Number: 18 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0x48f): target	
    <f39>   DW_AT_decl_file   : 4	
    <f3a>   DW_AT_decl_line   : 455	
    <f3c>   DW_AT_type        : <0x7b7>	
    <f40>   DW_AT_data_member_location: 56	
 <2><f41>: Abbrev Number: 18 (DW_TAG_member)
    <f42>   DW_AT_name        : (indirect string, offset: 0x1a45): sqfrom	
    <f46>   DW_AT_decl_file   : 4	
    <f47>   DW_AT_decl_line   : 456	
    <f49>   DW_AT_type        : <0x7a0>	
    <f4d>   DW_AT_data_member_location: 64	
 <2><f4e>: Abbrev Number: 18 (DW_TAG_member)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x1a2e): sqto	
    <f53>   DW_AT_decl_file   : 4	
    <f54>   DW_AT_decl_line   : 457	
    <f56>   DW_AT_type        : <0x7a0>	
    <f5a>   DW_AT_data_member_location: 68	
 <2><f5b>: Abbrev Number: 0
 <1><f5c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x3ba): hit_s	
    <f61>   DW_AT_byte_size   : 104	
    <f62>   DW_AT_decl_file   : 4	
    <f63>   DW_AT_decl_line   : 470	
    <f65>   DW_AT_sibling     : <0x1047>	
 <2><f69>: Abbrev Number: 18 (DW_TAG_member)
    <f6a>   DW_AT_name        : (indirect string, offset: 0x3f8): sortkey	
    <f6e>   DW_AT_decl_file   : 4	
    <f6f>   DW_AT_decl_line   : 471	
    <f71>   DW_AT_type        : <0x7cb>	
    <f75>   DW_AT_data_member_location: 0	
 <2><f76>: Abbrev Number: 18 (DW_TAG_member)
    <f77>   DW_AT_name        : (indirect string, offset: 0x8ee): score	
    <f7b>   DW_AT_decl_file   : 4	
    <f7c>   DW_AT_decl_line   : 472	
    <f7e>   DW_AT_type        : <0x7c4>	
    <f82>   DW_AT_data_member_location: 8	
 <2><f83>: Abbrev Number: 18 (DW_TAG_member)
    <f84>   DW_AT_name        : (indirect string, offset: 0x19ff): pvalue	
    <f88>   DW_AT_decl_file   : 4	
    <f89>   DW_AT_decl_line   : 473	
    <f8b>   DW_AT_type        : <0x7cb>	
    <f8f>   DW_AT_data_member_location: 16	
 <2><f90>: Abbrev Number: 18 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0x1abb): mothersc	
    <f95>   DW_AT_decl_file   : 4	
    <f96>   DW_AT_decl_line   : 474	
    <f98>   DW_AT_type        : <0x7c4>	
    <f9c>   DW_AT_data_member_location: 24	
 <2><f9d>: Abbrev Number: 18 (DW_TAG_member)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x19a3): motherp	
    <fa2>   DW_AT_decl_file   : 4	
    <fa3>   DW_AT_decl_line   : 475	
    <fa5>   DW_AT_type        : <0x7cb>	
    <fa9>   DW_AT_data_member_location: 32	
 <2><faa>: Abbrev Number: 18 (DW_TAG_member)
    <fab>   DW_AT_name        : (indirect string, offset: 0x19c0): name	
    <faf>   DW_AT_decl_file   : 4	
    <fb0>   DW_AT_decl_line   : 476	
    <fb2>   DW_AT_type        : <0x7b7>	
    <fb6>   DW_AT_data_member_location: 40	
 <2><fb7>: Abbrev Number: 17 (DW_TAG_member)
    <fb8>   DW_AT_name        : acc	
    <fbc>   DW_AT_decl_file   : 4	
    <fbd>   DW_AT_decl_line   : 477	
    <fbf>   DW_AT_type        : <0x7b7>	
    <fc3>   DW_AT_data_member_location: 48	
 <2><fc4>: Abbrev Number: 18 (DW_TAG_member)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x1a62): desc	
    <fc9>   DW_AT_decl_file   : 4	
    <fca>   DW_AT_decl_line   : 478	
    <fcc>   DW_AT_type        : <0x7b7>	
    <fd0>   DW_AT_data_member_location: 56	
 <2><fd1>: Abbrev Number: 18 (DW_TAG_member)
    <fd2>   DW_AT_name        : (indirect string, offset: 0x1a45): sqfrom	
    <fd6>   DW_AT_decl_file   : 4	
    <fd7>   DW_AT_decl_line   : 479	
    <fd9>   DW_AT_type        : <0x7a0>	
    <fdd>   DW_AT_data_member_location: 64	
 <2><fde>: Abbrev Number: 18 (DW_TAG_member)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x1a2e): sqto	
    <fe3>   DW_AT_decl_file   : 4	
    <fe4>   DW_AT_decl_line   : 480	
    <fe6>   DW_AT_type        : <0x7a0>	
    <fea>   DW_AT_data_member_location: 68	
 <2><feb>: Abbrev Number: 18 (DW_TAG_member)
    <fec>   DW_AT_name        : (indirect string, offset: 0x1a77): sqlen	
    <ff0>   DW_AT_decl_file   : 4	
    <ff1>   DW_AT_decl_line   : 481	
    <ff3>   DW_AT_type        : <0x7a0>	
    <ff7>   DW_AT_data_member_location: 72	
 <2><ff8>: Abbrev Number: 18 (DW_TAG_member)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x19b6): hmmfrom	
    <ffd>   DW_AT_decl_file   : 4	
    <ffe>   DW_AT_decl_line   : 482	
    <1000>   DW_AT_type        : <0x7a0>	
    <1004>   DW_AT_data_member_location: 76	
 <2><1005>: Abbrev Number: 18 (DW_TAG_member)
    <1006>   DW_AT_name        : (indirect string, offset: 0x1a35): hmmto	
    <100a>   DW_AT_decl_file   : 4	
    <100b>   DW_AT_decl_line   : 483	
    <100d>   DW_AT_type        : <0x7a0>	
    <1011>   DW_AT_data_member_location: 80	
 <2><1012>: Abbrev Number: 18 (DW_TAG_member)
    <1013>   DW_AT_name        : (indirect string, offset: 0x19ad): hmmlen	
    <1017>   DW_AT_decl_file   : 4	
    <1018>   DW_AT_decl_line   : 484	
    <101a>   DW_AT_type        : <0x7a0>	
    <101e>   DW_AT_data_member_location: 84	
 <2><101f>: Abbrev Number: 18 (DW_TAG_member)
    <1020>   DW_AT_name        : (indirect string, offset: 0x1ac6): domidx	
    <1024>   DW_AT_decl_file   : 4	
    <1025>   DW_AT_decl_line   : 485	
    <1027>   DW_AT_type        : <0x7a0>	
    <102b>   DW_AT_data_member_location: 88	
 <2><102c>: Abbrev Number: 18 (DW_TAG_member)
    <102d>   DW_AT_name        : (indirect string, offset: 0x1a1f): ndom	
    <1031>   DW_AT_decl_file   : 4	
    <1032>   DW_AT_decl_line   : 486	
    <1034>   DW_AT_type        : <0x7a0>	
    <1038>   DW_AT_data_member_location: 92	
 <2><1039>: Abbrev Number: 17 (DW_TAG_member)
    <103a>   DW_AT_name        : ali	
    <103e>   DW_AT_decl_file   : 4	
    <103f>   DW_AT_decl_line   : 487	
    <1041>   DW_AT_type        : <0x1047>	
    <1045>   DW_AT_data_member_location: 96	
 <2><1046>: Abbrev Number: 0
 <1><1047>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1048>   DW_AT_byte_size   : 8	
    <1049>   DW_AT_type        : <0xecc>	
 <1><104d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <104e>   DW_AT_name        : (indirect string, offset: 0x3b7): tophit_s	
    <1052>   DW_AT_byte_size   : 32	
    <1053>   DW_AT_decl_file   : 4	
    <1054>   DW_AT_decl_line   : 497	
    <1056>   DW_AT_sibling     : <0x109c>	
 <2><105a>: Abbrev Number: 17 (DW_TAG_member)
    <105b>   DW_AT_name        : hit	
    <105f>   DW_AT_decl_file   : 4	
    <1060>   DW_AT_decl_line   : 498	
    <1062>   DW_AT_type        : <0x109c>	
    <1066>   DW_AT_data_member_location: 0	
 <2><1067>: Abbrev Number: 18 (DW_TAG_member)
    <1068>   DW_AT_name        : (indirect string, offset: 0x3f2): unsrt	
    <106c>   DW_AT_decl_file   : 4	
    <106d>   DW_AT_decl_line   : 499	
    <106f>   DW_AT_type        : <0x10a2>	
    <1073>   DW_AT_data_member_location: 8	
 <2><1074>: Abbrev Number: 18 (DW_TAG_member)
    <1075>   DW_AT_name        : (indirect string, offset: 0x2253): alloc	
    <1079>   DW_AT_decl_file   : 4	
    <107a>   DW_AT_decl_line   : 500	
    <107c>   DW_AT_type        : <0x7a0>	
    <1080>   DW_AT_data_member_location: 16	
 <2><1081>: Abbrev Number: 17 (DW_TAG_member)
    <1082>   DW_AT_name        : num	
    <1086>   DW_AT_decl_file   : 4	
    <1087>   DW_AT_decl_line   : 501	
    <1089>   DW_AT_type        : <0x7a0>	
    <108d>   DW_AT_data_member_location: 20	
 <2><108e>: Abbrev Number: 18 (DW_TAG_member)
    <108f>   DW_AT_name        : (indirect string, offset: 0x2a0): lump	
    <1093>   DW_AT_decl_file   : 4	
    <1094>   DW_AT_decl_line   : 502	
    <1096>   DW_AT_type        : <0x7a0>	
    <109a>   DW_AT_data_member_location: 24	
 <2><109b>: Abbrev Number: 0
 <1><109c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <109d>   DW_AT_byte_size   : 8	
    <109e>   DW_AT_type        : <0x10a2>	
 <1><10a2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10a3>   DW_AT_byte_size   : 8	
    <10a4>   DW_AT_type        : <0xf5c>	
 <1><10a8>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <10a9>   DW_AT_byte_size   : 4	
    <10aa>   DW_AT_decl_file   : 4	
    <10ab>   DW_AT_decl_line   : 524	
    <10ad>   DW_AT_sibling     : <0x10ca>	
 <2><10b1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <10b2>   DW_AT_name        : (indirect string, offset: 0x340): CUT_NONE	
    <10b6>   DW_AT_const_value : 0	
 <2><10b7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x4a9): CUT_GA	
    <10bc>   DW_AT_const_value : 1	
 <2><10bd>: Abbrev Number: 20 (DW_TAG_enumerator)
    <10be>   DW_AT_name        : (indirect string, offset: 0x585): CUT_NC	
    <10c2>   DW_AT_const_value : 2	
 <2><10c3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <10c4>   DW_AT_name        : (indirect string, offset: 0x649): CUT_TC	
    <10c8>   DW_AT_const_value : 3	
 <2><10c9>: Abbrev Number: 0
 <1><10ca>: Abbrev Number: 16 (DW_TAG_structure_type)
    <10cb>   DW_AT_name        : (indirect string, offset: 0x400): threshold_s	
    <10cf>   DW_AT_byte_size   : 40	
    <10d0>   DW_AT_decl_file   : 4	
    <10d1>   DW_AT_decl_line   : 518	
    <10d3>   DW_AT_sibling     : <0x1124>	
 <2><10d7>: Abbrev Number: 18 (DW_TAG_member)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x5f4): globT	
    <10dc>   DW_AT_decl_file   : 4	
    <10dd>   DW_AT_decl_line   : 519	
    <10df>   DW_AT_type        : <0x7c4>	
    <10e3>   DW_AT_data_member_location: 0	
 <2><10e4>: Abbrev Number: 18 (DW_TAG_member)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x5e9): globE	
    <10e9>   DW_AT_decl_file   : 4	
    <10ea>   DW_AT_decl_line   : 520	
    <10ec>   DW_AT_type        : <0x7cb>	
    <10f0>   DW_AT_data_member_location: 8	
 <2><10f1>: Abbrev Number: 18 (DW_TAG_member)
    <10f2>   DW_AT_name        : (indirect string, offset: 0x525): domT	
    <10f6>   DW_AT_decl_file   : 4	
    <10f7>   DW_AT_decl_line   : 521	
    <10f9>   DW_AT_type        : <0x7c4>	
    <10fd>   DW_AT_data_member_location: 16	
 <2><10fe>: Abbrev Number: 18 (DW_TAG_member)
    <10ff>   DW_AT_name        : (indirect string, offset: 0x520): domE	
    <1103>   DW_AT_decl_file   : 4	
    <1104>   DW_AT_decl_line   : 522	
    <1106>   DW_AT_type        : <0x7cb>	
    <110a>   DW_AT_data_member_location: 24	
 <2><110b>: Abbrev Number: 18 (DW_TAG_member)
    <110c>   DW_AT_name        : (indirect string, offset: 0x4d7): autocut	
    <1110>   DW_AT_decl_file   : 4	
    <1111>   DW_AT_decl_line   : 524	
    <1113>   DW_AT_type        : <0x10a8>	
    <1117>   DW_AT_data_member_location: 32	
 <2><1118>: Abbrev Number: 17 (DW_TAG_member)
    <1119>   DW_AT_name        : Z	
    <111b>   DW_AT_decl_file   : 4	
    <111c>   DW_AT_decl_line   : 525	
    <111e>   DW_AT_type        : <0x7a0>	
    <1122>   DW_AT_data_member_location: 36	
 <2><1123>: Abbrev Number: 0
 <1><1124>: Abbrev Number: 21 (DW_TAG_subprogram)
    <1125>   DW_AT_external    : 1	
    <1125>   DW_AT_name        : (indirect string, offset: 0x612): CreatePlan7Matrix	
    <1129>   DW_AT_decl_file   : 1	
    <112a>   DW_AT_decl_line   : 61	
    <112b>   DW_AT_prototyped  : 1	
    <112b>   DW_AT_type        : <0x1193>	
    <112f>   DW_AT_low_pc      : 0x402139	
    <1137>   DW_AT_high_pc     : 0x30f	
    <113f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1141>   DW_AT_GNU_all_tail_call_sites: 1	
    <1141>   DW_AT_sibling     : <0x1193>	
 <2><1145>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1146>   DW_AT_name        : N	
    <1148>   DW_AT_decl_file   : 1	
    <1149>   DW_AT_decl_line   : 61	
    <114a>   DW_AT_type        : <0x7a0>	
    <114e>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><1151>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1152>   DW_AT_name        : M	
    <1154>   DW_AT_decl_file   : 1	
    <1155>   DW_AT_decl_line   : 61	
    <1156>   DW_AT_type        : <0x7a0>	
    <115a>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><115d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <115e>   DW_AT_name        : (indirect string, offset: 0x4e4): padN	
    <1162>   DW_AT_decl_file   : 1	
    <1163>   DW_AT_decl_line   : 61	
    <1164>   DW_AT_type        : <0x7a0>	
    <1168>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><116b>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <116c>   DW_AT_name        : (indirect string, offset: 0x4df): padM	
    <1170>   DW_AT_decl_file   : 1	
    <1171>   DW_AT_decl_line   : 61	
    <1172>   DW_AT_type        : <0x7a0>	
    <1176>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><1179>: Abbrev Number: 24 (DW_TAG_variable)
    <117a>   DW_AT_name        : mx	
    <117d>   DW_AT_decl_file   : 1	
    <117e>   DW_AT_decl_line   : 63	
    <117f>   DW_AT_type        : <0x1193>	
    <1183>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><1186>: Abbrev Number: 24 (DW_TAG_variable)
    <1187>   DW_AT_name        : i	
    <1189>   DW_AT_decl_file   : 1	
    <118a>   DW_AT_decl_line   : 64	
    <118b>   DW_AT_type        : <0x7a0>	
    <118f>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><1192>: Abbrev Number: 0
 <1><1193>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1194>   DW_AT_byte_size   : 8	
    <1195>   DW_AT_type        : <0xd8b>	
 <1><1199>: Abbrev Number: 25 (DW_TAG_subprogram)
    <119a>   DW_AT_external    : 1	
    <119a>   DW_AT_name        : (indirect string, offset: 0x443): ResizePlan7Matrix	
    <119e>   DW_AT_decl_file   : 1	
    <119f>   DW_AT_decl_line   : 123	
    <11a0>   DW_AT_prototyped  : 1	
    <11a0>   DW_AT_low_pc      : 0x402448	
    <11a8>   DW_AT_high_pc     : 0x3e8	
    <11b0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <11b2>   DW_AT_GNU_all_tail_call_sites: 1	
    <11b2>   DW_AT_sibling     : <0x1230>	
 <2><11b6>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <11b7>   DW_AT_name        : mx	
    <11ba>   DW_AT_decl_file   : 1	
    <11bb>   DW_AT_decl_line   : 123	
    <11bc>   DW_AT_type        : <0x1193>	
    <11c0>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><11c3>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <11c4>   DW_AT_name        : N	
    <11c6>   DW_AT_decl_file   : 1	
    <11c7>   DW_AT_decl_line   : 123	
    <11c8>   DW_AT_type        : <0x7a0>	
    <11cc>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><11cf>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <11d0>   DW_AT_name        : M	
    <11d2>   DW_AT_decl_file   : 1	
    <11d3>   DW_AT_decl_line   : 123	
    <11d4>   DW_AT_type        : <0x7a0>	
    <11d8>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><11db>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <11dc>   DW_AT_name        : xmx	
    <11e0>   DW_AT_decl_file   : 1	
    <11e1>   DW_AT_decl_line   : 124	
    <11e2>   DW_AT_type        : <0x1230>	
    <11e6>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><11e9>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <11ea>   DW_AT_name        : mmx	
    <11ee>   DW_AT_decl_file   : 1	
    <11ef>   DW_AT_decl_line   : 124	
    <11f0>   DW_AT_type        : <0x1230>	
    <11f4>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><11f7>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <11f8>   DW_AT_name        : imx	
    <11fc>   DW_AT_decl_file   : 1	
    <11fd>   DW_AT_decl_line   : 124	
    <11fe>   DW_AT_type        : <0x1230>	
    <1202>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><1206>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1207>   DW_AT_name        : dmx	
    <120b>   DW_AT_decl_file   : 1	
    <120c>   DW_AT_decl_line   : 124	
    <120d>   DW_AT_type        : <0x1230>	
    <1211>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><1214>: Abbrev Number: 24 (DW_TAG_variable)
    <1215>   DW_AT_name        : i	
    <1217>   DW_AT_decl_file   : 1	
    <1218>   DW_AT_decl_line   : 126	
    <1219>   DW_AT_type        : <0x7a0>	
    <121d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1220>: Abbrev Number: 26 (DW_TAG_label)
    <1221>   DW_AT_name        : (indirect string, offset: 0x650): DONE	
    <1225>   DW_AT_decl_file   : 1	
    <1226>   DW_AT_decl_line   : 162	
    <1227>   DW_AT_low_pc      : 0x4027d7	
 <2><122f>: Abbrev Number: 0
 <1><1230>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1231>   DW_AT_byte_size   : 8	
    <1232>   DW_AT_type        : <0xd6f>	
 <1><1236>: Abbrev Number: 21 (DW_TAG_subprogram)
    <1237>   DW_AT_external    : 1	
    <1237>   DW_AT_name        : (indirect string, offset: 0x4e9): AllocPlan7Matrix	
    <123b>   DW_AT_decl_file   : 1	
    <123c>   DW_AT_decl_line   : 192	
    <123d>   DW_AT_prototyped  : 1	
    <123d>   DW_AT_type        : <0x1193>	
    <1241>   DW_AT_low_pc      : 0x402830	
    <1249>   DW_AT_high_pc     : 0x99	
    <1251>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1253>   DW_AT_GNU_all_tail_call_sites: 1	
    <1253>   DW_AT_sibling     : <0x12b8>	
 <2><1257>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <1258>   DW_AT_name        : (indirect string, offset: 0x3ed): rows	
    <125c>   DW_AT_decl_file   : 1	
    <125d>   DW_AT_decl_line   : 192	
    <125e>   DW_AT_type        : <0x7a0>	
    <1262>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><1265>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1266>   DW_AT_name        : M	
    <1268>   DW_AT_decl_file   : 1	
    <1269>   DW_AT_decl_line   : 192	
    <126a>   DW_AT_type        : <0x7a0>	
    <126e>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><1271>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1272>   DW_AT_name        : xmx	
    <1276>   DW_AT_decl_file   : 1	
    <1277>   DW_AT_decl_line   : 192	
