Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x437 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x119): GNU C 4.8.1 -mtune=generic -march=x86-64 -g -fno-strict-aliasing -fstack-protector	
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0x253): mcf.c	
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x18b): /home/yunqi/SPEC2006/benchspec/CPU2006/429.mcf/build/build_base_amd64-m64-gcc43-nn.0000	
    <19>   DW_AT_low_pc      : 0x40110e	
    <21>   DW_AT_high_pc     : 0x263	
    <29>   DW_AT_stmt_list   : 0x0	
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x34): size_t	
    <32>   DW_AT_decl_file   : 2	
    <33>   DW_AT_decl_line   : 212	
    <34>   DW_AT_type        : <0x38>	
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8	
    <3a>   DW_AT_encoding    : 7	(unsigned)
    <3b>   DW_AT_name        : (indirect string, offset: 0x171): long unsigned int	
 <1><3f>: Abbrev Number: 3 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 1	
    <41>   DW_AT_encoding    : 8	(unsigned char)
    <42>   DW_AT_name        : (indirect string, offset: 0xfc): unsigned char	
 <1><46>: Abbrev Number: 3 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 2	
    <48>   DW_AT_encoding    : 7	(unsigned)
    <49>   DW_AT_name        : (indirect string, offset: 0x203): short unsigned int	
 <1><4d>: Abbrev Number: 3 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 4	
    <4f>   DW_AT_encoding    : 7	(unsigned)
    <50>   DW_AT_name        : (indirect string, offset: 0x176): unsigned int	
 <1><54>: Abbrev Number: 3 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 1	
    <56>   DW_AT_encoding    : 6	(signed char)
    <57>   DW_AT_name        : (indirect string, offset: 0xfe): signed char	
 <1><5b>: Abbrev Number: 3 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 2	
    <5d>   DW_AT_encoding    : 5	(signed)
    <5e>   DW_AT_name        : (indirect string, offset: 0x2a): short int	
 <1><62>: Abbrev Number: 4 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 4	
    <64>   DW_AT_encoding    : 5	(signed)
    <65>   DW_AT_name        : int	
 <1><69>: Abbrev Number: 3 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 8	
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0xb6): long int	
 <1><70>: Abbrev Number: 3 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 8	
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x29f): sizetype	
 <1><77>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <78>   DW_AT_byte_size   : 8	
    <79>   DW_AT_type        : <0x7d>	
 <1><7d>: Abbrev Number: 3 (DW_TAG_base_type)
    <7e>   DW_AT_byte_size   : 1	
    <7f>   DW_AT_encoding    : 6	(signed char)
    <80>   DW_AT_name        : (indirect string, offset: 0x105): char	
 <1><84>: Abbrev Number: 3 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 4	
    <86>   DW_AT_encoding    : 4	(float)
    <87>   DW_AT_name        : (indirect string, offset: 0x9d): float	
 <1><8b>: Abbrev Number: 3 (DW_TAG_base_type)
    <8c>   DW_AT_byte_size   : 8	
    <8d>   DW_AT_encoding    : 4	(float)
    <8e>   DW_AT_name        : (indirect string, offset: 0x24c): double	
 <1><92>: Abbrev Number: 3 (DW_TAG_base_type)
    <93>   DW_AT_byte_size   : 8	
    <94>   DW_AT_encoding    : 5	(signed)
    <95>   DW_AT_name        : (indirect string, offset: 0xb1): long long int	
 <1><99>: Abbrev Number: 3 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 8	
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x16c): long long unsigned int	
 <1><a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x263): flow_t	
    <a5>   DW_AT_decl_file   : 3	
    <a6>   DW_AT_decl_line   : 68	
    <a7>   DW_AT_type        : <0x69>	
 <1><ab>: Abbrev Number: 2 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (indirect string, offset: 0x96): cost_t	
    <b0>   DW_AT_decl_file   : 3	
    <b1>   DW_AT_decl_line   : 69	
    <b2>   DW_AT_type        : <0x69>	
 <1><b6>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b7>   DW_AT_name        : (indirect string, offset: 0xda): node	
    <bb>   DW_AT_byte_size   : 104	
    <bc>   DW_AT_decl_file   : 3	
    <bd>   DW_AT_decl_line   : 107	
    <be>   DW_AT_sibling     : <0x16b>	
 <2><c2>: Abbrev Number: 7 (DW_TAG_member)
    <c3>   DW_AT_name        : (indirect string, offset: 0x5b0): potential	
    <c7>   DW_AT_decl_file   : 3	
    <c8>   DW_AT_decl_line   : 109	
    <c9>   DW_AT_type        : <0xab>	
    <cd>   DW_AT_data_member_location: 0	
 <2><ce>: Abbrev Number: 7 (DW_TAG_member)
    <cf>   DW_AT_name        : (indirect string, offset: 0x669): orientation	
    <d3>   DW_AT_decl_file   : 3	
    <d4>   DW_AT_decl_line   : 110	
    <d5>   DW_AT_type        : <0x62>	
    <d9>   DW_AT_data_member_location: 8	
 <2><da>: Abbrev Number: 7 (DW_TAG_member)
    <db>   DW_AT_name        : (indirect string, offset: 0x3b): child	
    <df>   DW_AT_decl_file   : 3	
    <e0>   DW_AT_decl_line   : 111	
    <e1>   DW_AT_type        : <0x16b>	
    <e5>   DW_AT_data_member_location: 16	
 <2><e6>: Abbrev Number: 7 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x6a5): pred	
    <eb>   DW_AT_decl_file   : 3	
    <ec>   DW_AT_decl_line   : 112	
    <ed>   DW_AT_type        : <0x16b>	
    <f1>   DW_AT_data_member_location: 24	
 <2><f2>: Abbrev Number: 7 (DW_TAG_member)
    <f3>   DW_AT_name        : (indirect string, offset: 0x62): sibling	
    <f7>   DW_AT_decl_file   : 3	
    <f8>   DW_AT_decl_line   : 113	
    <f9>   DW_AT_type        : <0x16b>	
    <fd>   DW_AT_data_member_location: 32	
 <2><fe>: Abbrev Number: 7 (DW_TAG_member)
    <ff>   DW_AT_name        : (indirect string, offset: 0xe7): sibling_prev	
    <103>   DW_AT_decl_file   : 3	
    <104>   DW_AT_decl_line   : 114	
    <105>   DW_AT_type        : <0x16b>	
    <109>   DW_AT_data_member_location: 40	
 <2><10a>: Abbrev Number: 7 (DW_TAG_member)
    <10b>   DW_AT_name        : (indirect string, offset: 0x6c8): basic_arc	
    <10f>   DW_AT_decl_file   : 3	
    <110>   DW_AT_decl_line   : 115	
    <111>   DW_AT_type        : <0x1e9>	
    <115>   DW_AT_data_member_location: 48	
 <2><116>: Abbrev Number: 7 (DW_TAG_member)
    <117>   DW_AT_name        : (indirect string, offset: 0x59): firstout	
    <11b>   DW_AT_decl_file   : 3	
    <11c>   DW_AT_decl_line   : 116	
    <11d>   DW_AT_type        : <0x1e9>	
    <121>   DW_AT_data_member_location: 56	
 <2><122>: Abbrev Number: 7 (DW_TAG_member)
    <123>   DW_AT_name        : (indirect string, offset: 0xdf): firstin	
    <127>   DW_AT_decl_file   : 3	
    <128>   DW_AT_decl_line   : 116	
    <129>   DW_AT_type        : <0x1e9>	
    <12d>   DW_AT_data_member_location: 64	
 <2><12e>: Abbrev Number: 7 (DW_TAG_member)
    <12f>   DW_AT_name        : (indirect string, offset: 0xa9): arc_tmp	
    <133>   DW_AT_decl_file   : 3	
    <134>   DW_AT_decl_line   : 117	
    <135>   DW_AT_type        : <0x1e9>	
    <139>   DW_AT_data_member_location: 72	
 <2><13a>: Abbrev Number: 7 (DW_TAG_member)
    <13b>   DW_AT_name        : (indirect string, offset: 0x767): flow	
    <13f>   DW_AT_decl_file   : 3	
    <140>   DW_AT_decl_line   : 118	
    <141>   DW_AT_type        : <0xa0>	
    <145>   DW_AT_data_member_location: 80	
 <2><146>: Abbrev Number: 7 (DW_TAG_member)
    <147>   DW_AT_name        : (indirect string, offset: 0x6f2): depth	
    <14b>   DW_AT_decl_file   : 3	
    <14c>   DW_AT_decl_line   : 119	
    <14d>   DW_AT_type        : <0x69>	
    <151>   DW_AT_data_member_location: 88	
 <2><152>: Abbrev Number: 7 (DW_TAG_member)
    <153>   DW_AT_name        : (indirect string, offset: 0x2b4): number	
    <157>   DW_AT_decl_file   : 3	
    <158>   DW_AT_decl_line   : 120	
    <159>   DW_AT_type        : <0x62>	
    <15d>   DW_AT_data_member_location: 96	
 <2><15e>: Abbrev Number: 7 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x1f4): time	
    <163>   DW_AT_decl_file   : 3	
    <164>   DW_AT_decl_line   : 121	
    <165>   DW_AT_type        : <0x62>	
    <169>   DW_AT_data_member_location: 100	
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_typedef)
    <16c>   DW_AT_name        : (indirect string, offset: 0x1e3): node_p	
    <170>   DW_AT_decl_file   : 3	
    <171>   DW_AT_decl_line   : 100	
    <172>   DW_AT_type        : <0x176>	
 <1><176>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <177>   DW_AT_byte_size   : 8	
    <178>   DW_AT_type        : <0xb6>	
 <1><17c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <17d>   DW_AT_name        : arc	
    <181>   DW_AT_byte_size   : 64	
    <182>   DW_AT_decl_file   : 3	
    <183>   DW_AT_decl_line   : 126	
    <184>   DW_AT_sibling     : <0x1e9>	
 <2><188>: Abbrev Number: 7 (DW_TAG_member)
    <189>   DW_AT_name        : (indirect string, offset: 0x5ef): cost	
    <18d>   DW_AT_decl_file   : 3	
    <18e>   DW_AT_decl_line   : 128	
    <18f>   DW_AT_type        : <0xab>	
    <193>   DW_AT_data_member_location: 0	
 <2><194>: Abbrev Number: 7 (DW_TAG_member)
    <195>   DW_AT_name        : (indirect string, offset: 0x1ea): tail	
    <199>   DW_AT_decl_file   : 3	
    <19a>   DW_AT_decl_line   : 129	
    <19b>   DW_AT_type        : <0x16b>	
    <19f>   DW_AT_data_member_location: 8	
 <2><1a0>: Abbrev Number: 7 (DW_TAG_member)
    <1a1>   DW_AT_name        : (indirect string, offset: 0x88): head	
    <1a5>   DW_AT_decl_file   : 3	
    <1a6>   DW_AT_decl_line   : 129	
    <1a7>   DW_AT_type        : <0x16b>	
    <1ab>   DW_AT_data_member_location: 16	
 <2><1ac>: Abbrev Number: 7 (DW_TAG_member)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x2ae): ident	
    <1b1>   DW_AT_decl_file   : 3	
    <1b2>   DW_AT_decl_line   : 130	
    <1b3>   DW_AT_type        : <0x62>	
    <1b7>   DW_AT_data_member_location: 24	
 <2><1b8>: Abbrev Number: 7 (DW_TAG_member)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x2d1): nextout	
    <1bd>   DW_AT_decl_file   : 3	
    <1be>   DW_AT_decl_line   : 131	
    <1bf>   DW_AT_type        : <0x1e9>	
    <1c3>   DW_AT_data_member_location: 32	
 <2><1c4>: Abbrev Number: 7 (DW_TAG_member)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x52): nextin	
    <1c9>   DW_AT_decl_file   : 3	
    <1ca>   DW_AT_decl_line   : 131	
    <1cb>   DW_AT_type        : <0x1e9>	
    <1cf>   DW_AT_data_member_location: 40	
 <2><1d0>: Abbrev Number: 7 (DW_TAG_member)
    <1d1>   DW_AT_name        : (indirect string, offset: 0x767): flow	
    <1d5>   DW_AT_decl_file   : 3	
    <1d6>   DW_AT_decl_line   : 132	
    <1d7>   DW_AT_type        : <0xa0>	
    <1db>   DW_AT_data_member_location: 48	
 <2><1dc>: Abbrev Number: 7 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x499): org_cost	
    <1e1>   DW_AT_decl_file   : 3	
    <1e2>   DW_AT_decl_line   : 133	
    <1e3>   DW_AT_type        : <0xab>	
    <1e7>   DW_AT_data_member_location: 56	
 <2><1e8>: Abbrev Number: 0
 <1><1e9>: Abbrev Number: 2 (DW_TAG_typedef)
    <1ea>   DW_AT_name        : (indirect string, offset: 0x2bb): arc_p	
    <1ee>   DW_AT_decl_file   : 3	
    <1ef>   DW_AT_decl_line   : 103	
    <1f0>   DW_AT_type        : <0x1f4>	
 <1><1f4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1f5>   DW_AT_byte_size   : 8	
    <1f6>   DW_AT_type        : <0x17c>	
 <1><1fa>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x183): network	
    <1ff>   DW_AT_byte_size   : 624	
    <201>   DW_AT_decl_file   : 3	
    <202>   DW_AT_decl_line   : 138	
    <203>   DW_AT_sibling     : <0x388>	
 <2><207>: Abbrev Number: 7 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x295): inputfile	
    <20c>   DW_AT_decl_file   : 3	
    <20d>   DW_AT_decl_line   : 140	
    <20e>   DW_AT_type        : <0x388>	
    <212>   DW_AT_data_member_location: 0	
 <2><213>: Abbrev Number: 7 (DW_TAG_member)
    <214>   DW_AT_name        : (indirect string, offset: 0x238): clustfile	
    <218>   DW_AT_decl_file   : 3	
    <219>   DW_AT_decl_line   : 141	
    <21a>   DW_AT_type        : <0x388>	
    <21e>   DW_AT_data_member_location: 200	
 <2><21f>: Abbrev Number: 10 (DW_TAG_member)
    <220>   DW_AT_name        : n	
    <222>   DW_AT_decl_file   : 3	
    <223>   DW_AT_decl_line   : 142	
    <224>   DW_AT_type        : <0x69>	
    <228>   DW_AT_data_member_location: 400	
 <2><22a>: Abbrev Number: 11 (DW_TAG_member)
    <22b>   DW_AT_name        : (indirect string, offset: 0xf4): n_trips	
    <22f>   DW_AT_decl_file   : 3	
    <230>   DW_AT_decl_line   : 142	
    <231>   DW_AT_type        : <0x69>	
    <235>   DW_AT_data_member_location: 408	
 <2><237>: Abbrev Number: 11 (DW_TAG_member)
    <238>   DW_AT_name        : (indirect string, offset: 0xa3): max_m	
    <23c>   DW_AT_decl_file   : 3	
    <23d>   DW_AT_decl_line   : 143	
    <23e>   DW_AT_type        : <0x69>	
    <242>   DW_AT_data_member_location: 416	
 <2><244>: Abbrev Number: 10 (DW_TAG_member)
    <245>   DW_AT_name        : m	
    <247>   DW_AT_decl_file   : 3	
    <248>   DW_AT_decl_line   : 143	
    <249>   DW_AT_type        : <0x69>	
    <24d>   DW_AT_data_member_location: 424	
 <2><24f>: Abbrev Number: 11 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x2a8): m_org	
    <254>   DW_AT_decl_file   : 3	
    <255>   DW_AT_decl_line   : 143	
    <256>   DW_AT_type        : <0x69>	
    <25a>   DW_AT_data_member_location: 432	
 <2><25c>: Abbrev Number: 11 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0xbf): m_impl	
    <261>   DW_AT_decl_file   : 3	
    <262>   DW_AT_decl_line   : 143	
    <263>   DW_AT_type        : <0x69>	
    <267>   DW_AT_data_member_location: 440	
 <2><269>: Abbrev Number: 11 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x6a): max_residual_new_m	
    <26e>   DW_AT_decl_file   : 3	
    <26f>   DW_AT_decl_line   : 144	
    <270>   DW_AT_type        : <0x69>	
    <274>   DW_AT_data_member_location: 448	
 <2><276>: Abbrev Number: 11 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x1f9): max_new_m	
    <27b>   DW_AT_decl_file   : 3	
    <27c>   DW_AT_decl_line   : 144	
    <27d>   DW_AT_type        : <0x69>	
    <281>   DW_AT_data_member_location: 456	
 <2><283>: Abbrev Number: 11 (DW_TAG_member)
    <284>   DW_AT_name        : (indirect string, offset: 0x26a): primal_unbounded	
    <288>   DW_AT_decl_file   : 3	
    <289>   DW_AT_decl_line   : 146	
    <28a>   DW_AT_type        : <0x69>	
    <28e>   DW_AT_data_member_location: 464	
 <2><290>: Abbrev Number: 11 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xb): dual_unbounded	
    <295>   DW_AT_decl_file   : 3	
    <296>   DW_AT_decl_line   : 147	
    <297>   DW_AT_type        : <0x69>	
    <29b>   DW_AT_data_member_location: 472	
 <2><29d>: Abbrev Number: 11 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0x10a): perturbed	
    <2a2>   DW_AT_decl_file   : 3	
    <2a3>   DW_AT_decl_line   : 148	
    <2a4>   DW_AT_type        : <0x69>	
    <2a8>   DW_AT_data_member_location: 480	
 <2><2aa>: Abbrev Number: 11 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x39a): feasible	
    <2af>   DW_AT_decl_file   : 3	
    <2b0>   DW_AT_decl_line   : 149	
    <2b1>   DW_AT_type        : <0x69>	
    <2b5>   DW_AT_data_member_location: 488	
 <2><2b7>: Abbrev Number: 10 (DW_TAG_member)
    <2b8>   DW_AT_name        : eps	
    <2bc>   DW_AT_decl_file   : 3	
    <2bd>   DW_AT_decl_line   : 150	
    <2be>   DW_AT_type        : <0x69>	
    <2c2>   DW_AT_data_member_location: 496	
 <2><2c4>: Abbrev Number: 11 (DW_TAG_member)
    <2c5>   DW_AT_name        : (indirect string, offset: 0xd2): opt_tol	
    <2c9>   DW_AT_decl_file   : 3	
    <2ca>   DW_AT_decl_line   : 151	
    <2cb>   DW_AT_type        : <0x69>	
    <2cf>   DW_AT_data_member_location: 504	
 <2><2d1>: Abbrev Number: 11 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x226): feas_tol	
    <2d6>   DW_AT_decl_file   : 3	
    <2d7>   DW_AT_decl_line   : 152	
    <2d8>   DW_AT_type        : <0x69>	
    <2dc>   DW_AT_data_member_location: 512	
 <2><2de>: Abbrev Number: 11 (DW_TAG_member)
    <2df>   DW_AT_name        : (indirect string, offset: 0x22f): pert_val	
    <2e3>   DW_AT_decl_file   : 3	
    <2e4>   DW_AT_decl_line   : 153	
    <2e5>   DW_AT_type        : <0x69>	
    <2e9>   DW_AT_data_member_location: 520	
 <2><2eb>: Abbrev Number: 11 (DW_TAG_member)
    <2ec>   DW_AT_name        : (indirect string, offset: 0x25): bigM	
    <2f0>   DW_AT_decl_file   : 3	
    <2f1>   DW_AT_decl_line   : 154	
    <2f2>   DW_AT_type        : <0x69>	
    <2f6>   DW_AT_data_member_location: 528	
 <2><2f8>: Abbrev Number: 11 (DW_TAG_member)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x4a): optcost	
    <2fd>   DW_AT_decl_file   : 3	
    <2fe>   DW_AT_decl_line   : 155	
    <2ff>   DW_AT_type        : <0x8b>	
    <303>   DW_AT_data_member_location: 536	
 <2><305>: Abbrev Number: 11 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xc6): ignore_impl	
    <30a>   DW_AT_decl_file   : 3	
    <30b>   DW_AT_decl_line   : 156	
    <30c>   DW_AT_type        : <0xab>	
    <310>   DW_AT_data_member_location: 544	
 <2><312>: Abbrev Number: 11 (DW_TAG_member)
    <313>   DW_AT_name        : (indirect string, offset: 0x1f): nodes	
    <317>   DW_AT_decl_file   : 3	
    <318>   DW_AT_decl_line   : 157	
    <319>   DW_AT_type        : <0x16b>	
    <31d>   DW_AT_data_member_location: 552	
 <2><31f>: Abbrev Number: 11 (DW_TAG_member)
    <320>   DW_AT_name        : (indirect string, offset: 0x1a): stop_nodes	
    <324>   DW_AT_decl_file   : 3	
    <325>   DW_AT_decl_line   : 157	
    <326>   DW_AT_type        : <0x16b>	
    <32a>   DW_AT_data_member_location: 560	
 <2><32c>: Abbrev Number: 11 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x247): arcs	
    <331>   DW_AT_decl_file   : 3	
    <332>   DW_AT_decl_line   : 158	
    <333>   DW_AT_type        : <0x1e9>	
    <337>   DW_AT_data_member_location: 568	
 <2><339>: Abbrev Number: 11 (DW_TAG_member)
    <33a>   DW_AT_name        : (indirect string, offset: 0x242): stop_arcs	
    <33e>   DW_AT_decl_file   : 3	
    <33f>   DW_AT_decl_line   : 158	
    <340>   DW_AT_type        : <0x1e9>	
    <344>   DW_AT_data_member_location: 576	
 <2><346>: Abbrev Number: 11 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x0): dummy_arcs	
    <34b>   DW_AT_decl_file   : 3	
    <34c>   DW_AT_decl_line   : 159	
    <34d>   DW_AT_type        : <0x1e9>	
    <351>   DW_AT_data_member_location: 584	
 <2><353>: Abbrev Number: 11 (DW_TAG_member)
    <354>   DW_AT_name        : (indirect string, offset: 0x7d): stop_dummy	
    <358>   DW_AT_decl_file   : 3	
    <359>   DW_AT_decl_line   : 159	
    <35a>   DW_AT_type        : <0x1e9>	
    <35e>   DW_AT_data_member_location: 592	
 <2><360>: Abbrev Number: 11 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x27b): iterations	
    <365>   DW_AT_decl_file   : 3	
    <366>   DW_AT_decl_line   : 160	
    <367>   DW_AT_type        : <0x69>	
    <36b>   DW_AT_data_member_location: 600	
 <2><36d>: Abbrev Number: 11 (DW_TAG_member)
    <36e>   DW_AT_name        : (indirect string, offset: 0x2c1): bound_exchanges	
    <372>   DW_AT_decl_file   : 3	
    <373>   DW_AT_decl_line   : 161	
    <374>   DW_AT_type        : <0x69>	
    <378>   DW_AT_data_member_location: 608	
 <2><37a>: Abbrev Number: 11 (DW_TAG_member)
    <37b>   DW_AT_name        : (indirect string, offset: 0x8d): checksum	
    <37f>   DW_AT_decl_file   : 3	
    <380>   DW_AT_decl_line   : 162	
    <381>   DW_AT_type        : <0x69>	
    <385>   DW_AT_data_member_location: 616	
 <2><387>: Abbrev Number: 0
 <1><388>: Abbrev Number: 12 (DW_TAG_array_type)
    <389>   DW_AT_type        : <0x7d>	
    <38d>   DW_AT_sibling     : <0x398>	
 <2><391>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <392>   DW_AT_type        : <0x70>	
    <396>   DW_AT_upper_bound : 199	
 <2><397>: Abbrev Number: 0
 <1><398>: Abbrev Number: 2 (DW_TAG_typedef)
    <399>   DW_AT_name        : (indirect string, offset: 0x259): network_t	
    <39d>   DW_AT_decl_file   : 3	
    <39e>   DW_AT_decl_line   : 163	
    <39f>   DW_AT_type        : <0x1fa>	
 <1><3a3>: Abbrev Number: 14 (DW_TAG_subprogram)
    <3a4>   DW_AT_external    : 1	
    <3a4>   DW_AT_name        : (indirect string, offset: 0x216): global_opt	
    <3a8>   DW_AT_decl_file   : 1	
    <3a9>   DW_AT_decl_line   : 35	
    <3aa>   DW_AT_prototyped  : 1	
    <3aa>   DW_AT_type        : <0x69>	
    <3ae>   DW_AT_low_pc      : 0x40110e	
    <3b6>   DW_AT_high_pc     : 0x149	
    <3be>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3c0>   DW_AT_GNU_all_tail_call_sites: 1	
    <3c0>   DW_AT_sibling     : <0x3e1>	
 <2><3c4>: Abbrev Number: 15 (DW_TAG_variable)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x41): new_arcs	
    <3c9>   DW_AT_decl_file   : 1	
    <3ca>   DW_AT_decl_line   : 40	
    <3cb>   DW_AT_type        : <0x69>	
    <3cf>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><3d2>: Abbrev Number: 15 (DW_TAG_variable)
    <3d3>   DW_AT_name        : (indirect string, offset: 0x286): residual_nb_it	
    <3d7>   DW_AT_decl_file   : 1	
    <3d8>   DW_AT_decl_line   : 41	
    <3d9>   DW_AT_type        : <0x69>	
    <3dd>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><3e0>: Abbrev Number: 0
 <1><3e1>: Abbrev Number: 14 (DW_TAG_subprogram)
    <3e2>   DW_AT_external    : 1	
    <3e2>   DW_AT_name        : (indirect string, offset: 0x221): main	
    <3e6>   DW_AT_decl_file   : 1	
    <3e7>   DW_AT_decl_line   : 117	
    <3e8>   DW_AT_prototyped  : 1	
    <3e8>   DW_AT_type        : <0x62>	
    <3ec>   DW_AT_low_pc      : 0x401257	
    <3f4>   DW_AT_high_pc     : 0x11a	
    <3fc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3fe>   DW_AT_GNU_all_tail_call_sites: 1	
    <3fe>   DW_AT_sibling     : <0x41f>	
 <2><402>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <403>   DW_AT_name        : (indirect string, offset: 0x114): argc	
    <407>   DW_AT_decl_file   : 1	
    <408>   DW_AT_decl_line   : 117	
    <409>   DW_AT_type        : <0x62>	
    <40d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><410>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <411>   DW_AT_name        : (indirect string, offset: 0x1ef): argv	
    <415>   DW_AT_decl_file   : 1	
    <416>   DW_AT_decl_line   : 117	
    <417>   DW_AT_type        : <0x41f>	
    <41b>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><41e>: Abbrev Number: 0
 <1><41f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <420>   DW_AT_byte_size   : 8	
    <421>   DW_AT_type        : <0x77>	
 <1><425>: Abbrev Number: 17 (DW_TAG_variable)
    <426>   DW_AT_name        : net	
    <42a>   DW_AT_decl_file   : 1	
    <42b>   DW_AT_decl_line   : 28	
    <42c>   DW_AT_type        : <0x398>	
    <430>   DW_AT_external    : 1	
    <430>   DW_AT_location    : 9 byte block: 3 c0 e6 6c 0 0 0 0 0 	(DW_OP_addr: 6ce6c0)
 <1><43a>: Abbrev Number: 0
  Compilation Unit @ offset 0x43b:
   Length:        0x8a8 (32-bit)
   Version:       4
   Abbrev Offset: 0xf7
   Pointer Size:  8
 <0><446>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <447>   DW_AT_producer    : (indirect string, offset: 0x119): GNU C 4.8.1 -mtune=generic -march=x86-64 -g -fno-strict-aliasing -fstack-protector	
    <44b>   DW_AT_language    : 1	(ANSI C)
    <44c>   DW_AT_name        : (indirect string, offset: 0x328): mcfutil.c	
    <450>   DW_AT_comp_dir    : (indirect string, offset: 0x18b): /home/yunqi/SPEC2006/benchspec/CPU2006/429.mcf/build/build_base_amd64-m64-gcc43-nn.0000	
    <454>   DW_AT_low_pc      : 0x401371	
    <45c>   DW_AT_high_pc     : 0x813	
    <464>   DW_AT_stmt_list   : 0xc3	
 <1><468>: Abbrev Number: 2 (DW_TAG_typedef)
    <469>   DW_AT_name        : (indirect string, offset: 0x34): size_t	
    <46d>   DW_AT_decl_file   : 2	
    <46e>   DW_AT_decl_line   : 212	
    <46f>   DW_AT_type        : <0x473>	
 <1><473>: Abbrev Number: 3 (DW_TAG_base_type)
    <474>   DW_AT_byte_size   : 8	
    <475>   DW_AT_encoding    : 7	(unsigned)
    <476>   DW_AT_name        : (indirect string, offset: 0x171): long unsigned int	
 <1><47a>: Abbrev Number: 3 (DW_TAG_base_type)
    <47b>   DW_AT_byte_size   : 1	
    <47c>   DW_AT_encoding    : 8	(unsigned char)
    <47d>   DW_AT_name        : (indirect string, offset: 0xfc): unsigned char	
 <1><481>: Abbrev Number: 3 (DW_TAG_base_type)
    <482>   DW_AT_byte_size   : 2	
    <483>   DW_AT_encoding    : 7	(unsigned)
    <484>   DW_AT_name        : (indirect string, offset: 0x203): short unsigned int	
 <1><488>: Abbrev Number: 3 (DW_TAG_base_type)
    <489>   DW_AT_byte_size   : 4	
    <48a>   DW_AT_encoding    : 7	(unsigned)
    <48b>   DW_AT_name        : (indirect string, offset: 0x176): unsigned int	
 <1><48f>: Abbrev Number: 3 (DW_TAG_base_type)
    <490>   DW_AT_byte_size   : 1	
    <491>   DW_AT_encoding    : 6	(signed char)
    <492>   DW_AT_name        : (indirect string, offset: 0xfe): signed char	
 <1><496>: Abbrev Number: 3 (DW_TAG_base_type)
    <497>   DW_AT_byte_size   : 2	
    <498>   DW_AT_encoding    : 5	(signed)
    <499>   DW_AT_name        : (indirect string, offset: 0x2a): short int	
 <1><49d>: Abbrev Number: 4 (DW_TAG_base_type)
    <49e>   DW_AT_byte_size   : 4	
    <49f>   DW_AT_encoding    : 5	(signed)
    <4a0>   DW_AT_name        : int	
 <1><4a4>: Abbrev Number: 3 (DW_TAG_base_type)
    <4a5>   DW_AT_byte_size   : 8	
    <4a6>   DW_AT_encoding    : 5	(signed)
    <4a7>   DW_AT_name        : (indirect string, offset: 0xb6): long int	
 <1><4ab>: Abbrev Number: 2 (DW_TAG_typedef)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x4b6): __off_t	
    <4b0>   DW_AT_decl_file   : 3	
    <4b1>   DW_AT_decl_line   : 140	
    <4b2>   DW_AT_type        : <0x4a4>	
 <1><4b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x4d9): __off64_t	
    <4bb>   DW_AT_decl_file   : 3	
    <4bc>   DW_AT_decl_line   : 141	
    <4bd>   DW_AT_type        : <0x4a4>	
 <1><4c1>: Abbrev Number: 3 (DW_TAG_base_type)
    <4c2>   DW_AT_byte_size   : 8	
    <4c3>   DW_AT_encoding    : 7	(unsigned)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x29f): sizetype	
 <1><4c8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <4c9>   DW_AT_byte_size   : 8	
 <1><4ca>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4cb>   DW_AT_byte_size   : 8	
    <4cc>   DW_AT_type        : <0x4d0>	
 <1><4d0>: Abbrev Number: 3 (DW_TAG_base_type)
    <4d1>   DW_AT_byte_size   : 1	
    <4d2>   DW_AT_encoding    : 6	(signed char)
    <4d3>   DW_AT_name        : (indirect string, offset: 0x105): char	
 <1><4d7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <4d8>   DW_AT_name        : (indirect string, offset: 0x48b): _IO_FILE	
    <4dc>   DW_AT_byte_size   : 216	
    <4dd>   DW_AT_decl_file   : 4	
    <4de>   DW_AT_decl_line   : 246	
    <4df>   DW_AT_sibling     : <0x658>	
 <2><4e3>: Abbrev Number: 8 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x321): _flags	
    <4e8>   DW_AT_decl_file   : 4	
    <4e9>   DW_AT_decl_line   : 247	
    <4ea>   DW_AT_type        : <0x49d>	
    <4ee>   DW_AT_data_member_location: 0	
 <2><4ef>: Abbrev Number: 8 (DW_TAG_member)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x3bc): _IO_read_ptr	
    <4f4>   DW_AT_decl_file   : 4	
    <4f5>   DW_AT_decl_line   : 252	
    <4f6>   DW_AT_type        : <0x4ca>	
    <4fa>   DW_AT_data_member_location: 8	
 <2><4fb>: Abbrev Number: 8 (DW_TAG_member)
    <4fc>   DW_AT_name        : (indirect string, offset: 0x46c): _IO_read_end	
    <500>   DW_AT_decl_file   : 4	
    <501>   DW_AT_decl_line   : 253	
    <502>   DW_AT_type        : <0x4ca>	
    <506>   DW_AT_data_member_location: 16	
 <2><507>: Abbrev Number: 8 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x37f): _IO_read_base	
    <50c>   DW_AT_decl_file   : 4	
    <50d>   DW_AT_decl_line   : 254	
    <50e>   DW_AT_type        : <0x4ca>	
    <512>   DW_AT_data_member_location: 24	
 <2><513>: Abbrev Number: 8 (DW_TAG_member)
    <514>   DW_AT_name        : (indirect string, offset: 0x3da): _IO_write_base	
    <518>   DW_AT_decl_file   : 4	
    <519>   DW_AT_decl_line   : 255	
    <51a>   DW_AT_type        : <0x4ca>	
    <51e>   DW_AT_data_member_location: 32	
 <2><51f>: Abbrev Number: 9 (DW_TAG_member)
    <520>   DW_AT_name        : (indirect string, offset: 0x4a8): _IO_write_ptr	
    <524>   DW_AT_decl_file   : 4	
    <525>   DW_AT_decl_line   : 256	
    <527>   DW_AT_type        : <0x4ca>	
    <52b>   DW_AT_data_member_location: 40	
 <2><52c>: Abbrev Number: 9 (DW_TAG_member)
    <52d>   DW_AT_name        : (indirect string, offset: 0x313): _IO_write_end	
    <531>   DW_AT_decl_file   : 4	
    <532>   DW_AT_decl_line   : 257	
    <534>   DW_AT_type        : <0x4ca>	
    <538>   DW_AT_data_member_location: 48	
 <2><539>: Abbrev Number: 9 (DW_TAG_member)
    <53a>   DW_AT_name        : (indirect string, offset: 0x4ec): _IO_buf_base	
    <53e>   DW_AT_decl_file   : 4	
    <53f>   DW_AT_decl_line   : 258	
    <541>   DW_AT_type        : <0x4ca>	
    <545>   DW_AT_data_member_location: 56	
 <2><546>: Abbrev Number: 9 (DW_TAG_member)
    <547>   DW_AT_name        : (indirect string, offset: 0x2f5): _IO_buf_end	
    <54b>   DW_AT_decl_file   : 4	
    <54c>   DW_AT_decl_line   : 259	
    <54e>   DW_AT_type        : <0x4ca>	
    <552>   DW_AT_data_member_location: 64	
 <2><553>: Abbrev Number: 9 (DW_TAG_member)
    <554>   DW_AT_name        : (indirect string, offset: 0x3e9): _IO_save_base	
    <558>   DW_AT_decl_file   : 4	
    <559>   DW_AT_decl_line   : 261	
    <55b>   DW_AT_type        : <0x4ca>	
    <55f>   DW_AT_data_member_location: 72	
 <2><560>: Abbrev Number: 9 (DW_TAG_member)
    <561>   DW_AT_name        : (indirect string, offset: 0x367): _IO_backup_base	
    <565>   DW_AT_decl_file   : 4	
    <566>   DW_AT_decl_line   : 262	
    <568>   DW_AT_type        : <0x4ca>	
    <56c>   DW_AT_data_member_location: 80	
 <2><56d>: Abbrev Number: 9 (DW_TAG_member)
    <56e>   DW_AT_name        : (indirect string, offset: 0x34c): _IO_save_end	
    <572>   DW_AT_decl_file   : 4	
    <573>   DW_AT_decl_line   : 263	
    <575>   DW_AT_type        : <0x4ca>	
    <579>   DW_AT_data_member_location: 88	
 <2><57a>: Abbrev Number: 9 (DW_TAG_member)
    <57b>   DW_AT_name        : (indirect string, offset: 0x332): _markers	
    <57f>   DW_AT_decl_file   : 4	
    <580>   DW_AT_decl_line   : 265	
    <582>   DW_AT_type        : <0x690>	
    <586>   DW_AT_data_member_location: 96	
 <2><587>: Abbrev Number: 9 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x4be): _chain	
    <58c>   DW_AT_decl_file   : 4	
    <58d>   DW_AT_decl_line   : 267	
    <58f>   DW_AT_type        : <0x696>	
    <593>   DW_AT_data_member_location: 104	
 <2><594>: Abbrev Number: 9 (DW_TAG_member)
    <595>   DW_AT_name        : (indirect string, offset: 0x377): _fileno	
    <599>   DW_AT_decl_file   : 4	
    <59a>   DW_AT_decl_line   : 269	
    <59c>   DW_AT_type        : <0x49d>	
    <5a0>   DW_AT_data_member_location: 112	
 <2><5a1>: Abbrev Number: 9 (DW_TAG_member)
    <5a2>   DW_AT_name        : (indirect string, offset: 0x4c5): _flags2	
    <5a6>   DW_AT_decl_file   : 4	
    <5a7>   DW_AT_decl_line   : 273	
    <5a9>   DW_AT_type        : <0x49d>	
    <5ad>   DW_AT_data_member_location: 116	
 <2><5ae>: Abbrev Number: 9 (DW_TAG_member)
    <5af>   DW_AT_name        : (indirect string, offset: 0x47f): _old_offset	
    <5b3>   DW_AT_decl_file   : 4	
    <5b4>   DW_AT_decl_line   : 275	
    <5b6>   DW_AT_type        : <0x4ab>	
    <5ba>   DW_AT_data_member_location: 120	
 <2><5bb>: Abbrev Number: 9 (DW_TAG_member)
    <5bc>   DW_AT_name        : (indirect string, offset: 0x4cd): _cur_column	
    <5c0>   DW_AT_decl_file   : 4	
    <5c1>   DW_AT_decl_line   : 279	
    <5c3>   DW_AT_type        : <0x481>	
    <5c7>   DW_AT_data_member_location: 128	
 <2><5c8>: Abbrev Number: 9 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x458): _vtable_offset	
    <5cd>   DW_AT_decl_file   : 4	
    <5ce>   DW_AT_decl_line   : 280	
    <5d0>   DW_AT_type        : <0x48f>	
    <5d4>   DW_AT_data_member_location: 130	
 <2><5d5>: Abbrev Number: 9 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0x2d9): _shortbuf	
    <5da>   DW_AT_decl_file   : 4	
    <5db>   DW_AT_decl_line   : 281	
    <5dd>   DW_AT_type        : <0x69c>	
    <5e1>   DW_AT_data_member_location: 131	
 <2><5e2>: Abbrev Number: 9 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x479): _lock	
    <5e7>   DW_AT_decl_file   : 4	
    <5e8>   DW_AT_decl_line   : 285	
    <5ea>   DW_AT_type        : <0x6ac>	
    <5ee>   DW_AT_data_member_location: 136	
 <2><5ef>: Abbrev Number: 9 (DW_TAG_member)
    <5f0>   DW_AT_name        : (indirect string, offset: 0x483): _offset	
    <5f4>   DW_AT_decl_file   : 4	
    <5f5>   DW_AT_decl_line   : 294	
    <5f7>   DW_AT_type        : <0x4b6>	
    <5fb>   DW_AT_data_member_location: 144	
 <2><5fc>: Abbrev Number: 9 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x435): __pad1	
    <601>   DW_AT_decl_file   : 4	
    <602>   DW_AT_decl_line   : 303	
    <604>   DW_AT_type        : <0x4c8>	
    <608>   DW_AT_data_member_location: 152	
 <2><609>: Abbrev Number: 9 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0x43c): __pad2	
    <60e>   DW_AT_decl_file   : 4	
    <60f>   DW_AT_decl_line   : 304	
    <611>   DW_AT_type        : <0x4c8>	
    <615>   DW_AT_data_member_location: 160	
 <2><616>: Abbrev Number: 9 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0x443): __pad3	
    <61b>   DW_AT_decl_file   : 4	
    <61c>   DW_AT_decl_line   : 305	
    <61e>   DW_AT_type        : <0x4c8>	
    <622>   DW_AT_data_member_location: 168	
 <2><623>: Abbrev Number: 9 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x44a): __pad4	
    <628>   DW_AT_decl_file   : 4	
    <629>   DW_AT_decl_line   : 306	
    <62b>   DW_AT_type        : <0x4c8>	
    <62f>   DW_AT_data_member_location: 176	
 <2><630>: Abbrev Number: 9 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x451): __pad5	
    <635>   DW_AT_decl_file   : 4	
    <636>   DW_AT_decl_line   : 307	
    <638>   DW_AT_type        : <0x468>	
    <63c>   DW_AT_data_member_location: 184	
 <2><63d>: Abbrev Number: 9 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0x3a3): _mode	
    <642>   DW_AT_decl_file   : 4	
    <643>   DW_AT_decl_line   : 309	
    <645>   DW_AT_type        : <0x49d>	
    <649>   DW_AT_data_member_location: 192	
 <2><64a>: Abbrev Number: 9 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0x4e3): _unused2	
    <64f>   DW_AT_decl_file   : 4	
    <650>   DW_AT_decl_line   : 311	
    <652>   DW_AT_type        : <0x6b2>	
    <656>   DW_AT_data_member_location: 196	
 <2><657>: Abbrev Number: 0
 <1><658>: Abbrev Number: 10 (DW_TAG_typedef)
    <659>   DW_AT_name        : (indirect string, offset: 0x2e3): _IO_lock_t	
    <65d>   DW_AT_decl_file   : 4	
    <65e>   DW_AT_decl_line   : 155	
 <1><65f>: Abbrev Number: 7 (DW_TAG_structure_type)
    <660>   DW_AT_name        : (indirect string, offset: 0x3a9): _IO_marker	
    <664>   DW_AT_byte_size   : 24	
    <665>   DW_AT_decl_file   : 4	
    <666>   DW_AT_decl_line   : 161	
    <667>   DW_AT_sibling     : <0x690>	
 <2><66b>: Abbrev Number: 8 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x38d): _next	
    <670>   DW_AT_decl_file   : 4	
    <671>   DW_AT_decl_line   : 162	
    <672>   DW_AT_type        : <0x690>	
    <676>   DW_AT_data_member_location: 0	
 <2><677>: Abbrev Number: 8 (DW_TAG_member)
    <678>   DW_AT_name        : (indirect string, offset: 0x4a2): _sbuf	
    <67c>   DW_AT_decl_file   : 4	
    <67d>   DW_AT_decl_line   : 163	
    <67e>   DW_AT_type        : <0x696>	
    <682>   DW_AT_data_member_location: 8	
 <2><683>: Abbrev Number: 8 (DW_TAG_member)
    <684>   DW_AT_name        : (indirect string, offset: 0x7cd): _pos	
    <688>   DW_AT_decl_file   : 4	
    <689>   DW_AT_decl_line   : 167	
    <68a>   DW_AT_type        : <0x49d>	
    <68e>   DW_AT_data_member_location: 16	
 <2><68f>: Abbrev Number: 0
 <1><690>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <691>   DW_AT_byte_size   : 8	
    <692>   DW_AT_type        : <0x65f>	
 <1><696>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <697>   DW_AT_byte_size   : 8	
    <698>   DW_AT_type        : <0x4d7>	
 <1><69c>: Abbrev Number: 11 (DW_TAG_array_type)
    <69d>   DW_AT_type        : <0x4d0>	
    <6a1>   DW_AT_sibling     : <0x6ac>	
 <2><6a5>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <6a6>   DW_AT_type        : <0x4c1>	
    <6aa>   DW_AT_upper_bound : 0	
 <2><6ab>: Abbrev Number: 0
 <1><6ac>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <6ad>   DW_AT_byte_size   : 8	
    <6ae>   DW_AT_type        : <0x658>	
 <1><6b2>: Abbrev Number: 11 (DW_TAG_array_type)
    <6b3>   DW_AT_type        : <0x4d0>	
    <6b7>   DW_AT_sibling     : <0x6c2>	
 <2><6bb>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <6bc>   DW_AT_type        : <0x4c1>	
    <6c0>   DW_AT_upper_bound : 19	
 <2><6c1>: Abbrev Number: 0
 <1><6c2>: Abbrev Number: 3 (DW_TAG_base_type)
    <6c3>   DW_AT_byte_size   : 4	
    <6c4>   DW_AT_encoding    : 4	(float)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x9d): float	
 <1><6c9>: Abbrev Number: 3 (DW_TAG_base_type)
    <6ca>   DW_AT_byte_size   : 8	
    <6cb>   DW_AT_encoding    : 4	(float)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x24c): double	
 <1><6d0>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d1>   DW_AT_byte_size   : 8	
    <6d2>   DW_AT_encoding    : 5	(signed)
    <6d3>   DW_AT_name        : (indirect string, offset: 0xb1): long long int	
 <1><6d7>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d8>   DW_AT_byte_size   : 8	
    <6d9>   DW_AT_encoding    : 7	(unsigned)
    <6da>   DW_AT_name        : (indirect string, offset: 0x16c): long long unsigned int	
 <1><6de>: Abbrev Number: 2 (DW_TAG_typedef)
    <6df>   DW_AT_name        : (indirect string, offset: 0x263): flow_t	
    <6e3>   DW_AT_decl_file   : 5	
    <6e4>   DW_AT_decl_line   : 68	
    <6e5>   DW_AT_type        : <0x4a4>	
 <1><6e9>: Abbrev Number: 2 (DW_TAG_typedef)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x96): cost_t	
    <6ee>   DW_AT_decl_file   : 5	
    <6ef>   DW_AT_decl_line   : 69	
    <6f0>   DW_AT_type        : <0x4a4>	
 <1><6f4>: Abbrev Number: 2 (DW_TAG_typedef)
    <6f5>   DW_AT_name        : (indirect string, offset: 0x3c9): node_t	
    <6f9>   DW_AT_decl_file   : 5	
    <6fa>   DW_AT_decl_line   : 99	
    <6fb>   DW_AT_type        : <0x6ff>	
 <1><6ff>: Abbrev Number: 7 (DW_TAG_structure_type)
    <700>   DW_AT_name        : (indirect string, offset: 0xda): node	
    <704>   DW_AT_byte_size   : 104	
    <705>   DW_AT_decl_file   : 5	
    <706>   DW_AT_decl_line   : 107	
    <707>   DW_AT_sibling     : <0x7b4>	
 <2><70b>: Abbrev Number: 8 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0x5b0): potential	
    <710>   DW_AT_decl_file   : 5	
    <711>   DW_AT_decl_line   : 109	
    <712>   DW_AT_type        : <0x6e9>	
    <716>   DW_AT_data_member_location: 0	
 <2><717>: Abbrev Number: 8 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0x669): orientation	
    <71c>   DW_AT_decl_file   : 5	
    <71d>   DW_AT_decl_line   : 110	
    <71e>   DW_AT_type        : <0x49d>	
    <722>   DW_AT_data_member_location: 8	
 <2><723>: Abbrev Number: 8 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0x3b): child	
    <728>   DW_AT_decl_file   : 5	
    <729>   DW_AT_decl_line   : 111	
    <72a>   DW_AT_type        : <0x7b4>	
    <72e>   DW_AT_data_member_location: 16	
 <2><72f>: Abbrev Number: 8 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0x6a5): pred	
    <734>   DW_AT_decl_file   : 5	
    <735>   DW_AT_decl_line   : 112	
    <736>   DW_AT_type        : <0x7b4>	
    <73a>   DW_AT_data_member_location: 24	
 <2><73b>: Abbrev Number: 8 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0x62): sibling	
    <740>   DW_AT_decl_file   : 5	
    <741>   DW_AT_decl_line   : 113	
    <742>   DW_AT_type        : <0x7b4>	
    <746>   DW_AT_data_member_location: 32	
 <2><747>: Abbrev Number: 8 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0xe7): sibling_prev	
    <74c>   DW_AT_decl_file   : 5	
    <74d>   DW_AT_decl_line   : 114	
    <74e>   DW_AT_type        : <0x7b4>	
    <752>   DW_AT_data_member_location: 40	
 <2><753>: Abbrev Number: 8 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x6c8): basic_arc	
    <758>   DW_AT_decl_file   : 5	
    <759>   DW_AT_decl_line   : 115	
    <75a>   DW_AT_type        : <0x83d>	
    <75e>   DW_AT_data_member_location: 48	
 <2><75f>: Abbrev Number: 8 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0x59): firstout	
    <764>   DW_AT_decl_file   : 5	
    <765>   DW_AT_decl_line   : 116	
    <766>   DW_AT_type        : <0x83d>	
    <76a>   DW_AT_data_member_location: 56	
 <2><76b>: Abbrev Number: 8 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0xdf): firstin	
    <770>   DW_AT_decl_file   : 5	
    <771>   DW_AT_decl_line   : 116	
    <772>   DW_AT_type        : <0x83d>	
    <776>   DW_AT_data_member_location: 64	
 <2><777>: Abbrev Number: 8 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0xa9): arc_tmp	
    <77c>   DW_AT_decl_file   : 5	
    <77d>   DW_AT_decl_line   : 117	
    <77e>   DW_AT_type        : <0x83d>	
    <782>   DW_AT_data_member_location: 72	
 <2><783>: Abbrev Number: 8 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x767): flow	
    <788>   DW_AT_decl_file   : 5	
    <789>   DW_AT_decl_line   : 118	
    <78a>   DW_AT_type        : <0x6de>	
    <78e>   DW_AT_data_member_location: 80	
 <2><78f>: Abbrev Number: 8 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0x6f2): depth	
    <794>   DW_AT_decl_file   : 5	
    <795>   DW_AT_decl_line   : 119	
    <796>   DW_AT_type        : <0x4a4>	
    <79a>   DW_AT_data_member_location: 88	
 <2><79b>: Abbrev Number: 8 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x2b4): number	
    <7a0>   DW_AT_decl_file   : 5	
    <7a1>   DW_AT_decl_line   : 120	
    <7a2>   DW_AT_type        : <0x49d>	
    <7a6>   DW_AT_data_member_location: 96	
 <2><7a7>: Abbrev Number: 8 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x1f4): time	
    <7ac>   DW_AT_decl_file   : 5	
    <7ad>   DW_AT_decl_line   : 121	
    <7ae>   DW_AT_type        : <0x49d>	
    <7b2>   DW_AT_data_member_location: 100	
 <2><7b3>: Abbrev Number: 0
 <1><7b4>: Abbrev Number: 2 (DW_TAG_typedef)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x1e3): node_p	
    <7b9>   DW_AT_decl_file   : 5	
    <7ba>   DW_AT_decl_line   : 100	
    <7bb>   DW_AT_type        : <0x7bf>	
 <1><7bf>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <7c0>   DW_AT_byte_size   : 8	
    <7c1>   DW_AT_type        : <0x6ff>	
 <1><7c5>: Abbrev Number: 2 (DW_TAG_typedef)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x3fd): arc_t	
    <7ca>   DW_AT_decl_file   : 5	
    <7cb>   DW_AT_decl_line   : 102	
    <7cc>   DW_AT_type        : <0x7d0>	
 <1><7d0>: Abbrev Number: 13 (DW_TAG_structure_type)
    <7d1>   DW_AT_name        : arc	
    <7d5>   DW_AT_byte_size   : 64	
    <7d6>   DW_AT_decl_file   : 5	
    <7d7>   DW_AT_decl_line   : 126	
    <7d8>   DW_AT_sibling     : <0x83d>	
 <2><7dc>: Abbrev Number: 8 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x5ef): cost	
    <7e1>   DW_AT_decl_file   : 5	
    <7e2>   DW_AT_decl_line   : 128	
    <7e3>   DW_AT_type        : <0x6e9>	
    <7e7>   DW_AT_data_member_location: 0	
 <2><7e8>: Abbrev Number: 8 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x1ea): tail	
    <7ed>   DW_AT_decl_file   : 5	
    <7ee>   DW_AT_decl_line   : 129	
    <7ef>   DW_AT_type        : <0x7b4>	
    <7f3>   DW_AT_data_member_location: 8	
 <2><7f4>: Abbrev Number: 8 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x88): head	
    <7f9>   DW_AT_decl_file   : 5	
    <7fa>   DW_AT_decl_line   : 129	
    <7fb>   DW_AT_type        : <0x7b4>	
    <7ff>   DW_AT_data_member_location: 16	
 <2><800>: Abbrev Number: 8 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0x2ae): ident	
    <805>   DW_AT_decl_file   : 5	
    <806>   DW_AT_decl_line   : 130	
    <807>   DW_AT_type        : <0x49d>	
    <80b>   DW_AT_data_member_location: 24	
 <2><80c>: Abbrev Number: 8 (DW_TAG_member)
    <80d>   DW_AT_name        : (indirect string, offset: 0x2d1): nextout	
    <811>   DW_AT_decl_file   : 5	
    <812>   DW_AT_decl_line   : 131	
    <813>   DW_AT_type        : <0x83d>	
    <817>   DW_AT_data_member_location: 32	
 <2><818>: Abbrev Number: 8 (DW_TAG_member)
    <819>   DW_AT_name        : (indirect string, offset: 0x52): nextin	
    <81d>   DW_AT_decl_file   : 5	
    <81e>   DW_AT_decl_line   : 131	
    <81f>   DW_AT_type        : <0x83d>	
    <823>   DW_AT_data_member_location: 40	
 <2><824>: Abbrev Number: 8 (DW_TAG_member)
    <825>   DW_AT_name        : (indirect string, offset: 0x767): flow	
    <829>   DW_AT_decl_file   : 5	
    <82a>   DW_AT_decl_line   : 132	
    <82b>   DW_AT_type        : <0x6de>	
    <82f>   DW_AT_data_member_location: 48	
 <2><830>: Abbrev Number: 8 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0x499): org_cost	
    <835>   DW_AT_decl_file   : 5	
    <836>   DW_AT_decl_line   : 133	
    <837>   DW_AT_type        : <0x6e9>	
    <83b>   DW_AT_data_member_location: 56	
 <2><83c>: Abbrev Number: 0
 <1><83d>: Abbrev Number: 2 (DW_TAG_typedef)
    <83e>   DW_AT_name        : (indirect string, offset: 0x2bb): arc_p	
    <842>   DW_AT_decl_file   : 5	
    <843>   DW_AT_decl_line   : 103	
    <844>   DW_AT_type        : <0x848>	
 <1><848>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <849>   DW_AT_byte_size   : 8	
    <84a>   DW_AT_type        : <0x7d0>	
 <1><84e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <84f>   DW_AT_name        : (indirect string, offset: 0x183): network	
    <853>   DW_AT_byte_size   : 624	
    <855>   DW_AT_decl_file   : 5	
    <856>   DW_AT_decl_line   : 138	
    <857>   DW_AT_sibling     : <0x9dc>	
 <2><85b>: Abbrev Number: 8 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0x295): inputfile	
    <860>   DW_AT_decl_file   : 5	
    <861>   DW_AT_decl_line   : 140	
    <862>   DW_AT_type        : <0x9dc>	
    <866>   DW_AT_data_member_location: 0	
 <2><867>: Abbrev Number: 8 (DW_TAG_member)
    <868>   DW_AT_name        : (indirect string, offset: 0x238): clustfile	
    <86c>   DW_AT_decl_file   : 5	
    <86d>   DW_AT_decl_line   : 141	
    <86e>   DW_AT_type        : <0x9dc>	
    <872>   DW_AT_data_member_location: 200	
 <2><873>: Abbrev Number: 15 (DW_TAG_member)
    <874>   DW_AT_name        : n	
    <876>   DW_AT_decl_file   : 5	
    <877>   DW_AT_decl_line   : 142	
    <878>   DW_AT_type        : <0x4a4>	
    <87c>   DW_AT_data_member_location: 400	
 <2><87e>: Abbrev Number: 16 (DW_TAG_member)
    <87f>   DW_AT_name        : (indirect string, offset: 0xf4): n_trips	
    <883>   DW_AT_decl_file   : 5	
    <884>   DW_AT_decl_line   : 142	
    <885>   DW_AT_type        : <0x4a4>	
    <889>   DW_AT_data_member_location: 408	
 <2><88b>: Abbrev Number: 16 (DW_TAG_member)
    <88c>   DW_AT_name        : (indirect string, offset: 0xa3): max_m	
    <890>   DW_AT_decl_file   : 5	
    <891>   DW_AT_decl_line   : 143	
    <892>   DW_AT_type        : <0x4a4>	
    <896>   DW_AT_data_member_location: 416	
 <2><898>: Abbrev Number: 15 (DW_TAG_member)
    <899>   DW_AT_name        : m	
    <89b>   DW_AT_decl_file   : 5	
    <89c>   DW_AT_decl_line   : 143	
    <89d>   DW_AT_type        : <0x4a4>	
    <8a1>   DW_AT_data_member_location: 424	
 <2><8a3>: Abbrev Number: 16 (DW_TAG_member)
    <8a4>   DW_AT_name        : (indirect string, offset: 0x2a8): m_org	
    <8a8>   DW_AT_decl_file   : 5	
    <8a9>   DW_AT_decl_line   : 143	
    <8aa>   DW_AT_type        : <0x4a4>	
    <8ae>   DW_AT_data_member_location: 432	
 <2><8b0>: Abbrev Number: 16 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xbf): m_impl	
    <8b5>   DW_AT_decl_file   : 5	
    <8b6>   DW_AT_decl_line   : 143	
    <8b7>   DW_AT_type        : <0x4a4>	
    <8bb>   DW_AT_data_member_location: 440	
 <2><8bd>: Abbrev Number: 16 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0x6a): max_residual_new_m	
    <8c2>   DW_AT_decl_file   : 5	
    <8c3>   DW_AT_decl_line   : 144	
    <8c4>   DW_AT_type        : <0x4a4>	
    <8c8>   DW_AT_data_member_location: 448	
 <2><8ca>: Abbrev Number: 16 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x1f9): max_new_m	
    <8cf>   DW_AT_decl_file   : 5	
    <8d0>   DW_AT_decl_line   : 144	
    <8d1>   DW_AT_type        : <0x4a4>	
    <8d5>   DW_AT_data_member_location: 456	
 <2><8d7>: Abbrev Number: 16 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x26a): primal_unbounded	
    <8dc>   DW_AT_decl_file   : 5	
    <8dd>   DW_AT_decl_line   : 146	
    <8de>   DW_AT_type        : <0x4a4>	
    <8e2>   DW_AT_data_member_location: 464	
 <2><8e4>: Abbrev Number: 16 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xb): dual_unbounded	
    <8e9>   DW_AT_decl_file   : 5	
    <8ea>   DW_AT_decl_line   : 147	
    <8eb>   DW_AT_type        : <0x4a4>	
    <8ef>   DW_AT_data_member_location: 472	
 <2><8f1>: Abbrev Number: 16 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x10a): perturbed	
    <8f6>   DW_AT_decl_file   : 5	
    <8f7>   DW_AT_decl_line   : 148	
    <8f8>   DW_AT_type        : <0x4a4>	
    <8fc>   DW_AT_data_member_location: 480	
 <2><8fe>: Abbrev Number: 16 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x39a): feasible	
    <903>   DW_AT_decl_file   : 5	
    <904>   DW_AT_decl_line   : 149	
    <905>   DW_AT_type        : <0x4a4>	
    <909>   DW_AT_data_member_location: 488	
 <2><90b>: Abbrev Number: 15 (DW_TAG_member)
    <90c>   DW_AT_name        : eps	
    <910>   DW_AT_decl_file   : 5	
    <911>   DW_AT_decl_line   : 150	
    <912>   DW_AT_type        : <0x4a4>	
    <916>   DW_AT_data_member_location: 496	
 <2><918>: Abbrev Number: 16 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0xd2): opt_tol	
    <91d>   DW_AT_decl_file   : 5	
    <91e>   DW_AT_decl_line   : 151	
    <91f>   DW_AT_type        : <0x4a4>	
    <923>   DW_AT_data_member_location: 504	
 <2><925>: Abbrev Number: 16 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x226): feas_tol	
    <92a>   DW_AT_decl_file   : 5	
    <92b>   DW_AT_decl_line   : 152	
    <92c>   DW_AT_type        : <0x4a4>	
    <930>   DW_AT_data_member_location: 512	
 <2><932>: Abbrev Number: 16 (DW_TAG_member)
    <933>   DW_AT_name        : (indirect string, offset: 0x22f): pert_val	
    <937>   DW_AT_decl_file   : 5	
    <938>   DW_AT_decl_line   : 153	
    <939>   DW_AT_type        : <0x4a4>	
    <93d>   DW_AT_data_member_location: 520	
 <2><93f>: Abbrev Number: 16 (DW_TAG_member)
    <940>   DW_AT_name        : (indirect string, offset: 0x25): bigM	
    <944>   DW_AT_decl_file   : 5	
    <945>   DW_AT_decl_line   : 154	
    <946>   DW_AT_type        : <0x4a4>	
    <94a>   DW_AT_data_member_location: 528	
 <2><94c>: Abbrev Number: 16 (DW_TAG_member)
    <94d>   DW_AT_name        : (indirect string, offset: 0x4a): optcost	
    <951>   DW_AT_decl_file   : 5	
    <952>   DW_AT_decl_line   : 155	
    <953>   DW_AT_type        : <0x6c9>	
    <957>   DW_AT_data_member_location: 536	
 <2><959>: Abbrev Number: 16 (DW_TAG_member)
    <95a>   DW_AT_name        : (indirect string, offset: 0xc6): ignore_impl	
    <95e>   DW_AT_decl_file   : 5	
    <95f>   DW_AT_decl_line   : 156	
    <960>   DW_AT_type        : <0x6e9>	
    <964>   DW_AT_data_member_location: 544	
 <2><966>: Abbrev Number: 16 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x1f): nodes	
    <96b>   DW_AT_decl_file   : 5	
    <96c>   DW_AT_decl_line   : 157	
    <96d>   DW_AT_type        : <0x7b4>	
    <971>   DW_AT_data_member_location: 552	
 <2><973>: Abbrev Number: 16 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x1a): stop_nodes	
    <978>   DW_AT_decl_file   : 5	
    <979>   DW_AT_decl_line   : 157	
    <97a>   DW_AT_type        : <0x7b4>	
    <97e>   DW_AT_data_member_location: 560	
 <2><980>: Abbrev Number: 16 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0x247): arcs	
    <985>   DW_AT_decl_file   : 5	
    <986>   DW_AT_decl_line   : 158	
    <987>   DW_AT_type        : <0x83d>	
    <98b>   DW_AT_data_member_location: 568	
 <2><98d>: Abbrev Number: 16 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0x242): stop_arcs	
    <992>   DW_AT_decl_file   : 5	
    <993>   DW_AT_decl_line   : 158	
    <994>   DW_AT_type        : <0x83d>	
    <998>   DW_AT_data_member_location: 576	
 <2><99a>: Abbrev Number: 16 (DW_TAG_member)
    <99b>   DW_AT_name        : (indirect string, offset: 0x0): dummy_arcs	
    <99f>   DW_AT_decl_file   : 5	
    <9a0>   DW_AT_decl_line   : 159	
    <9a1>   DW_AT_type        : <0x83d>	
    <9a5>   DW_AT_data_member_location: 584	
 <2><9a7>: Abbrev Number: 16 (DW_TAG_member)
    <9a8>   DW_AT_name        : (indirect string, offset: 0x7d): stop_dummy	
    <9ac>   DW_AT_decl_file   : 5	
    <9ad>   DW_AT_decl_line   : 159	
    <9ae>   DW_AT_type        : <0x83d>	
    <9b2>   DW_AT_data_member_location: 592	
 <2><9b4>: Abbrev Number: 16 (DW_TAG_member)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x27b): iterations	
    <9b9>   DW_AT_decl_file   : 5	
    <9ba>   DW_AT_decl_line   : 160	
    <9bb>   DW_AT_type        : <0x4a4>	
    <9bf>   DW_AT_data_member_location: 600	
 <2><9c1>: Abbrev Number: 16 (DW_TAG_member)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x2c1): bound_exchanges	
    <9c6>   DW_AT_decl_file   : 5	
    <9c7>   DW_AT_decl_line   : 161	
    <9c8>   DW_AT_type        : <0x4a4>	
    <9cc>   DW_AT_data_member_location: 608	
 <2><9ce>: Abbrev Number: 16 (DW_TAG_member)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x8d): checksum	
    <9d3>   DW_AT_decl_file   : 5	
    <9d4>   DW_AT_decl_line   : 162	
    <9d5>   DW_AT_type        : <0x4a4>	
    <9d9>   DW_AT_data_member_location: 616	
 <2><9db>: Abbrev Number: 0
 <1><9dc>: Abbrev Number: 11 (DW_TAG_array_type)
    <9dd>   DW_AT_type        : <0x4d0>	
    <9e1>   DW_AT_sibling     : <0x9ec>	
 <2><9e5>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <9e6>   DW_AT_type        : <0x4c1>	
    <9ea>   DW_AT_upper_bound : 199	
 <2><9eb>: Abbrev Number: 0
 <1><9ec>: Abbrev Number: 2 (DW_TAG_typedef)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x259): network_t	
    <9f1>   DW_AT_decl_file   : 5	
    <9f2>   DW_AT_decl_line   : 163	
    <9f3>   DW_AT_type        : <0x84e>	
 <1><9f7>: Abbrev Number: 17 (DW_TAG_subprogram)
    <9f8>   DW_AT_external    : 1	
    <9f8>   DW_AT_name        : (indirect string, offset: 0x403): refresh_neighbour_lists	
    <9fc>   DW_AT_decl_file   : 1	
    <9fd>   DW_AT_decl_line   : 28	
    <9fe>   DW_AT_prototyped  : 1	
    <9fe>   DW_AT_low_pc      : 0x401371	
    <a06>   DW_AT_high_pc     : 0xc9	
    <a0e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a10>   DW_AT_GNU_all_call_sites: 1	
    <a10>   DW_AT_sibling     : <0xa4d>	
 <2><a14>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <a15>   DW_AT_name        : net	
    <a19>   DW_AT_decl_file   : 1	
    <a1a>   DW_AT_decl_line   : 28	
    <a1b>   DW_AT_type        : <0xa4d>	
    <a1f>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><a22>: Abbrev Number: 19 (DW_TAG_variable)
    <a23>   DW_AT_name        : (indirect string, offset: 0xda): node	
    <a27>   DW_AT_decl_file   : 1	
    <a28>   DW_AT_decl_line   : 34	
    <a29>   DW_AT_type        : <0xa53>	
    <a2d>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><a30>: Abbrev Number: 20 (DW_TAG_variable)
    <a31>   DW_AT_name        : arc	
    <a35>   DW_AT_decl_file   : 1	
    <a36>   DW_AT_decl_line   : 35	
    <a37>   DW_AT_type        : <0xa59>	
    <a3b>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><a3e>: Abbrev Number: 19 (DW_TAG_variable)
    <a3f>   DW_AT_name        : (indirect string, offset: 0x359): stop	
    <a43>   DW_AT_decl_file   : 1	
    <a44>   DW_AT_decl_line   : 36	
    <a45>   DW_AT_type        : <0x4c8>	
    <a49>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a4c>: Abbrev Number: 0
 <1><a4d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a4e>   DW_AT_byte_size   : 8	
    <a4f>   DW_AT_type        : <0x9ec>	
 <1><a53>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a54>   DW_AT_byte_size   : 8	
    <a55>   DW_AT_type        : <0x6f4>	
 <1><a59>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5a>   DW_AT_byte_size   : 8	
    <a5b>   DW_AT_type        : <0x7c5>	
 <1><a5f>: Abbrev Number: 21 (DW_TAG_subprogram)
    <a60>   DW_AT_external    : 1	
    <a60>   DW_AT_name        : (indirect string, offset: 0x301): refresh_potential	
    <a64>   DW_AT_decl_file   : 1	
    <a65>   DW_AT_decl_line   : 68	
    <a66>   DW_AT_prototyped  : 1	
    <a66>   DW_AT_type        : <0x4a4>	
    <a6a>   DW_AT_low_pc      : 0x40143a	
    <a72>   DW_AT_high_pc     : 0x107	
    <a7a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a7c>   DW_AT_GNU_all_call_sites: 1	
    <a7c>   DW_AT_sibling     : <0xac7>	
 <2><a80>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <a81>   DW_AT_name        : net	
    <a85>   DW_AT_decl_file   : 1	
    <a86>   DW_AT_decl_line   : 68	
    <a87>   DW_AT_type        : <0xa4d>	
    <a8b>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><a8e>: Abbrev Number: 19 (DW_TAG_variable)
    <a8f>   DW_AT_name        : (indirect string, offset: 0xda): node	
    <a93>   DW_AT_decl_file   : 1	
    <a94>   DW_AT_decl_line   : 74	
    <a95>   DW_AT_type        : <0xa53>	
    <a99>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><a9c>: Abbrev Number: 20 (DW_TAG_variable)
    <a9d>   DW_AT_name        : tmp	
    <aa1>   DW_AT_decl_file   : 1	
    <aa2>   DW_AT_decl_line   : 74	
    <aa3>   DW_AT_type        : <0xa53>	
    <aa7>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><aaa>: Abbrev Number: 19 (DW_TAG_variable)
    <aab>   DW_AT_name        : (indirect string, offset: 0x467): root	
    <aaf>   DW_AT_decl_file   : 1	
    <ab0>   DW_AT_decl_line   : 75	
    <ab1>   DW_AT_type        : <0xa53>	
    <ab5>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><ab8>: Abbrev Number: 19 (DW_TAG_variable)
    <ab9>   DW_AT_name        : (indirect string, offset: 0x8d): checksum	
    <abd>   DW_AT_decl_file   : 1	
    <abe>   DW_AT_decl_line   : 76	
    <abf>   DW_AT_type        : <0x4a4>	
    <ac3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><ac6>: Abbrev Number: 0
 <1><ac7>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ac8>   DW_AT_external    : 1	
    <ac8>   DW_AT_name        : (indirect string, offset: 0x3d0): flow_cost	
    <acc>   DW_AT_decl_file   : 1	
    <acd>   DW_AT_decl_line   : 122	
    <ace>   DW_AT_prototyped  : 1	
    <ace>   DW_AT_type        : <0x6c9>	
    <ad2>   DW_AT_low_pc      : 0x401541	
    <ada>   DW_AT_high_pc     : 0x184	
    <ae2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ae4>   DW_AT_GNU_all_call_sites: 1	
    <ae4>   DW_AT_sibling     : <0xb3e>	
 <2><ae8>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <ae9>   DW_AT_name        : net	
    <aed>   DW_AT_decl_file   : 1	
    <aee>   DW_AT_decl_line   : 122	
    <aef>   DW_AT_type        : <0xa4d>	
    <af3>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><af7>: Abbrev Number: 20 (DW_TAG_variable)
    <af8>   DW_AT_name        : arc	
    <afc>   DW_AT_decl_file   : 1	
    <afd>   DW_AT_decl_line   : 128	
    <afe>   DW_AT_type        : <0xa59>	
    <b02>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><b05>: Abbrev Number: 19 (DW_TAG_variable)
    <b06>   DW_AT_name        : (indirect string, offset: 0xda): node	
    <b0a>   DW_AT_decl_file   : 1	
    <b0b>   DW_AT_decl_line   : 129	
    <b0c>   DW_AT_type        : <0xa53>	
    <b10>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><b13>: Abbrev Number: 19 (DW_TAG_variable)
    <b14>   DW_AT_name        : (indirect string, offset: 0x359): stop	
    <b18>   DW_AT_decl_file   : 1	
    <b19>   DW_AT_decl_line   : 130	
    <b1a>   DW_AT_type        : <0x4c8>	
    <b1e>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><b21>: Abbrev Number: 19 (DW_TAG_variable)
    <b22>   DW_AT_name        : (indirect string, offset: 0x3f7): fleet	
    <b26>   DW_AT_decl_file   : 1	
    <b27>   DW_AT_decl_line   : 132	
    <b28>   DW_AT_type        : <0x4a4>	
    <b2c>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><b2f>: Abbrev Number: 19 (DW_TAG_variable)
    <b30>   DW_AT_name        : (indirect string, offset: 0x33b): operational_cost	
    <b34>   DW_AT_decl_file   : 1	
    <b35>   DW_AT_decl_line   : 133	
    <b36>   DW_AT_type        : <0x6e9>	
    <b3a>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><b3d>: Abbrev Number: 0
 <1><b3e>: Abbrev Number: 21 (DW_TAG_subprogram)
    <b3f>   DW_AT_external    : 1	
    <b3f>   DW_AT_name        : (indirect string, offset: 0x494): flow_org_cost	
    <b43>   DW_AT_decl_file   : 1	
    <b44>   DW_AT_decl_line   : 181	
    <b45>   DW_AT_prototyped  : 1	
    <b45>   DW_AT_type        : <0x6c9>	
    <b49>   DW_AT_low_pc      : 0x4016c5	
    <b51>   DW_AT_high_pc     : 0x186	
    <b59>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b5b>   DW_AT_GNU_all_call_sites: 1	
    <b5b>   DW_AT_sibling     : <0xbb5>	
 <2><b5f>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <b60>   DW_AT_name        : net	
    <b64>   DW_AT_decl_file   : 1	
    <b65>   DW_AT_decl_line   : 181	
    <b66>   DW_AT_type        : <0xa4d>	
    <b6a>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><b6e>: Abbrev Number: 20 (DW_TAG_variable)
    <b6f>   DW_AT_name        : arc	
    <b73>   DW_AT_decl_file   : 1	
    <b74>   DW_AT_decl_line   : 187	
    <b75>   DW_AT_type        : <0xa59>	
    <b79>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><b7c>: Abbrev Number: 19 (DW_TAG_variable)
    <b7d>   DW_AT_name        : (indirect string, offset: 0xda): node	
    <b81>   DW_AT_decl_file   : 1	
    <b82>   DW_AT_decl_line   : 188	
    <b83>   DW_AT_type        : <0xa53>	
    <b87>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><b8a>: Abbrev Number: 19 (DW_TAG_variable)
    <b8b>   DW_AT_name        : (indirect string, offset: 0x359): stop	
    <b8f>   DW_AT_decl_file   : 1	
    <b90>   DW_AT_decl_line   : 189	
    <b91>   DW_AT_type        : <0x4c8>	
    <b95>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><b98>: Abbrev Number: 19 (DW_TAG_variable)
    <b99>   DW_AT_name        : (indirect string, offset: 0x3f7): fleet	
    <b9d>   DW_AT_decl_file   : 1	
    <b9e>   DW_AT_decl_line   : 191	
    <b9f>   DW_AT_type        : <0x4a4>	
    <ba3>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><ba6>: Abbrev Number: 19 (DW_TAG_variable)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x33b): operational_cost	
    <bab>   DW_AT_decl_file   : 1	
    <bac>   DW_AT_decl_line   : 192	
    <bad>   DW_AT_type        : <0x6e9>	
    <bb1>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><bb4>: Abbrev Number: 0
 <1><bb5>: Abbrev Number: 22 (DW_TAG_subprogram)
    <bb6>   DW_AT_external    : 1	
    <bb6>   DW_AT_name        : (indirect string, offset: 0x393): primal_feasible	
    <bba>   DW_AT_decl_file   : 1	
    <bbb>   DW_AT_decl_line   : 239	
    <bbc>   DW_AT_prototyped  : 1	
    <bbc>   DW_AT_type        : <0x4a4>	
    <bc0>   DW_AT_low_pc      : 0x40184b	
    <bc8>   DW_AT_high_pc     : 0x15d	
    <bd0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bd2>   DW_AT_GNU_all_tail_call_sites: 1	
    <bd2>   DW_AT_sibling     : <0xc3a>	
 <2><bd6>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <bd7>   DW_AT_name        : net	
    <bdb>   DW_AT_decl_file   : 1	
    <bdc>   DW_AT_decl_line   : 239	
    <bdd>   DW_AT_type        : <0xa4d>	
    <be1>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><be5>: Abbrev Number: 19 (DW_TAG_variable)
    <be6>   DW_AT_name        : (indirect string, offset: 0x359): stop	
    <bea>   DW_AT_decl_file   : 1	
    <beb>   DW_AT_decl_line   : 245	
    <bec>   DW_AT_type        : <0x4c8>	
    <bf0>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><bf3>: Abbrev Number: 19 (DW_TAG_variable)
    <bf4>   DW_AT_name        : (indirect string, offset: 0xda): node	
    <bf8>   DW_AT_decl_file   : 1	
    <bf9>   DW_AT_decl_line   : 246	
    <bfa>   DW_AT_type        : <0xa53>	
    <bfe>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><c01>: Abbrev Number: 19 (DW_TAG_variable)
    <c02>   DW_AT_name        : (indirect string, offset: 0x82): dummy	
    <c06>   DW_AT_decl_file   : 1	
    <c07>   DW_AT_decl_line   : 247	
    <c08>   DW_AT_type        : <0xa59>	
    <c0c>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><c0f>: Abbrev Number: 19 (DW_TAG_variable)
    <c10>   DW_AT_name        : (indirect string, offset: 0x7d): stop_dummy	
    <c14>   DW_AT_decl_file   : 1	
    <c15>   DW_AT_decl_line   : 248	
    <c16>   DW_AT_type        : <0xa59>	
    <c1a>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><c1d>: Abbrev Number: 20 (DW_TAG_variable)
    <c1e>   DW_AT_name        : arc	
    <c22>   DW_AT_decl_file   : 1	
    <c23>   DW_AT_decl_line   : 249	
    <c24>   DW_AT_type        : <0xa59>	
    <c28>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><c2b>: Abbrev Number: 19 (DW_TAG_variable)
    <c2c>   DW_AT_name        : (indirect string, offset: 0x767): flow	
    <c30>   DW_AT_decl_file   : 1	
    <c31>   DW_AT_decl_line   : 250	
    <c32>   DW_AT_type        : <0x6de>	
    <c36>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c39>: Abbrev Number: 0
 <1><c3a>: Abbrev Number: 23 (DW_TAG_subprogram)
    <c3b>   DW_AT_external    : 1	
    <c3b>   DW_AT_name        : (indirect string, offset: 0x427): dual_feasible	
    <c3f>   DW_AT_decl_file   : 1	
    <c40>   DW_AT_decl_line   : 297	
    <c42>   DW_AT_prototyped  : 1	
    <c42>   DW_AT_type        : <0x4a4>	
    <c46>   DW_AT_low_pc      : 0x4019a8	
    <c4e>   DW_AT_high_pc     : 0xf1	
    <c56>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c58>   DW_AT_GNU_all_tail_call_sites: 1	
    <c58>   DW_AT_sibling     : <0xca9>	
 <2><c5c>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c5d>   DW_AT_name        : net	
    <c61>   DW_AT_decl_file   : 1	
    <c62>   DW_AT_decl_line   : 297	
    <c64>   DW_AT_type        : <0xa4d>	
    <c68>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><c6b>: Abbrev Number: 25 (DW_TAG_variable)
    <c6c>   DW_AT_name        : arc	
    <c70>   DW_AT_decl_file   : 1	
    <c71>   DW_AT_decl_line   : 303	
    <c73>   DW_AT_type        : <0xa59>	
    <c77>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><c7a>: Abbrev Number: 26 (DW_TAG_variable)
    <c7b>   DW_AT_name        : (indirect string, offset: 0x359): stop	
    <c7f>   DW_AT_decl_file   : 1	
    <c80>   DW_AT_decl_line   : 304	
    <c82>   DW_AT_type        : <0xa59>	
    <c86>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><c89>: Abbrev Number: 26 (DW_TAG_variable)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x35e): red_cost	
    <c8e>   DW_AT_decl_file   : 1	
    <c8f>   DW_AT_decl_line   : 305	
    <c91>   DW_AT_type        : <0x6e9>	
    <c95>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c98>: Abbrev Number: 27 (DW_TAG_label)
    <c99>   DW_AT_name        : (indirect string, offset: 0x41b): DUAL_INFEAS	
    <c9d>   DW_AT_decl_file   : 1	
    <c9e>   DW_AT_decl_line   : 356	
    <ca0>   DW_AT_low_pc      : 0x401a56	
 <2><ca8>: Abbrev Number: 0
 <1><ca9>: Abbrev Number: 23 (DW_TAG_subprogram)
    <caa>   DW_AT_external    : 1	
    <caa>   DW_AT_name        : (indirect string, offset: 0x3b4): getfree	
    <cae>   DW_AT_decl_file   : 1	
    <caf>   DW_AT_decl_line   : 369	
    <cb1>   DW_AT_prototyped  : 1	
    <cb1>   DW_AT_type        : <0x4a4>	
    <cb5>   DW_AT_low_pc      : 0x401a99	
    <cbd>   DW_AT_high_pc     : 0xeb	
    <cc5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cc7>   DW_AT_GNU_all_tail_call_sites: 1	
    <cc7>   DW_AT_sibling     : <0xcdb>	
 <2><ccb>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <ccc>   DW_AT_name        : net	
    <cd0>   DW_AT_decl_file   : 1	
    <cd1>   DW_AT_decl_line   : 370	
    <cd3>   DW_AT_type        : <0xa4d>	
    <cd7>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><cda>: Abbrev Number: 0
 <1><cdb>: Abbrev Number: 28 (DW_TAG_variable)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x2ee): stderr	
    <ce0>   DW_AT_decl_file   : 6	
    <ce1>   DW_AT_decl_line   : 170	
    <ce2>   DW_AT_type        : <0x696>	
    <ce6>   DW_AT_external    : 1	
    <ce6>   DW_AT_declaration : 1	
 <1><ce6>: Abbrev Number: 0
  Compilation Unit @ offset 0xce7:
   Length:        0x68c (32-bit)
   Version:       4
   Abbrev Offset: 0x2aa
   Pointer Size:  8
 <0><cf2>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <cf3>   DW_AT_producer    : (indirect string, offset: 0x119): GNU C 4.8.1 -mtune=generic -march=x86-64 -g -fno-strict-aliasing -fstack-protector	
    <cf7>   DW_AT_language    : 1	(ANSI C)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x502): readmin.c	
    <cfc>   DW_AT_comp_dir    : (indirect string, offset: 0x18b): /home/yunqi/SPEC2006/benchspec/CPU2006/429.mcf/build/build_base_amd64-m64-gcc43-nn.0000	
    <d00>   DW_AT_low_pc      : 0x401b84	
    <d08>   DW_AT_high_pc     : 0xc4a	
    <d10>   DW_AT_stmt_list   : 0x32a	
 <1><d14>: Abbrev Number: 2 (DW_TAG_typedef)
    <d15>   DW_AT_name        : (indirect string, offset: 0x34): size_t	
    <d19>   DW_AT_decl_file   : 2	
    <d1a>   DW_AT_decl_line   : 212	
    <d1b>   DW_AT_type        : <0xd1f>	
 <1><d1f>: Abbrev Number: 3 (DW_TAG_base_type)
    <d20>   DW_AT_byte_size   : 8	
    <d21>   DW_AT_encoding    : 7	(unsigned)
    <d22>   DW_AT_name        : (indirect string, offset: 0x171): long unsigned int	
 <1><d26>: Abbrev Number: 3 (DW_TAG_base_type)
    <d27>   DW_AT_byte_size   : 1	
    <d28>   DW_AT_encoding    : 8	(unsigned char)
    <d29>   DW_AT_name        : (indirect string, offset: 0xfc): unsigned char	
 <1><d2d>: Abbrev Number: 3 (DW_TAG_base_type)
    <d2e>   DW_AT_byte_size   : 2	
    <d2f>   DW_AT_encoding    : 7	(unsigned)
    <d30>   DW_AT_name        : (indirect string, offset: 0x203): short unsigned int	
 <1><d34>: Abbrev Number: 3 (DW_TAG_base_type)
    <d35>   DW_AT_byte_size   : 4	
    <d36>   DW_AT_encoding    : 7	(unsigned)
    <d37>   DW_AT_name        : (indirect string, offset: 0x176): unsigned int	
 <1><d3b>: Abbrev Number: 3 (DW_TAG_base_type)
    <d3c>   DW_AT_byte_size   : 1	
    <d3d>   DW_AT_encoding    : 6	(signed char)
    <d3e>   DW_AT_name        : (indirect string, offset: 0xfe): signed char	
 <1><d42>: Abbrev Number: 3 (DW_TAG_base_type)
    <d43>   DW_AT_byte_size   : 2	
    <d44>   DW_AT_encoding    : 5	(signed)
    <d45>   DW_AT_name        : (indirect string, offset: 0x2a): short int	
 <1><d49>: Abbrev Number: 4 (DW_TAG_base_type)
    <d4a>   DW_AT_byte_size   : 4	
    <d4b>   DW_AT_encoding    : 5	(signed)
    <d4c>   DW_AT_name        : int	
 <1><d50>: Abbrev Number: 3 (DW_TAG_base_type)
    <d51>   DW_AT_byte_size   : 8	
    <d52>   DW_AT_encoding    : 5	(signed)
    <d53>   DW_AT_name        : (indirect string, offset: 0xb6): long int	
 <1><d57>: Abbrev Number: 2 (DW_TAG_typedef)
    <d58>   DW_AT_name        : (indirect string, offset: 0x4b6): __off_t	
    <d5c>   DW_AT_decl_file   : 3	
    <d5d>   DW_AT_decl_line   : 140	
    <d5e>   DW_AT_type        : <0xd50>	
 <1><d62>: Abbrev Number: 2 (DW_TAG_typedef)
    <d63>   DW_AT_name        : (indirect string, offset: 0x4d9): __off64_t	
    <d67>   DW_AT_decl_file   : 3	
    <d68>   DW_AT_decl_line   : 141	
    <d69>   DW_AT_type        : <0xd50>	
 <1><d6d>: Abbrev Number: 3 (DW_TAG_base_type)
    <d6e>   DW_AT_byte_size   : 8	
    <d6f>   DW_AT_encoding    : 7	(unsigned)
    <d70>   DW_AT_name        : (indirect string, offset: 0x29f): sizetype	
 <1><d74>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d75>   DW_AT_byte_size   : 8	
 <1><d76>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d77>   DW_AT_byte_size   : 8	
    <d78>   DW_AT_type        : <0xd7c>	
 <1><d7c>: Abbrev Number: 3 (DW_TAG_base_type)
    <d7d>   DW_AT_byte_size   : 1	
    <d7e>   DW_AT_encoding    : 6	(signed char)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x105): char	
 <1><d83>: Abbrev Number: 2 (DW_TAG_typedef)
    <d84>   DW_AT_name        : (indirect string, offset: 0x48f): FILE	
    <d88>   DW_AT_decl_file   : 4	
    <d89>   DW_AT_decl_line   : 48	
    <d8a>   DW_AT_type        : <0xd8e>	
 <1><d8e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x48b): _IO_FILE	
    <d93>   DW_AT_byte_size   : 216	
    <d94>   DW_AT_decl_file   : 5	
    <d95>   DW_AT_decl_line   : 246	
    <d96>   DW_AT_sibling     : <0xf0f>	
 <2><d9a>: Abbrev Number: 8 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x321): _flags	
    <d9f>   DW_AT_decl_file   : 5	
    <da0>   DW_AT_decl_line   : 247	
    <da1>   DW_AT_type        : <0xd49>	
    <da5>   DW_AT_data_member_location: 0	
 <2><da6>: Abbrev Number: 8 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x3bc): _IO_read_ptr	
    <dab>   DW_AT_decl_file   : 5	
    <dac>   DW_AT_decl_line   : 252	
    <dad>   DW_AT_type        : <0xd76>	
    <db1>   DW_AT_data_member_location: 8	
 <2><db2>: Abbrev Number: 8 (DW_TAG_member)
    <db3>   DW_AT_name        : (indirect string, offset: 0x46c): _IO_read_end	
    <db7>   DW_AT_decl_file   : 5	
    <db8>   DW_AT_decl_line   : 253	
    <db9>   DW_AT_type        : <0xd76>	
    <dbd>   DW_AT_data_member_location: 16	
 <2><dbe>: Abbrev Number: 8 (DW_TAG_member)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x37f): _IO_read_base	
    <dc3>   DW_AT_decl_file   : 5	
    <dc4>   DW_AT_decl_line   : 254	
    <dc5>   DW_AT_type        : <0xd76>	
    <dc9>   DW_AT_data_member_location: 24	
 <2><dca>: Abbrev Number: 8 (DW_TAG_member)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x3da): _IO_write_base	
    <dcf>   DW_AT_decl_file   : 5	
    <dd0>   DW_AT_decl_line   : 255	
    <dd1>   DW_AT_type        : <0xd76>	
    <dd5>   DW_AT_data_member_location: 32	
 <2><dd6>: Abbrev Number: 9 (DW_TAG_member)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x4a8): _IO_write_ptr	
    <ddb>   DW_AT_decl_file   : 5	
    <ddc>   DW_AT_decl_line   : 256	
    <dde>   DW_AT_type        : <0xd76>	
    <de2>   DW_AT_data_member_location: 40	
 <2><de3>: Abbrev Number: 9 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0x313): _IO_write_end	
    <de8>   DW_AT_decl_file   : 5	
    <de9>   DW_AT_decl_line   : 257	
    <deb>   DW_AT_type        : <0xd76>	
    <def>   DW_AT_data_member_location: 48	
 <2><df0>: Abbrev Number: 9 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0x4ec): _IO_buf_base	
    <df5>   DW_AT_decl_file   : 5	
    <df6>   DW_AT_decl_line   : 258	
    <df8>   DW_AT_type        : <0xd76>	
    <dfc>   DW_AT_data_member_location: 56	
 <2><dfd>: Abbrev Number: 9 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x2f5): _IO_buf_end	
    <e02>   DW_AT_decl_file   : 5	
    <e03>   DW_AT_decl_line   : 259	
    <e05>   DW_AT_type        : <0xd76>	
    <e09>   DW_AT_data_member_location: 64	
 <2><e0a>: Abbrev Number: 9 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x3e9): _IO_save_base	
    <e0f>   DW_AT_decl_file   : 5	
    <e10>   DW_AT_decl_line   : 261	
    <e12>   DW_AT_type        : <0xd76>	
    <e16>   DW_AT_data_member_location: 72	
 <2><e17>: Abbrev Number: 9 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0x367): _IO_backup_base	
    <e1c>   DW_AT_decl_file   : 5	
    <e1d>   DW_AT_decl_line   : 262	
    <e1f>   DW_AT_type        : <0xd76>	
    <e23>   DW_AT_data_member_location: 80	
 <2><e24>: Abbrev Number: 9 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x34c): _IO_save_end	
    <e29>   DW_AT_decl_file   : 5	
    <e2a>   DW_AT_decl_line   : 263	
    <e2c>   DW_AT_type        : <0xd76>	
    <e30>   DW_AT_data_member_location: 88	
 <2><e31>: Abbrev Number: 9 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0x332): _markers	
    <e36>   DW_AT_decl_file   : 5	
    <e37>   DW_AT_decl_line   : 265	
    <e39>   DW_AT_type        : <0xf47>	
    <e3d>   DW_AT_data_member_location: 96	
 <2><e3e>: Abbrev Number: 9 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x4be): _chain	
    <e43>   DW_AT_decl_file   : 5	
    <e44>   DW_AT_decl_line   : 267	
    <e46>   DW_AT_type        : <0xf4d>	
    <e4a>   DW_AT_data_member_location: 104	
 <2><e4b>: Abbrev Number: 9 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x377): _fileno	
    <e50>   DW_AT_decl_file   : 5	
    <e51>   DW_AT_decl_line   : 269	
    <e53>   DW_AT_type        : <0xd49>	
    <e57>   DW_AT_data_member_location: 112	
 <2><e58>: Abbrev Number: 9 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x4c5): _flags2	
    <e5d>   DW_AT_decl_file   : 5	
    <e5e>   DW_AT_decl_line   : 273	
    <e60>   DW_AT_type        : <0xd49>	
    <e64>   DW_AT_data_member_location: 116	
 <2><e65>: Abbrev Number: 9 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0x47f): _old_offset	
    <e6a>   DW_AT_decl_file   : 5	
    <e6b>   DW_AT_decl_line   : 275	
    <e6d>   DW_AT_type        : <0xd57>	
    <e71>   DW_AT_data_member_location: 120	
 <2><e72>: Abbrev Number: 9 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x4cd): _cur_column	
    <e77>   DW_AT_decl_file   : 5	
    <e78>   DW_AT_decl_line   : 279	
    <e7a>   DW_AT_type        : <0xd2d>	
    <e7e>   DW_AT_data_member_location: 128	
 <2><e7f>: Abbrev Number: 9 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0x458): _vtable_offset	
    <e84>   DW_AT_decl_file   : 5	
    <e85>   DW_AT_decl_line   : 280	
    <e87>   DW_AT_type        : <0xd3b>	
    <e8b>   DW_AT_data_member_location: 130	
 <2><e8c>: Abbrev Number: 9 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x2d9): _shortbuf	
    <e91>   DW_AT_decl_file   : 5	
    <e92>   DW_AT_decl_line   : 281	
    <e94>   DW_AT_type        : <0xf53>	
    <e98>   DW_AT_data_member_location: 131	
 <2><e99>: Abbrev Number: 9 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x479): _lock	
    <e9e>   DW_AT_decl_file   : 5	
    <e9f>   DW_AT_decl_line   : 285	
    <ea1>   DW_AT_type        : <0xf63>	
    <ea5>   DW_AT_data_member_location: 136	
 <2><ea6>: Abbrev Number: 9 (DW_TAG_member)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x483): _offset	
    <eab>   DW_AT_decl_file   : 5	
    <eac>   DW_AT_decl_line   : 294	
    <eae>   DW_AT_type        : <0xd62>	
    <eb2>   DW_AT_data_member_location: 144	
 <2><eb3>: Abbrev Number: 9 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x435): __pad1	
    <eb8>   DW_AT_decl_file   : 5	
    <eb9>   DW_AT_decl_line   : 303	
    <ebb>   DW_AT_type        : <0xd74>	
    <ebf>   DW_AT_data_member_location: 152	
 <2><ec0>: Abbrev Number: 9 (DW_TAG_member)
    <ec1>   DW_AT_name        : (indirect string, offset: 0x43c): __pad2	
    <ec5>   DW_AT_decl_file   : 5	
    <ec6>   DW_AT_decl_line   : 304	
    <ec8>   DW_AT_type        : <0xd74>	
    <ecc>   DW_AT_data_member_location: 160	
 <2><ecd>: Abbrev Number: 9 (DW_TAG_member)
    <ece>   DW_AT_name        : (indirect string, offset: 0x443): __pad3	
    <ed2>   DW_AT_decl_file   : 5	
    <ed3>   DW_AT_decl_line   : 305	
    <ed5>   DW_AT_type        : <0xd74>	
    <ed9>   DW_AT_data_member_location: 168	
 <2><eda>: Abbrev Number: 9 (DW_TAG_member)
    <edb>   DW_AT_name        : (indirect string, offset: 0x44a): __pad4	
    <edf>   DW_AT_decl_file   : 5	
    <ee0>   DW_AT_decl_line   : 306	
    <ee2>   DW_AT_type        : <0xd74>	
    <ee6>   DW_AT_data_member_location: 176	
 <2><ee7>: Abbrev Number: 9 (DW_TAG_member)
    <ee8>   DW_AT_name        : (indirect string, offset: 0x451): __pad5	
    <eec>   DW_AT_decl_file   : 5	
    <eed>   DW_AT_decl_line   : 307	
    <eef>   DW_AT_type        : <0xd14>	
    <ef3>   DW_AT_data_member_location: 184	
 <2><ef4>: Abbrev Number: 9 (DW_TAG_member)
    <ef5>   DW_AT_name        : (indirect string, offset: 0x3a3): _mode	
    <ef9>   DW_AT_decl_file   : 5	
    <efa>   DW_AT_decl_line   : 309	
    <efc>   DW_AT_type        : <0xd49>	
    <f00>   DW_AT_data_member_location: 192	
 <2><f01>: Abbrev Number: 9 (DW_TAG_member)
    <f02>   DW_AT_name        : (indirect string, offset: 0x4e3): _unused2	
    <f06>   DW_AT_decl_file   : 5	
    <f07>   DW_AT_decl_line   : 311	
    <f09>   DW_AT_type        : <0xf69>	
    <f0d>   DW_AT_data_member_location: 196	
 <2><f0e>: Abbrev Number: 0
 <1><f0f>: Abbrev Number: 10 (DW_TAG_typedef)
    <f10>   DW_AT_name        : (indirect string, offset: 0x2e3): _IO_lock_t	
    <f14>   DW_AT_decl_file   : 5	
    <f15>   DW_AT_decl_line   : 155	
 <1><f16>: Abbrev Number: 7 (DW_TAG_structure_type)
    <f17>   DW_AT_name        : (indirect string, offset: 0x3a9): _IO_marker	
    <f1b>   DW_AT_byte_size   : 24	
    <f1c>   DW_AT_decl_file   : 5	
    <f1d>   DW_AT_decl_line   : 161	
    <f1e>   DW_AT_sibling     : <0xf47>	
 <2><f22>: Abbrev Number: 8 (DW_TAG_member)
    <f23>   DW_AT_name        : (indirect string, offset: 0x38d): _next	
    <f27>   DW_AT_decl_file   : 5	
    <f28>   DW_AT_decl_line   : 162	
    <f29>   DW_AT_type        : <0xf47>	
    <f2d>   DW_AT_data_member_location: 0	
 <2><f2e>: Abbrev Number: 8 (DW_TAG_member)
    <f2f>   DW_AT_name        : (indirect string, offset: 0x4a2): _sbuf	
    <f33>   DW_AT_decl_file   : 5	
    <f34>   DW_AT_decl_line   : 163	
    <f35>   DW_AT_type        : <0xf4d>	
    <f39>   DW_AT_data_member_location: 8	
 <2><f3a>: Abbrev Number: 8 (DW_TAG_member)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x7cd): _pos	
    <f3f>   DW_AT_decl_file   : 5	
    <f40>   DW_AT_decl_line   : 167	
    <f41>   DW_AT_type        : <0xd49>	
    <f45>   DW_AT_data_member_location: 16	
 <2><f46>: Abbrev Number: 0
 <1><f47>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f48>   DW_AT_byte_size   : 8	
    <f49>   DW_AT_type        : <0xf16>	
 <1><f4d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f4e>   DW_AT_byte_size   : 8	
    <f4f>   DW_AT_type        : <0xd8e>	
 <1><f53>: Abbrev Number: 11 (DW_TAG_array_type)
    <f54>   DW_AT_type        : <0xd7c>	
    <f58>   DW_AT_sibling     : <0xf63>	
 <2><f5c>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <f5d>   DW_AT_type        : <0xd6d>	
    <f61>   DW_AT_upper_bound : 0	
 <2><f62>: Abbrev Number: 0
 <1><f63>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f64>   DW_AT_byte_size   : 8	
    <f65>   DW_AT_type        : <0xf0f>	
 <1><f69>: Abbrev Number: 11 (DW_TAG_array_type)
    <f6a>   DW_AT_type        : <0xd7c>	
    <f6e>   DW_AT_sibling     : <0xf79>	
 <2><f72>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <f73>   DW_AT_type        : <0xd6d>	
    <f77>   DW_AT_upper_bound : 19	
 <2><f78>: Abbrev Number: 0
 <1><f79>: Abbrev Number: 3 (DW_TAG_base_type)
    <f7a>   DW_AT_byte_size   : 4	
    <f7b>   DW_AT_encoding    : 4	(float)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x9d): float	
 <1><f80>: Abbrev Number: 3 (DW_TAG_base_type)
    <f81>   DW_AT_byte_size   : 8	
    <f82>   DW_AT_encoding    : 4	(float)
    <f83>   DW_AT_name        : (indirect string, offset: 0x24c): double	
 <1><f87>: Abbrev Number: 3 (DW_TAG_base_type)
    <f88>   DW_AT_byte_size   : 8	
    <f89>   DW_AT_encoding    : 5	(signed)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xb1): long long int	
 <1><f8e>: Abbrev Number: 3 (DW_TAG_base_type)
    <f8f>   DW_AT_byte_size   : 8	
    <f90>   DW_AT_encoding    : 7	(unsigned)
    <f91>   DW_AT_name        : (indirect string, offset: 0x16c): long long unsigned int	
 <1><f95>: Abbrev Number: 2 (DW_TAG_typedef)
    <f96>   DW_AT_name        : (indirect string, offset: 0x263): flow_t	
    <f9a>   DW_AT_decl_file   : 6	
    <f9b>   DW_AT_decl_line   : 68	
    <f9c>   DW_AT_type        : <0xd50>	
 <1><fa0>: Abbrev Number: 2 (DW_TAG_typedef)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x96): cost_t	
    <fa5>   DW_AT_decl_file   : 6	
    <fa6>   DW_AT_decl_line   : 69	
    <fa7>   DW_AT_type        : <0xd50>	
 <1><fab>: Abbrev Number: 2 (DW_TAG_typedef)
    <fac>   DW_AT_name        : (indirect string, offset: 0x3c9): node_t	
    <fb0>   DW_AT_decl_file   : 6	
    <fb1>   DW_AT_decl_line   : 99	
    <fb2>   DW_AT_type        : <0xfb6>	
 <1><fb6>: Abbrev Number: 7 (DW_TAG_structure_type)
    <fb7>   DW_AT_name        : (indirect string, offset: 0xda): node	
    <fbb>   DW_AT_byte_size   : 104	
    <fbc>   DW_AT_decl_file   : 6	
    <fbd>   DW_AT_decl_line   : 107	
    <fbe>   DW_AT_sibling     : <0x106b>	
 <2><fc2>: Abbrev Number: 8 (DW_TAG_member)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x5b0): potential	
    <fc7>   DW_AT_decl_file   : 6	
    <fc8>   DW_AT_decl_line   : 109	
    <fc9>   DW_AT_type        : <0xfa0>	
    <fcd>   DW_AT_data_member_location: 0	
 <2><fce>: Abbrev Number: 8 (DW_TAG_member)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x669): orientation	
    <fd3>   DW_AT_decl_file   : 6	
    <fd4>   DW_AT_decl_line   : 110	
    <fd5>   DW_AT_type        : <0xd49>	
    <fd9>   DW_AT_data_member_location: 8	
 <2><fda>: Abbrev Number: 8 (DW_TAG_member)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x3b): child	
    <fdf>   DW_AT_decl_file   : 6	
    <fe0>   DW_AT_decl_line   : 111	
    <fe1>   DW_AT_type        : <0x106b>	
    <fe5>   DW_AT_data_member_location: 16	
 <2><fe6>: Abbrev Number: 8 (DW_TAG_member)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x6a5): pred	
    <feb>   DW_AT_decl_file   : 6	
    <fec>   DW_AT_decl_line   : 112	
    <fed>   DW_AT_type        : <0x106b>	
    <ff1>   DW_AT_data_member_location: 24	
 <2><ff2>: Abbrev Number: 8 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x62): sibling	
    <ff7>   DW_AT_decl_file   : 6	
    <ff8>   DW_AT_decl_line   : 113	
    <ff9>   DW_AT_type        : <0x106b>	
    <ffd>   DW_AT_data_member_location: 32	
 <2><ffe>: Abbrev Number: 8 (DW_TAG_member)
    <fff>   DW_AT_name        : (indirect string, offset: 0xe7): sibling_prev	
    <1003>   DW_AT_decl_file   : 6	
    <1004>   DW_AT_decl_line   : 114	
    <1005>   DW_AT_type        : <0x106b>	
    <1009>   DW_AT_data_member_location: 40	
 <2><100a>: Abbrev Number: 8 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0x6c8): basic_arc	
    <100f>   DW_AT_decl_file   : 6	
    <1010>   DW_AT_decl_line   : 115	
    <1011>   DW_AT_type        : <0x10f4>	
    <1015>   DW_AT_data_member_location: 48	
 <2><1016>: Abbrev Number: 8 (DW_TAG_member)
    <1017>   DW_AT_name        : (indirect string, offset: 0x59): firstout	
    <101b>   DW_AT_decl_file   : 6	
    <101c>   DW_AT_decl_line   : 116	
    <101d>   DW_AT_type        : <0x10f4>	
    <1021>   DW_AT_data_member_location: 56	
 <2><1022>: Abbrev Number: 8 (DW_TAG_member)
    <1023>   DW_AT_name        : (indirect string, offset: 0xdf): firstin	
    <1027>   DW_AT_decl_file   : 6	
    <1028>   DW_AT_decl_line   : 116	
    <1029>   DW_AT_type        : <0x10f4>	
    <102d>   DW_AT_data_member_location: 64	
 <2><102e>: Abbrev Number: 8 (DW_TAG_member)
    <102f>   DW_AT_name        : (indirect string, offset: 0xa9): arc_tmp	
    <1033>   DW_AT_decl_file   : 6	
    <1034>   DW_AT_decl_line   : 117	
    <1035>   DW_AT_type        : <0x10f4>	
    <1039>   DW_AT_data_member_location: 72	
 <2><103a>: Abbrev Number: 8 (DW_TAG_member)
    <103b>   DW_AT_name        : (indirect string, offset: 0x767): flow	
    <103f>   DW_AT_decl_file   : 6	
    <1040>   DW_AT_decl_line   : 118	
    <1041>   DW_AT_type        : <0xf95>	
    <1045>   DW_AT_data_member_location: 80	
 <2><1046>: Abbrev Number: 8 (DW_TAG_member)
    <1047>   DW_AT_name        : (indirect string, offset: 0x6f2): depth	
    <104b>   DW_AT_decl_file   : 6	
    <104c>   DW_AT_decl_line   : 119	
    <104d>   DW_AT_type        : <0xd50>	
    <1051>   DW_AT_data_member_location: 88	
 <2><1052>: Abbrev Number: 8 (DW_TAG_member)
    <1053>   DW_AT_name        : (indirect string, offset: 0x2b4): number	
    <1057>   DW_AT_decl_file   : 6	
    <1058>   DW_AT_decl_line   : 120	
    <1059>   DW_AT_type        : <0xd49>	
    <105d>   DW_AT_data_member_location: 96	
 <2><105e>: Abbrev Number: 8 (DW_TAG_member)
    <105f>   DW_AT_name        : (indirect string, offset: 0x1f4): time	
    <1063>   DW_AT_decl_file   : 6	
    <1064>   DW_AT_decl_line   : 121	
    <1065>   DW_AT_type        : <0xd49>	
    <1069>   DW_AT_data_member_location: 100	
 <2><106a>: Abbrev Number: 0
 <1><106b>: Abbrev Number: 2 (DW_TAG_typedef)
    <106c>   DW_AT_name        : (indirect string, offset: 0x1e3): node_p	
    <1070>   DW_AT_decl_file   : 6	
    <1071>   DW_AT_decl_line   : 100	
    <1072>   DW_AT_type        : <0x1076>	
 <1><1076>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1077>   DW_AT_byte_size   : 8	
    <1078>   DW_AT_type        : <0xfb6>	
 <1><107c>: Abbrev Number: 2 (DW_TAG_typedef)
    <107d>   DW_AT_name        : (indirect string, offset: 0x3fd): arc_t	
    <1081>   DW_AT_decl_file   : 6	
    <1082>   DW_AT_decl_line   : 102	
    <1083>   DW_AT_type        : <0x1087>	
 <1><1087>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1088>   DW_AT_name        : arc	
    <108c>   DW_AT_byte_size   : 64	
    <108d>   DW_AT_decl_file   : 6	
    <108e>   DW_AT_decl_line   : 126	
    <108f>   DW_AT_sibling     : <0x10f4>	
 <2><1093>: Abbrev Number: 8 (DW_TAG_member)
    <1094>   DW_AT_name        : (indirect string, offset: 0x5ef): cost	
    <1098>   DW_AT_decl_file   : 6	
    <1099>   DW_AT_decl_line   : 128	
    <109a>   DW_AT_type        : <0xfa0>	
    <109e>   DW_AT_data_member_location: 0	
 <2><109f>: Abbrev Number: 8 (DW_TAG_member)
    <10a0>   DW_AT_name        : (indirect string, offset: 0x1ea): tail	
    <10a4>   DW_AT_decl_file   : 6	
    <10a5>   DW_AT_decl_line   : 129	
    <10a6>   DW_AT_type        : <0x106b>	
    <10aa>   DW_AT_data_member_location: 8	
 <2><10ab>: Abbrev Number: 8 (DW_TAG_member)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x88): head	
    <10b0>   DW_AT_decl_file   : 6	
    <10b1>   DW_AT_decl_line   : 129	
    <10b2>   DW_AT_type        : <0x106b>	
    <10b6>   DW_AT_data_member_location: 16	
 <2><10b7>: Abbrev Number: 8 (DW_TAG_member)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x2ae): ident	
    <10bc>   DW_AT_decl_file   : 6	
    <10bd>   DW_AT_decl_line   : 130	
    <10be>   DW_AT_type        : <0xd49>	
    <10c2>   DW_AT_data_member_location: 24	
 <2><10c3>: Abbrev Number: 8 (DW_TAG_member)
    <10c4>   DW_AT_name        : (indirect string, offset: 0x2d1): nextout	
    <10c8>   DW_AT_decl_file   : 6	
    <10c9>   DW_AT_decl_line   : 131	
    <10ca>   DW_AT_type        : <0x10f4>	
    <10ce>   DW_AT_data_member_location: 32	
 <2><10cf>: Abbrev Number: 8 (DW_TAG_member)
    <10d0>   DW_AT_name        : (indirect string, offset: 0x52): nextin	
    <10d4>   DW_AT_decl_file   : 6	
    <10d5>   DW_AT_decl_line   : 131	
    <10d6>   DW_AT_type        : <0x10f4>	
    <10da>   DW_AT_data_member_location: 40	
 <2><10db>: Abbrev Number: 8 (DW_TAG_member)
    <10dc>   DW_AT_name        : (indirect string, offset: 0x767): flow	
    <10e0>   DW_AT_decl_file   : 6	
    <10e1>   DW_AT_decl_line   : 132	
    <10e2>   DW_AT_type        : <0xf95>	
    <10e6>   DW_AT_data_member_location: 48	
 <2><10e7>: Abbrev Number: 8 (DW_TAG_member)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x499): org_cost	
    <10ec>   DW_AT_decl_file   : 6	
    <10ed>   DW_AT_decl_line   : 133	
    <10ee>   DW_AT_type        : <0xfa0>	
    <10f2>   DW_AT_data_member_location: 56	
 <2><10f3>: Abbrev Number: 0
 <1><10f4>: Abbrev Number: 2 (DW_TAG_typedef)
    <10f5>   DW_AT_name        : (indirect string, offset: 0x2bb): arc_p	
    <10f9>   DW_AT_decl_file   : 6	
    <10fa>   DW_AT_decl_line   : 103	
    <10fb>   DW_AT_type        : <0x10ff>	
 <1><10ff>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1100>   DW_AT_byte_size   : 8	
    <1101>   DW_AT_type        : <0x1087>	
 <1><1105>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1106>   DW_AT_name        : (indirect string, offset: 0x183): network	
    <110a>   DW_AT_byte_size   : 624	
    <110c>   DW_AT_decl_file   : 6	
    <110d>   DW_AT_decl_line   : 138	
    <110e>   DW_AT_sibling     : <0x1293>	
 <2><1112>: Abbrev Number: 8 (DW_TAG_member)
    <1113>   DW_AT_name        : (indirect string, offset: 0x295): inputfile	
    <1117>   DW_AT_decl_file   : 6	
    <1118>   DW_AT_decl_line   : 140	
    <1119>   DW_AT_type        : <0x1293>	
    <111d>   DW_AT_data_member_location: 0	
 <2><111e>: Abbrev Number: 8 (DW_TAG_member)
    <111f>   DW_AT_name        : (indirect string, offset: 0x238): clustfile	
    <1123>   DW_AT_decl_file   : 6	
    <1124>   DW_AT_decl_line   : 141	
    <1125>   DW_AT_type        : <0x1293>	
    <1129>   DW_AT_data_member_location: 200	
 <2><112a>: Abbrev Number: 15 (DW_TAG_member)
    <112b>   DW_AT_name        : n	
    <112d>   DW_AT_decl_file   : 6	
    <112e>   DW_AT_decl_line   : 142	
    <112f>   DW_AT_type        : <0xd50>	
    <1133>   DW_AT_data_member_location: 400	
 <2><1135>: Abbrev Number: 16 (DW_TAG_member)
    <1136>   DW_AT_name        : (indirect string, offset: 0xf4): n_trips	
    <113a>   DW_AT_decl_file   : 6	
    <113b>   DW_AT_decl_line   : 142	
    <113c>   DW_AT_type        : <0xd50>	
    <1140>   DW_AT_data_member_location: 408	
 <2><1142>: Abbrev Number: 16 (DW_TAG_member)
    <1143>   DW_AT_name        : (indirect string, offset: 0xa3): max_m	
    <1147>   DW_AT_decl_file   : 6	
    <1148>   DW_AT_decl_line   : 143	
    <1149>   DW_AT_type        : <0xd50>	
    <114d>   DW_AT_data_member_location: 416	
 <2><114f>: Abbrev Number: 15 (DW_TAG_member)
    <1150>   DW_AT_name        : m	
    <1152>   DW_AT_decl_file   : 6	
    <1153>   DW_AT_decl_line   : 143	
    <1154>   DW_AT_type        : <0xd50>	
    <1158>   DW_AT_data_member_location: 424	
 <2><115a>: Abbrev Number: 16 (DW_TAG_member)
    <115b>   DW_AT_name        : (indirect string, offset: 0x2a8): m_org	
    <115f>   DW_AT_decl_file   : 6	
    <1160>   DW_AT_decl_line   : 143	
    <1161>   DW_AT_type        : <0xd50>	
    <1165>   DW_AT_data_member_location: 432	
 <2><1167>: Abbrev Number: 16 (DW_TAG_member)
    <1168>   DW_AT_name        : (indirect string, offset: 0xbf): m_impl	
    <116c>   DW_AT_decl_file   : 6	
    <116d>   DW_AT_decl_line   : 143	
    <116e>   DW_AT_type        : <0xd50>	
    <1172>   DW_AT_data_member_location: 440	
 <2><1174>: Abbrev Number: 16 (DW_TAG_member)
    <1175>   DW_AT_name        : (indirect string, offset: 0x6a): max_residual_new_m	
    <1179>   DW_AT_decl_file   : 6	
    <117a>   DW_AT_decl_line   : 144	
    <117b>   DW_AT_type        : <0xd50>	
    <117f>   DW_AT_data_member_location: 448	
 <2><1181>: Abbrev Number: 16 (DW_TAG_member)
    <1182>   DW_AT_name        : (indirect string, offset: 0x1f9): max_new_m	
    <1186>   DW_AT_decl_file   : 6	
    <1187>   DW_AT_decl_line   : 144	
    <1188>   DW_AT_type        : <0xd50>	
    <118c>   DW_AT_data_member_location: 456	
 <2><118e>: Abbrev Number: 16 (DW_TAG_member)
    <118f>   DW_AT_name        : (indirect string, offset: 0x26a): primal_unbounded	
    <1193>   DW_AT_decl_file   : 6	
    <1194>   DW_AT_decl_line   : 146	
    <1195>   DW_AT_type        : <0xd50>	
    <1199>   DW_AT_data_member_location: 464	
 <2><119b>: Abbrev Number: 16 (DW_TAG_member)
    <119c>   DW_AT_name        : (indirect string, offset: 0xb): dual_unbounded	
    <11a0>   DW_AT_decl_file   : 6	
    <11a1>   DW_AT_decl_line   : 147	
    <11a2>   DW_AT_type        : <0xd50>	
    <11a6>   DW_AT_data_member_location: 472	
 <2><11a8>: Abbrev Number: 16 (DW_TAG_member)
    <11a9>   DW_AT_name        : (indirect string, offset: 0x10a): perturbed	
    <11ad>   DW_AT_decl_file   : 6	
    <11ae>   DW_AT_decl_line   : 148	
    <11af>   DW_AT_type        : <0xd50>	
    <11b3>   DW_AT_data_member_location: 480	
 <2><11b5>: Abbrev Number: 16 (DW_TAG_member)
    <11b6>   DW_AT_name        : (indirect string, offset: 0x39a): feasible	
    <11ba>   DW_AT_decl_file   : 6	
    <11bb>   DW_AT_decl_line   : 149	
    <11bc>   DW_AT_type        : <0xd50>	
    <11c0>   DW_AT_data_member_location: 488	
 <2><11c2>: Abbrev Number: 15 (DW_TAG_member)
    <11c3>   DW_AT_name        : eps	
    <11c7>   DW_AT_decl_file   : 6	
    <11c8>   DW_AT_decl_line   : 150	
    <11c9>   DW_AT_type        : <0xd50>	
    <11cd>   DW_AT_data_member_location: 496	
 <2><11cf>: Abbrev Number: 16 (DW_TAG_member)
    <11d0>   DW_AT_name        : (indirect string, offset: 0xd2): opt_tol	
    <11d4>   DW_AT_decl_file   : 6	
    <11d5>   DW_AT_decl_line   : 151	
    <11d6>   DW_AT_type        : <0xd50>	
    <11da>   DW_AT_data_member_location: 504	
 <2><11dc>: Abbrev Number: 16 (DW_TAG_member)
    <11dd>   DW_AT_name        : (indirect string, offset: 0x226): feas_tol	
    <11e1>   DW_AT_decl_file   : 6	
    <11e2>   DW_AT_decl_line   : 152	
    <11e3>   DW_AT_type        : <0xd50>	
    <11e7>   DW_AT_data_member_location: 512	
 <2><11e9>: Abbrev Number: 16 (DW_TAG_member)
    <11ea>   DW_AT_name        : (indirect string, offset: 0x22f): pert_val	
    <11ee>   DW_AT_decl_file   : 6	
    <11ef>   DW_AT_decl_line   : 153	
    <11f0>   DW_AT_type        : <0xd50>	
    <11f4>   DW_AT_data_member_location: 520	
 <2><11f6>: Abbrev Number: 16 (DW_TAG_member)
    <11f7>   DW_AT_name        : (indirect string, offset: 0x25): bigM	
    <11fb>   DW_AT_decl_file   : 6	
    <11fc>   DW_AT_decl_line   : 154	
    <11fd>   DW_AT_type        : <0xd50>	
    <1201>   DW_AT_data_member_location: 528	
