Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1c60 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x7b8): GNU C 4.8.1 -mtune=generic -march=x86-64 -g -fno-strict-aliasing -fstack-protector	
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0x8d9): spec_main_live_pretend.c	
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x706): /home/yunqi/SPEC2006/benchspec/CPU2006/482.sphinx3/build/build_base_amd64-m64-gcc43-nn.0000	
    <19>   DW_AT_low_pc      : 0x40121e	
    <21>   DW_AT_high_pc     : 0x88b	
    <29>   DW_AT_stmt_list   : 0x0	
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x1978): size_t	
    <32>   DW_AT_decl_file   : 2	
    <33>   DW_AT_decl_line   : 212	
    <34>   DW_AT_type        : <0x38>	
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8	
    <3a>   DW_AT_encoding    : 7	(unsigned)
    <3b>   DW_AT_name        : (indirect string, offset: 0x8c7): long unsigned int	
 <1><3f>: Abbrev Number: 3 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 1	
    <41>   DW_AT_encoding    : 8	(unsigned char)
    <42>   DW_AT_name        : (indirect string, offset: 0x24e): unsigned char	
 <1><46>: Abbrev Number: 3 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 2	
    <48>   DW_AT_encoding    : 7	(unsigned)
    <49>   DW_AT_name        : (indirect string, offset: 0xbd2): short unsigned int	
 <1><4d>: Abbrev Number: 3 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 4	
    <4f>   DW_AT_encoding    : 7	(unsigned)
    <50>   DW_AT_name        : (indirect string, offset: 0x8cc): unsigned int	
 <1><54>: Abbrev Number: 3 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 1	
    <56>   DW_AT_encoding    : 6	(signed char)
    <57>   DW_AT_name        : (indirect string, offset: 0x250): signed char	
 <1><5b>: Abbrev Number: 3 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 2	
    <5d>   DW_AT_encoding    : 5	(signed)
    <5e>   DW_AT_name        : (indirect string, offset: 0xa96): short int	
 <1><62>: Abbrev Number: 4 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 4	
    <64>   DW_AT_encoding    : 5	(signed)
    <65>   DW_AT_name        : int	
 <1><69>: Abbrev Number: 3 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 8	
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0x5c5): long int	
 <1><70>: Abbrev Number: 2 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x917): __off_t	
    <75>   DW_AT_decl_file   : 3	
    <76>   DW_AT_decl_line   : 140	
    <77>   DW_AT_type        : <0x69>	
 <1><7b>: Abbrev Number: 2 (DW_TAG_typedef)
    <7c>   DW_AT_name        : (indirect string, offset: 0xa17): __off64_t	
    <80>   DW_AT_decl_file   : 3	
    <81>   DW_AT_decl_line   : 141	
    <82>   DW_AT_type        : <0x69>	
 <1><86>: Abbrev Number: 3 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 8	
    <88>   DW_AT_encoding    : 7	(unsigned)
    <89>   DW_AT_name        : (indirect string, offset: 0x14): sizetype	
 <1><8d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <8e>   DW_AT_byte_size   : 8	
 <1><8f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <90>   DW_AT_byte_size   : 8	
    <91>   DW_AT_type        : <0x95>	
 <1><95>: Abbrev Number: 3 (DW_TAG_base_type)
    <96>   DW_AT_byte_size   : 1	
    <97>   DW_AT_encoding    : 6	(signed char)
    <98>   DW_AT_name        : (indirect string, offset: 0x257): char	
 <1><9c>: Abbrev Number: 2 (DW_TAG_typedef)
    <9d>   DW_AT_name        : (indirect string, offset: 0x2d54): FILE	
    <a1>   DW_AT_decl_file   : 4	
    <a2>   DW_AT_decl_line   : 48	
    <a3>   DW_AT_type        : <0xa7>	
 <1><a7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a8>   DW_AT_name        : (indirect string, offset: 0x21c): _IO_FILE	
    <ac>   DW_AT_byte_size   : 216	
    <ad>   DW_AT_decl_file   : 5	
    <ae>   DW_AT_decl_line   : 246	
    <af>   DW_AT_sibling     : <0x228>	
 <2><b3>: Abbrev Number: 8 (DW_TAG_member)
    <b4>   DW_AT_name        : (indirect string, offset: 0x779): _flags	
    <b8>   DW_AT_decl_file   : 5	
    <b9>   DW_AT_decl_line   : 247	
    <ba>   DW_AT_type        : <0x62>	
    <be>   DW_AT_data_member_location: 0	
 <2><bf>: Abbrev Number: 8 (DW_TAG_member)
    <c0>   DW_AT_name        : (indirect string, offset: 0x38b): _IO_read_ptr	
    <c4>   DW_AT_decl_file   : 5	
    <c5>   DW_AT_decl_line   : 252	
    <c6>   DW_AT_type        : <0x8f>	
    <ca>   DW_AT_data_member_location: 8	
 <2><cb>: Abbrev Number: 8 (DW_TAG_member)
    <cc>   DW_AT_name        : (indirect string, offset: 0xb44): _IO_read_end	
    <d0>   DW_AT_decl_file   : 5	
    <d1>   DW_AT_decl_line   : 253	
    <d2>   DW_AT_type        : <0x8f>	
    <d6>   DW_AT_data_member_location: 16	
 <2><d7>: Abbrev Number: 8 (DW_TAG_member)
    <d8>   DW_AT_name        : (indirect string, offset: 0x4c2): _IO_read_base	
    <dc>   DW_AT_decl_file   : 5	
    <dd>   DW_AT_decl_line   : 254	
    <de>   DW_AT_type        : <0x8f>	
    <e2>   DW_AT_data_member_location: 24	
 <2><e3>: Abbrev Number: 8 (DW_TAG_member)
    <e4>   DW_AT_name        : (indirect string, offset: 0x9d): _IO_write_base	
    <e8>   DW_AT_decl_file   : 5	
    <e9>   DW_AT_decl_line   : 255	
    <ea>   DW_AT_type        : <0x8f>	
    <ee>   DW_AT_data_member_location: 32	
 <2><ef>: Abbrev Number: 9 (DW_TAG_member)
    <f0>   DW_AT_name        : (indirect string, offset: 0xc02): _IO_write_ptr	
    <f4>   DW_AT_decl_file   : 5	
    <f5>   DW_AT_decl_line   : 256	
    <f7>   DW_AT_type        : <0x8f>	
    <fb>   DW_AT_data_member_location: 40	
 <2><fc>: Abbrev Number: 9 (DW_TAG_member)
    <fd>   DW_AT_name        : (indirect string, offset: 0x5f2): _IO_write_end	
    <101>   DW_AT_decl_file   : 5	
    <102>   DW_AT_decl_line   : 257	
    <104>   DW_AT_type        : <0x8f>	
    <108>   DW_AT_data_member_location: 48	
 <2><109>: Abbrev Number: 9 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x65d): _IO_buf_base	
    <10e>   DW_AT_decl_file   : 5	
    <10f>   DW_AT_decl_line   : 258	
    <111>   DW_AT_type        : <0x8f>	
    <115>   DW_AT_data_member_location: 56	
 <2><116>: Abbrev Number: 9 (DW_TAG_member)
    <117>   DW_AT_name        : (indirect string, offset: 0xa50): _IO_buf_end	
    <11b>   DW_AT_decl_file   : 5	
    <11c>   DW_AT_decl_line   : 259	
    <11e>   DW_AT_type        : <0x8f>	
    <122>   DW_AT_data_member_location: 64	
 <2><123>: Abbrev Number: 9 (DW_TAG_member)
    <124>   DW_AT_name        : (indirect string, offset: 0xc9): _IO_save_base	
    <128>   DW_AT_decl_file   : 5	
    <129>   DW_AT_decl_line   : 261	
    <12b>   DW_AT_type        : <0x8f>	
    <12f>   DW_AT_data_member_location: 72	
 <2><130>: Abbrev Number: 9 (DW_TAG_member)
    <131>   DW_AT_name        : (indirect string, offset: 0x9a8): _IO_backup_base	
    <135>   DW_AT_decl_file   : 5	
    <136>   DW_AT_decl_line   : 262	
    <138>   DW_AT_type        : <0x8f>	
    <13c>   DW_AT_data_member_location: 80	
 <2><13d>: Abbrev Number: 9 (DW_TAG_member)
    <13e>   DW_AT_name        : (indirect string, offset: 0x54): _IO_save_end	
    <142>   DW_AT_decl_file   : 5	
    <143>   DW_AT_decl_line   : 263	
    <145>   DW_AT_type        : <0x8f>	
    <149>   DW_AT_data_member_location: 88	
 <2><14a>: Abbrev Number: 9 (DW_TAG_member)
    <14b>   DW_AT_name        : (indirect string, offset: 0x3de): _markers	
    <14f>   DW_AT_decl_file   : 5	
    <150>   DW_AT_decl_line   : 265	
    <152>   DW_AT_type        : <0x260>	
    <156>   DW_AT_data_member_location: 96	
 <2><157>: Abbrev Number: 9 (DW_TAG_member)
    <158>   DW_AT_name        : (indirect string, offset: 0x118): _chain	
    <15c>   DW_AT_decl_file   : 5	
    <15d>   DW_AT_decl_line   : 267	
    <15f>   DW_AT_type        : <0x266>	
    <163>   DW_AT_data_member_location: 104	
 <2><164>: Abbrev Number: 9 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0xb86): _fileno	
    <169>   DW_AT_decl_file   : 5	
    <16a>   DW_AT_decl_line   : 269	
    <16c>   DW_AT_type        : <0x62>	
    <170>   DW_AT_data_member_location: 112	
 <2><171>: Abbrev Number: 9 (DW_TAG_member)
    <172>   DW_AT_name        : (indirect string, offset: 0x4a8): _flags2	
    <176>   DW_AT_decl_file   : 5	
    <177>   DW_AT_decl_line   : 273	
    <179>   DW_AT_type        : <0x62>	
    <17d>   DW_AT_data_member_location: 116	
 <2><17e>: Abbrev Number: 9 (DW_TAG_member)
    <17f>   DW_AT_name        : (indirect string, offset: 0x540): _old_offset	
    <183>   DW_AT_decl_file   : 5	
    <184>   DW_AT_decl_line   : 275	
    <186>   DW_AT_type        : <0x70>	
    <18a>   DW_AT_data_member_location: 120	
 <2><18b>: Abbrev Number: 9 (DW_TAG_member)
    <18c>   DW_AT_name        : (indirect string, offset: 0x140): _cur_column	
    <190>   DW_AT_decl_file   : 5	
    <191>   DW_AT_decl_line   : 279	
    <193>   DW_AT_type        : <0x46>	
    <197>   DW_AT_data_member_location: 128	
 <2><198>: Abbrev Number: 9 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0xaea): _vtable_offset	
    <19d>   DW_AT_decl_file   : 5	
    <19e>   DW_AT_decl_line   : 280	
    <1a0>   DW_AT_type        : <0x54>	
    <1a4>   DW_AT_data_member_location: 130	
 <2><1a5>: Abbrev Number: 9 (DW_TAG_member)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x9b8): _shortbuf	
    <1aa>   DW_AT_decl_file   : 5	
    <1ab>   DW_AT_decl_line   : 281	
    <1ad>   DW_AT_type        : <0x26c>	
    <1b1>   DW_AT_data_member_location: 131	
 <2><1b2>: Abbrev Number: 9 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xac): _lock	
    <1b7>   DW_AT_decl_file   : 5	
    <1b8>   DW_AT_decl_line   : 285	
    <1ba>   DW_AT_type        : <0x27c>	
    <1be>   DW_AT_data_member_location: 136	
 <2><1bf>: Abbrev Number: 9 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0x544): _offset	
    <1c4>   DW_AT_decl_file   : 5	
    <1c5>   DW_AT_decl_line   : 294	
    <1c7>   DW_AT_type        : <0x7b>	
    <1cb>   DW_AT_data_member_location: 144	
 <2><1cc>: Abbrev Number: 9 (DW_TAG_member)
    <1cd>   DW_AT_name        : (indirect string, offset: 0x6c3): __pad1	
    <1d1>   DW_AT_decl_file   : 5	
    <1d2>   DW_AT_decl_line   : 303	
    <1d4>   DW_AT_type        : <0x8d>	
    <1d8>   DW_AT_data_member_location: 152	
 <2><1d9>: Abbrev Number: 9 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0x6ca): __pad2	
    <1de>   DW_AT_decl_file   : 5	
    <1df>   DW_AT_decl_line   : 304	
    <1e1>   DW_AT_type        : <0x8d>	
    <1e5>   DW_AT_data_member_location: 160	
 <2><1e6>: Abbrev Number: 9 (DW_TAG_member)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x6d1): __pad3	
    <1eb>   DW_AT_decl_file   : 5	
    <1ec>   DW_AT_decl_line   : 305	
    <1ee>   DW_AT_type        : <0x8d>	
    <1f2>   DW_AT_data_member_location: 168	
 <2><1f3>: Abbrev Number: 9 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x6d8): __pad4	
    <1f8>   DW_AT_decl_file   : 5	
    <1f9>   DW_AT_decl_line   : 306	
    <1fb>   DW_AT_type        : <0x8d>	
    <1ff>   DW_AT_data_member_location: 176	
 <2><200>: Abbrev Number: 9 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x6df): __pad5	
    <205>   DW_AT_decl_file   : 5	
    <206>   DW_AT_decl_line   : 307	
    <208>   DW_AT_type        : <0x2d>	
    <20c>   DW_AT_data_member_location: 184	
 <2><20d>: Abbrev Number: 9 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x1936): _mode	
    <212>   DW_AT_decl_file   : 5	
    <213>   DW_AT_decl_line   : 309	
    <215>   DW_AT_type        : <0x62>	
    <219>   DW_AT_data_member_location: 192	
 <2><21a>: Abbrev Number: 9 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x500): _unused2	
    <21f>   DW_AT_decl_file   : 5	
    <220>   DW_AT_decl_line   : 311	
    <222>   DW_AT_type        : <0x282>	
    <226>   DW_AT_data_member_location: 196	
 <2><227>: Abbrev Number: 0
 <1><228>: Abbrev Number: 10 (DW_TAG_typedef)
    <229>   DW_AT_name        : (indirect string, offset: 0x32a): _IO_lock_t	
    <22d>   DW_AT_decl_file   : 5	
    <22e>   DW_AT_decl_line   : 155	
 <1><22f>: Abbrev Number: 7 (DW_TAG_structure_type)
    <230>   DW_AT_name        : (indirect string, offset: 0x1b3): _IO_marker	
    <234>   DW_AT_byte_size   : 24	
    <235>   DW_AT_decl_file   : 5	
    <236>   DW_AT_decl_line   : 161	
    <237>   DW_AT_sibling     : <0x260>	
 <2><23b>: Abbrev Number: 8 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0xa01): _next	
    <240>   DW_AT_decl_file   : 5	
    <241>   DW_AT_decl_line   : 162	
    <242>   DW_AT_type        : <0x260>	
    <246>   DW_AT_data_member_location: 0	
 <2><247>: Abbrev Number: 8 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0x6e6): _sbuf	
    <24c>   DW_AT_decl_file   : 5	
    <24d>   DW_AT_decl_line   : 163	
    <24e>   DW_AT_type        : <0x266>	
    <252>   DW_AT_data_member_location: 8	
 <2><253>: Abbrev Number: 8 (DW_TAG_member)
    <254>   DW_AT_name        : (indirect string, offset: 0x3a8): _pos	
    <258>   DW_AT_decl_file   : 5	
    <259>   DW_AT_decl_line   : 167	
    <25a>   DW_AT_type        : <0x62>	
    <25e>   DW_AT_data_member_location: 16	
 <2><25f>: Abbrev Number: 0
 <1><260>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <261>   DW_AT_byte_size   : 8	
    <262>   DW_AT_type        : <0x22f>	
 <1><266>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <267>   DW_AT_byte_size   : 8	
    <268>   DW_AT_type        : <0xa7>	
 <1><26c>: Abbrev Number: 11 (DW_TAG_array_type)
    <26d>   DW_AT_type        : <0x95>	
    <271>   DW_AT_sibling     : <0x27c>	
 <2><275>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <276>   DW_AT_type        : <0x86>	
    <27a>   DW_AT_upper_bound : 0	
 <2><27b>: Abbrev Number: 0
 <1><27c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <27d>   DW_AT_byte_size   : 8	
    <27e>   DW_AT_type        : <0x228>	
 <1><282>: Abbrev Number: 11 (DW_TAG_array_type)
    <283>   DW_AT_type        : <0x95>	
    <287>   DW_AT_sibling     : <0x292>	
 <2><28b>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <28c>   DW_AT_type        : <0x86>	
    <290>   DW_AT_upper_bound : 19	
 <2><291>: Abbrev Number: 0
 <1><292>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <293>   DW_AT_byte_size   : 8	
    <294>   DW_AT_type        : <0x298>	
 <1><298>: Abbrev Number: 13 (DW_TAG_const_type)
    <299>   DW_AT_type        : <0x95>	
 <1><29d>: Abbrev Number: 3 (DW_TAG_base_type)
    <29e>   DW_AT_byte_size   : 8	
    <29f>   DW_AT_encoding    : 5	(signed)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x5c0): long long int	
 <1><2a4>: Abbrev Number: 3 (DW_TAG_base_type)
    <2a5>   DW_AT_byte_size   : 8	
    <2a6>   DW_AT_encoding    : 7	(unsigned)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x8c2): long long unsigned int	
 <1><2ab>: Abbrev Number: 3 (DW_TAG_base_type)
    <2ac>   DW_AT_byte_size   : 4	
    <2ad>   DW_AT_encoding    : 4	(float)
    <2ae>   DW_AT_name        : (indirect string, offset: 0x62f): float	
 <1><2b2>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b3>   DW_AT_byte_size   : 8	
    <2b4>   DW_AT_encoding    : 4	(float)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x282e): double	
 <1><2b9>: Abbrev Number: 2 (DW_TAG_typedef)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x22c0): int32	
    <2be>   DW_AT_decl_file   : 6	
    <2bf>   DW_AT_decl_line   : 63	
    <2c0>   DW_AT_type        : <0x62>	
 <1><2c4>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c5>   DW_AT_name        : (indirect string, offset: 0xc69): int16	
    <2c9>   DW_AT_decl_file   : 6	
    <2ca>   DW_AT_decl_line   : 64	
    <2cb>   DW_AT_type        : <0x5b>	
 <1><2cf>: Abbrev Number: 2 (DW_TAG_typedef)
    <2d0>   DW_AT_name        : (indirect string, offset: 0xa89): int8	
    <2d4>   DW_AT_decl_file   : 6	
    <2d5>   DW_AT_decl_line   : 65	
    <2d6>   DW_AT_type        : <0x95>	
 <1><2da>: Abbrev Number: 2 (DW_TAG_typedef)
    <2db>   DW_AT_name        : (indirect string, offset: 0x1ba1): uint32	
    <2df>   DW_AT_decl_file   : 6	
    <2e0>   DW_AT_decl_line   : 66	
    <2e1>   DW_AT_type        : <0x4d>	
 <1><2e5>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e6>   DW_AT_name        : (indirect string, offset: 0xc68): uint16	
    <2ea>   DW_AT_decl_file   : 6	
    <2eb>   DW_AT_decl_line   : 67	
    <2ec>   DW_AT_type        : <0x46>	
 <1><2f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0xa88): uint8	
    <2f5>   DW_AT_decl_file   : 6	
    <2f6>   DW_AT_decl_line   : 68	
    <2f7>   DW_AT_type        : <0x3f>	
 <1><2fb>: Abbrev Number: 2 (DW_TAG_typedef)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x1c93): float32	
    <300>   DW_AT_decl_file   : 6	
    <301>   DW_AT_decl_line   : 69	
    <302>   DW_AT_type        : <0x2ab>	
 <1><306>: Abbrev Number: 2 (DW_TAG_typedef)
    <307>   DW_AT_name        : (indirect string, offset: 0x1b5e): float64	
    <30b>   DW_AT_decl_file   : 6	
    <30c>   DW_AT_decl_line   : 70	
    <30d>   DW_AT_type        : <0x2b2>	
 <1><311>: Abbrev Number: 14 (DW_TAG_union_type)
    <312>   DW_AT_name        : (indirect string, offset: 0x444): anytype_s	
    <316>   DW_AT_byte_size   : 8	
    <317>   DW_AT_decl_file   : 6	
    <318>   DW_AT_decl_line   : 72	
    <319>   DW_AT_sibling     : <0x355>	
 <2><31d>: Abbrev Number: 15 (DW_TAG_member)
    <31e>   DW_AT_name        : ptr	
    <322>   DW_AT_decl_file   : 6	
    <323>   DW_AT_decl_line   : 73	
    <324>   DW_AT_type        : <0x8d>	
 <2><328>: Abbrev Number: 16 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x22c0): int32	
    <32d>   DW_AT_decl_file   : 6	
    <32e>   DW_AT_decl_line   : 74	
    <32f>   DW_AT_type        : <0x2b9>	
 <2><333>: Abbrev Number: 16 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x1ba1): uint32	
    <338>   DW_AT_decl_file   : 6	
    <339>   DW_AT_decl_line   : 75	
    <33a>   DW_AT_type        : <0x2da>	
 <2><33e>: Abbrev Number: 16 (DW_TAG_member)
    <33f>   DW_AT_name        : (indirect string, offset: 0x1c93): float32	
    <343>   DW_AT_decl_file   : 6	
    <344>   DW_AT_decl_line   : 76	
    <345>   DW_AT_type        : <0x2fb>	
 <2><349>: Abbrev Number: 16 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x1b5e): float64	
    <34e>   DW_AT_decl_file   : 6	
    <34f>   DW_AT_decl_line   : 77	
    <350>   DW_AT_type        : <0x306>	
 <2><354>: Abbrev Number: 0
 <1><355>: Abbrev Number: 2 (DW_TAG_typedef)
    <356>   DW_AT_name        : (indirect string, offset: 0x44e): anytype_t	
    <35a>   DW_AT_decl_file   : 6	
    <35b>   DW_AT_decl_line   : 78	
    <35c>   DW_AT_type        : <0x311>	
 <1><360>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <361>   DW_AT_byte_size   : 8	
    <362>   DW_AT_type        : <0x2da>	
 <1><366>: Abbrev Number: 7 (DW_TAG_structure_type)
    <367>   DW_AT_name        : (indirect string, offset: 0x989): gnode_s	
    <36b>   DW_AT_byte_size   : 16	
    <36c>   DW_AT_decl_file   : 7	
    <36d>   DW_AT_decl_line   : 76	
    <36e>   DW_AT_sibling     : <0x38b>	
 <2><372>: Abbrev Number: 8 (DW_TAG_member)
    <373>   DW_AT_name        : (indirect string, offset: 0x2703): data	
    <377>   DW_AT_decl_file   : 7	
    <378>   DW_AT_decl_line   : 77	
    <379>   DW_AT_type        : <0x355>	
    <37d>   DW_AT_data_member_location: 0	
 <2><37e>: Abbrev Number: 8 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0xa02): next	
    <383>   DW_AT_decl_file   : 7	
    <384>   DW_AT_decl_line   : 78	
    <385>   DW_AT_type        : <0x38b>	
    <389>   DW_AT_data_member_location: 8	
 <2><38a>: Abbrev Number: 0
 <1><38b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <38c>   DW_AT_byte_size   : 8	
    <38d>   DW_AT_type        : <0x366>	
 <1><391>: Abbrev Number: 2 (DW_TAG_typedef)
    <392>   DW_AT_name        : (indirect string, offset: 0x3089): gnode_t	
    <396>   DW_AT_decl_file   : 7	
    <397>   DW_AT_decl_line   : 79	
    <398>   DW_AT_type        : <0x366>	
 <1><39c>: Abbrev Number: 2 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0x954): glist_t	
    <3a1>   DW_AT_decl_file   : 7	
    <3a2>   DW_AT_decl_line   : 80	
    <3a3>   DW_AT_type        : <0x3a7>	
 <1><3a7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <3a8>   DW_AT_byte_size   : 8	
    <3a9>   DW_AT_type        : <0x391>	
 <1><3ad>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3ae>   DW_AT_name        : (indirect string, offset: 0x87e): hash_entry_s	
    <3b2>   DW_AT_byte_size   : 24	
    <3b3>   DW_AT_decl_file   : 8	
    <3b4>   DW_AT_decl_line   : 88	
    <3b5>   DW_AT_sibling     : <0x3ea>	
 <2><3b9>: Abbrev Number: 17 (DW_TAG_member)
    <3ba>   DW_AT_name        : key	
    <3be>   DW_AT_decl_file   : 8	
    <3bf>   DW_AT_decl_line   : 89	
    <3c0>   DW_AT_type        : <0x292>	
    <3c4>   DW_AT_data_member_location: 0	
 <2><3c5>: Abbrev Number: 17 (DW_TAG_member)
    <3c6>   DW_AT_name        : len	
    <3ca>   DW_AT_decl_file   : 8	
    <3cb>   DW_AT_decl_line   : 92	
    <3cc>   DW_AT_type        : <0x2b9>	
    <3d0>   DW_AT_data_member_location: 8	
 <2><3d1>: Abbrev Number: 17 (DW_TAG_member)
    <3d2>   DW_AT_name        : val	
    <3d6>   DW_AT_decl_file   : 8	
    <3d7>   DW_AT_decl_line   : 94	
    <3d8>   DW_AT_type        : <0x2b9>	
    <3dc>   DW_AT_data_member_location: 12	
 <2><3dd>: Abbrev Number: 8 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0xa02): next	
    <3e2>   DW_AT_decl_file   : 8	
    <3e3>   DW_AT_decl_line   : 95	
    <3e4>   DW_AT_type        : <0x3ea>	
    <3e8>   DW_AT_data_member_location: 16	
 <2><3e9>: Abbrev Number: 0
 <1><3ea>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 8	
    <3ec>   DW_AT_type        : <0x3ad>	
 <1><3f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <3f1>   DW_AT_name        : (indirect string, offset: 0x88b): hash_entry_t	
    <3f5>   DW_AT_decl_file   : 8	
    <3f6>   DW_AT_decl_line   : 96	
    <3f7>   DW_AT_type        : <0x3ad>	
 <1><3fb>: Abbrev Number: 18 (DW_TAG_structure_type)
    <3fc>   DW_AT_byte_size   : 16	
    <3fd>   DW_AT_decl_file   : 8	
    <3fe>   DW_AT_decl_line   : 98	
    <3ff>   DW_AT_sibling     : <0x428>	
 <2><403>: Abbrev Number: 8 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0x2bc): table	
    <408>   DW_AT_decl_file   : 8	
    <409>   DW_AT_decl_line   : 99	
    <40a>   DW_AT_type        : <0x428>	
    <40e>   DW_AT_data_member_location: 0	
 <2><40f>: Abbrev Number: 8 (DW_TAG_member)
    <410>   DW_AT_name        : (indirect string, offset: 0x1d2c): size	
    <414>   DW_AT_decl_file   : 8	
    <415>   DW_AT_decl_line   : 100	
    <416>   DW_AT_type        : <0x2b9>	
    <41a>   DW_AT_data_member_location: 8	
 <2><41b>: Abbrev Number: 8 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0x1204): nocase	
    <420>   DW_AT_decl_file   : 8	
    <421>   DW_AT_decl_line   : 103	
    <422>   DW_AT_type        : <0x2f0>	
    <426>   DW_AT_data_member_location: 12	
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <429>   DW_AT_byte_size   : 8	
    <42a>   DW_AT_type        : <0x3f0>	
 <1><42e>: Abbrev Number: 2 (DW_TAG_typedef)
    <42f>   DW_AT_name        : (indirect string, offset: 0x19c): hash_table_t	
    <433>   DW_AT_decl_file   : 8	
    <434>   DW_AT_decl_line   : 104	
    <435>   DW_AT_type        : <0x3fb>	
 <1><439>: Abbrev Number: 18 (DW_TAG_structure_type)
    <43a>   DW_AT_byte_size   : 56	
    <43b>   DW_AT_decl_file   : 9	
    <43c>   DW_AT_decl_line   : 83	
    <43d>   DW_AT_sibling     : <0x496>	
 <2><441>: Abbrev Number: 8 (DW_TAG_member)
    <442>   DW_AT_name        : (indirect string, offset: 0x1523): name	
    <446>   DW_AT_decl_file   : 9	
    <447>   DW_AT_decl_line   : 84	
    <448>   DW_AT_type        : <0x292>	
    <44c>   DW_AT_data_member_location: 0	
 <2><44d>: Abbrev Number: 8 (DW_TAG_member)
    <44e>   DW_AT_name        : (indirect string, offset: 0x99d): t_cpu	
    <452>   DW_AT_decl_file   : 9	
    <453>   DW_AT_decl_line   : 86	
    <454>   DW_AT_type        : <0x306>	
    <458>   DW_AT_data_member_location: 8	
 <2><459>: Abbrev Number: 8 (DW_TAG_member)
    <45a>   DW_AT_name        : (indirect string, offset: 0x797): t_elapsed	
    <45e>   DW_AT_decl_file   : 9	
    <45f>   DW_AT_decl_line   : 87	
    <460>   DW_AT_type        : <0x306>	
    <464>   DW_AT_data_member_location: 16	
 <2><465>: Abbrev Number: 8 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0x999): t_tot_cpu	
    <46a>   DW_AT_decl_file   : 9	
    <46b>   DW_AT_decl_line   : 88	
    <46c>   DW_AT_type        : <0x306>	
    <470>   DW_AT_data_member_location: 24	
 <2><471>: Abbrev Number: 8 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0x793): t_tot_elapsed	
    <476>   DW_AT_decl_file   : 9	
    <477>   DW_AT_decl_line   : 89	
    <478>   DW_AT_type        : <0x306>	
    <47c>   DW_AT_data_member_location: 32	
 <2><47d>: Abbrev Number: 8 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0x4da): start_cpu	
    <482>   DW_AT_decl_file   : 9	
    <483>   DW_AT_decl_line   : 90	
    <484>   DW_AT_type        : <0x306>	
    <488>   DW_AT_data_member_location: 40	
 <2><489>: Abbrev Number: 8 (DW_TAG_member)
    <48a>   DW_AT_name        : (indirect string, offset: 0x64f): start_elapsed	
    <48e>   DW_AT_decl_file   : 9	
    <48f>   DW_AT_decl_line   : 91	
    <490>   DW_AT_type        : <0x306>	
    <494>   DW_AT_data_member_location: 48	
 <2><495>: Abbrev Number: 0
 <1><496>: Abbrev Number: 2 (DW_TAG_typedef)
    <497>   DW_AT_name        : (indirect string, offset: 0x1e6): ptmr_t	
    <49b>   DW_AT_decl_file   : 9	
    <49c>   DW_AT_decl_line   : 92	
    <49d>   DW_AT_type        : <0x439>	
 <1><4a1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <4a2>   DW_AT_name        : (indirect string, offset: 0x95c): feat_s	
    <4a6>   DW_AT_byte_size   : 56	
    <4a7>   DW_AT_decl_file   : 10	
    <4a8>   DW_AT_decl_line   : 72	
    <4a9>   DW_AT_sibling     : <0x526>	
 <2><4ad>: Abbrev Number: 8 (DW_TAG_member)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x1523): name	
    <4b2>   DW_AT_decl_file   : 10	
    <4b3>   DW_AT_decl_line   : 73	
    <4b4>   DW_AT_type        : <0x8f>	
    <4b8>   DW_AT_data_member_location: 0	
 <2><4b9>: Abbrev Number: 8 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x162): cepsize	
    <4be>   DW_AT_decl_file   : 10	
    <4bf>   DW_AT_decl_line   : 74	
    <4c0>   DW_AT_type        : <0x2b9>	
    <4c4>   DW_AT_data_member_location: 8	
 <2><4c5>: Abbrev Number: 8 (DW_TAG_member)
    <4c6>   DW_AT_name        : (indirect string, offset: 0x86c): cepsize_used	
    <4ca>   DW_AT_decl_file   : 10	
    <4cb>   DW_AT_decl_line   : 75	
    <4cc>   DW_AT_type        : <0x2b9>	
    <4d0>   DW_AT_data_member_location: 12	
 <2><4d1>: Abbrev Number: 8 (DW_TAG_member)
    <4d2>   DW_AT_name        : (indirect string, offset: 0x1f7): n_stream	
    <4d6>   DW_AT_decl_file   : 10	
    <4d7>   DW_AT_decl_line   : 76	
    <4d8>   DW_AT_type        : <0x2b9>	
    <4dc>   DW_AT_data_member_location: 16	
 <2><4dd>: Abbrev Number: 8 (DW_TAG_member)
    <4de>   DW_AT_name        : (indirect string, offset: 0x8a0): stream_len	
    <4e2>   DW_AT_decl_file   : 10	
    <4e3>   DW_AT_decl_line   : 77	
    <4e4>   DW_AT_type        : <0x526>	
    <4e8>   DW_AT_data_member_location: 24	
 <2><4e9>: Abbrev Number: 8 (DW_TAG_member)
    <4ea>   DW_AT_name        : (indirect string, offset: 0x10c): window_size	
    <4ee>   DW_AT_decl_file   : 10	
    <4ef>   DW_AT_decl_line   : 78	
    <4f0>   DW_AT_type        : <0x2b9>	
    <4f4>   DW_AT_data_member_location: 32	
 <2><4f5>: Abbrev Number: 17 (DW_TAG_member)
    <4f6>   DW_AT_name        : cmn	
    <4fa>   DW_AT_decl_file   : 10	
    <4fb>   DW_AT_decl_line   : 80	
    <4fc>   DW_AT_type        : <0x2b9>	
    <500>   DW_AT_data_member_location: 36	
 <2><501>: Abbrev Number: 8 (DW_TAG_member)
    <502>   DW_AT_name        : (indirect string, offset: 0x981): varnorm	
    <506>   DW_AT_decl_file   : 10	
    <507>   DW_AT_decl_line   : 81	
    <508>   DW_AT_type        : <0x2b9>	
    <50c>   DW_AT_data_member_location: 40	
 <2><50d>: Abbrev Number: 17 (DW_TAG_member)
    <50e>   DW_AT_name        : agc	
    <512>   DW_AT_decl_file   : 10	
    <513>   DW_AT_decl_line   : 83	
    <514>   DW_AT_type        : <0x2b9>	
    <518>   DW_AT_data_member_location: 44	
 <2><519>: Abbrev Number: 8 (DW_TAG_member)
    <51a>   DW_AT_name        : (indirect string, offset: 0x9f4): compute_feat	
    <51e>   DW_AT_decl_file   : 10	
    <51f>   DW_AT_decl_line   : 84	
    <520>   DW_AT_type        : <0x553>	
    <524>   DW_AT_data_member_location: 48	
 <2><525>: Abbrev Number: 0
 <1><526>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <527>   DW_AT_byte_size   : 8	
    <528>   DW_AT_type        : <0x2b9>	
 <1><52c>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <52d>   DW_AT_prototyped  : 1	
    <52d>   DW_AT_sibling     : <0x541>	
 <2><531>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <532>   DW_AT_type        : <0x541>	
 <2><536>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <537>   DW_AT_type        : <0x547>	
 <2><53b>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <53c>   DW_AT_type        : <0x547>	
 <2><540>: Abbrev Number: 0
 <1><541>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <542>   DW_AT_byte_size   : 8	
    <543>   DW_AT_type        : <0x4a1>	
 <1><547>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <548>   DW_AT_byte_size   : 8	
    <549>   DW_AT_type        : <0x54d>	
 <1><54d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <54e>   DW_AT_byte_size   : 8	
    <54f>   DW_AT_type        : <0x2fb>	
 <1><553>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <554>   DW_AT_byte_size   : 8	
    <555>   DW_AT_type        : <0x52c>	
 <1><559>: Abbrev Number: 2 (DW_TAG_typedef)
    <55a>   DW_AT_name        : (indirect string, offset: 0x963): feat_t	
    <55e>   DW_AT_decl_file   : 10	
    <55f>   DW_AT_decl_line   : 90	
    <560>   DW_AT_type        : <0x4a1>	
 <1><564>: Abbrev Number: 18 (DW_TAG_structure_type)
    <565>   DW_AT_byte_size   : 24	
    <566>   DW_AT_decl_file   : 11	
    <567>   DW_AT_decl_line   : 46	
    <568>   DW_AT_sibling     : <0x5a7>	
 <2><56c>: Abbrev Number: 8 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0x624): ascr	
    <571>   DW_AT_decl_file   : 11	
    <572>   DW_AT_decl_line   : 47	
    <573>   DW_AT_type        : <0x2b9>	
    <577>   DW_AT_data_member_location: 0	
 <2><578>: Abbrev Number: 8 (DW_TAG_member)
    <579>   DW_AT_name        : (indirect string, offset: 0xd7): lscr	
    <57d>   DW_AT_decl_file   : 11	
    <57e>   DW_AT_decl_line   : 48	
    <57f>   DW_AT_type        : <0x2b9>	
    <583>   DW_AT_data_member_location: 4	
 <2><584>: Abbrev Number: 8 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0x163f): word	
    <589>   DW_AT_decl_file   : 11	
    <58a>   DW_AT_decl_line   : 49	
    <58b>   DW_AT_type        : <0x8f>	
    <58f>   DW_AT_data_member_location: 8	
 <2><590>: Abbrev Number: 17 (DW_TAG_member)
    <591>   DW_AT_name        : sf	
    <594>   DW_AT_decl_file   : 11	
    <595>   DW_AT_decl_line   : 50	
    <596>   DW_AT_type        : <0x2b9>	
    <59a>   DW_AT_data_member_location: 16	
 <2><59b>: Abbrev Number: 17 (DW_TAG_member)
    <59c>   DW_AT_name        : ef	
    <59f>   DW_AT_decl_file   : 11	
    <5a0>   DW_AT_decl_line   : 51	
    <5a1>   DW_AT_type        : <0x2b9>	
    <5a5>   DW_AT_data_member_location: 20	
 <2><5a6>: Abbrev Number: 0
 <1><5a7>: Abbrev Number: 2 (DW_TAG_typedef)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x177): partialhyp_t	
    <5ac>   DW_AT_decl_file   : 11	
    <5ad>   DW_AT_decl_line   : 52	
    <5ae>   DW_AT_type        : <0x564>	
 <1><5b2>: Abbrev Number: 18 (DW_TAG_structure_type)
    <5b3>   DW_AT_byte_size   : 40	
    <5b4>   DW_AT_decl_file   : 12	
    <5b5>   DW_AT_decl_line   : 95	
    <5b6>   DW_AT_sibling     : <0x5f7>	
 <2><5ba>: Abbrev Number: 8 (DW_TAG_member)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x1ecf): n_comp	
    <5bf>   DW_AT_decl_file   : 12	
    <5c0>   DW_AT_decl_line   : 96	
    <5c1>   DW_AT_type        : <0x2b9>	
    <5c5>   DW_AT_data_member_location: 0	
 <2><5c6>: Abbrev Number: 8 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x13f7): mean	
    <5cb>   DW_AT_decl_file   : 12	
    <5cc>   DW_AT_decl_line   : 98	
    <5cd>   DW_AT_type        : <0x547>	
    <5d1>   DW_AT_data_member_location: 8	
 <2><5d2>: Abbrev Number: 17 (DW_TAG_member)
    <5d3>   DW_AT_name        : var	
    <5d7>   DW_AT_decl_file   : 12	
    <5d8>   DW_AT_decl_line   : 99	
    <5d9>   DW_AT_type        : <0x547>	
    <5dd>   DW_AT_data_member_location: 16	
 <2><5de>: Abbrev Number: 17 (DW_TAG_member)
    <5df>   DW_AT_name        : lrd	
    <5e3>   DW_AT_decl_file   : 12	
    <5e4>   DW_AT_decl_line   : 102	
    <5e5>   DW_AT_type        : <0x54d>	
    <5e9>   DW_AT_data_member_location: 24	
 <2><5ea>: Abbrev Number: 8 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x2f8): mixw	
    <5ef>   DW_AT_decl_file   : 12	
    <5f0>   DW_AT_decl_line   : 105	
    <5f1>   DW_AT_type        : <0x526>	
    <5f5>   DW_AT_data_member_location: 32	
 <2><5f6>: Abbrev Number: 0
 <1><5f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x6bc): mgau_t	
    <5fc>   DW_AT_decl_file   : 12	
    <5fd>   DW_AT_decl_line   : 108	
    <5fe>   DW_AT_type        : <0x5b2>	
 <1><602>: Abbrev Number: 18 (DW_TAG_structure_type)
    <603>   DW_AT_byte_size   : 48	
    <604>   DW_AT_decl_file   : 12	
    <605>   DW_AT_decl_line   : 116	
    <606>   DW_AT_sibling     : <0x66b>	
 <2><60a>: Abbrev Number: 8 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x16a): n_mgau	
    <60f>   DW_AT_decl_file   : 12	
    <610>   DW_AT_decl_line   : 117	
    <611>   DW_AT_type        : <0x2b9>	
    <615>   DW_AT_data_member_location: 0	
 <2><616>: Abbrev Number: 8 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0x18c): max_comp	
    <61b>   DW_AT_decl_file   : 12	
    <61c>   DW_AT_decl_line   : 118	
    <61d>   DW_AT_type        : <0x2b9>	
    <621>   DW_AT_data_member_location: 4	
 <2><622>: Abbrev Number: 8 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0xa49): veclen	
    <627>   DW_AT_decl_file   : 12	
    <628>   DW_AT_decl_line   : 119	
    <629>   DW_AT_type        : <0x2b9>	
    <62d>   DW_AT_data_member_location: 8	
 <2><62e>: Abbrev Number: 8 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x16c): mgau	
    <633>   DW_AT_decl_file   : 12	
    <634>   DW_AT_decl_line   : 120	
    <635>   DW_AT_type        : <0x66b>	
    <639>   DW_AT_data_member_location: 16	
 <2><63a>: Abbrev Number: 8 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x8f2): distfloor	
    <63f>   DW_AT_decl_file   : 12	
    <640>   DW_AT_decl_line   : 121	
    <641>   DW_AT_type        : <0x306>	
    <645>   DW_AT_data_member_location: 24	
 <2><646>: Abbrev Number: 8 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x3c6): frm_sen_eval	
    <64b>   DW_AT_decl_file   : 12	
    <64c>   DW_AT_decl_line   : 124	
    <64d>   DW_AT_type        : <0x2b9>	
    <651>   DW_AT_data_member_location: 32	
 <2><652>: Abbrev Number: 8 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0xa7b): frm_gau_eval	
    <657>   DW_AT_decl_file   : 12	
    <658>   DW_AT_decl_line   : 125	
    <659>   DW_AT_type        : <0x2b9>	
    <65d>   DW_AT_data_member_location: 36	
 <2><65e>: Abbrev Number: 8 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x61b): gau_type	
    <663>   DW_AT_decl_file   : 12	
    <664>   DW_AT_decl_line   : 126	
    <665>   DW_AT_type        : <0x2b9>	
    <669>   DW_AT_data_member_location: 40	
 <2><66a>: Abbrev Number: 0
 <1><66b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <66c>   DW_AT_byte_size   : 8	
    <66d>   DW_AT_type        : <0x5f7>	
 <1><671>: Abbrev Number: 2 (DW_TAG_typedef)
    <672>   DW_AT_name        : (indirect string, offset: 0xf0): mgau_model_t	
    <676>   DW_AT_decl_file   : 12	
    <677>   DW_AT_decl_line   : 129	
    <678>   DW_AT_type        : <0x602>	
 <1><67c>: Abbrev Number: 2 (DW_TAG_typedef)
    <67d>   DW_AT_name        : (indirect string, offset: 0x92b): s3cipid_t	
    <681>   DW_AT_decl_file   : 13	
    <682>   DW_AT_decl_line   : 75	
    <683>   DW_AT_type        : <0x2cf>	
 <1><687>: Abbrev Number: 2 (DW_TAG_typedef)
    <688>   DW_AT_name        : (indirect string, offset: 0x41a): s3pid_t	
    <68c>   DW_AT_decl_file   : 13	
    <68d>   DW_AT_decl_line   : 81	
    <68e>   DW_AT_type        : <0x2b9>	
 <1><692>: Abbrev Number: 2 (DW_TAG_typedef)
    <693>   DW_AT_name        : (indirect string, offset: 0xb3b): s3ssid_t	
    <697>   DW_AT_decl_file   : 13	
    <698>   DW_AT_decl_line   : 87	
    <699>   DW_AT_type        : <0x687>	
 <1><69d>: Abbrev Number: 2 (DW_TAG_typedef)
    <69e>   DW_AT_name        : (indirect string, offset: 0x51d): s3tmatid_t	
    <6a2>   DW_AT_decl_file   : 13	
    <6a3>   DW_AT_decl_line   : 93	
    <6a4>   DW_AT_type        : <0x2b9>	
 <1><6a8>: Abbrev Number: 2 (DW_TAG_typedef)
    <6a9>   DW_AT_name        : (indirect string, offset: 0x2e6): s3wid_t	
    <6ad>   DW_AT_decl_file   : 13	
    <6ae>   DW_AT_decl_line   : 99	
    <6af>   DW_AT_type        : <0x2b9>	
 <1><6b3>: Abbrev Number: 2 (DW_TAG_typedef)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x1d1): s3lmwid_t	
    <6b8>   DW_AT_decl_file   : 13	
    <6b9>   DW_AT_decl_line   : 105	
    <6ba>   DW_AT_type        : <0x2e5>	
 <1><6be>: Abbrev Number: 2 (DW_TAG_typedef)
    <6bf>   DW_AT_name        : (indirect string, offset: 0xad3): s3frmid_t	
    <6c3>   DW_AT_decl_file   : 13	
    <6c4>   DW_AT_decl_line   : 117	
    <6c5>   DW_AT_type        : <0x2c4>	
 <1><6c9>: Abbrev Number: 2 (DW_TAG_typedef)
    <6ca>   DW_AT_name        : (indirect string, offset: 0x3e): s3senid_t	
    <6ce>   DW_AT_decl_file   : 13	
    <6cf>   DW_AT_decl_line   : 123	
    <6d0>   DW_AT_type        : <0x2c4>	
 <1><6d4>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <6d5>   DW_AT_byte_size   : 4	
    <6d6>   DW_AT_decl_file   : 14	
    <6d7>   DW_AT_decl_line   : 72	
    <6d8>   DW_AT_sibling     : <0x6fb>	
 <2><6dc>: Abbrev Number: 22 (DW_TAG_enumerator)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x557): WORD_POSN_BEGIN	
    <6e1>   DW_AT_const_value : 0	
 <2><6e2>: Abbrev Number: 22 (DW_TAG_enumerator)
    <6e3>   DW_AT_name        : (indirect string, offset: 0x68c): WORD_POSN_END	
    <6e7>   DW_AT_const_value : 1	
 <2><6e8>: Abbrev Number: 22 (DW_TAG_enumerator)
    <6e9>   DW_AT_name        : (indirect string, offset: 0x813): WORD_POSN_SINGLE	
    <6ed>   DW_AT_const_value : 2	
 <2><6ee>: Abbrev Number: 22 (DW_TAG_enumerator)
    <6ef>   DW_AT_name        : (indirect string, offset: 0x672): WORD_POSN_INTERNAL	
    <6f3>   DW_AT_const_value : 3	
 <2><6f4>: Abbrev Number: 22 (DW_TAG_enumerator)
    <6f5>   DW_AT_name        : (indirect string, offset: 0xb8e): WORD_POSN_UNDEFINED	
    <6f9>   DW_AT_const_value : 4	
 <2><6fa>: Abbrev Number: 0
 <1><6fb>: Abbrev Number: 2 (DW_TAG_typedef)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x56c): word_posn_t	
    <700>   DW_AT_decl_file   : 14	
    <701>   DW_AT_decl_line   : 78	
    <702>   DW_AT_type        : <0x6d4>	
 <1><706>: Abbrev Number: 18 (DW_TAG_structure_type)
    <707>   DW_AT_byte_size   : 16	
    <708>   DW_AT_decl_file   : 14	
    <709>   DW_AT_decl_line   : 84	
    <70a>   DW_AT_sibling     : <0x727>	
 <2><70e>: Abbrev Number: 8 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0x1523): name	
    <713>   DW_AT_decl_file   : 14	
    <714>   DW_AT_decl_line   : 85	
    <715>   DW_AT_type        : <0x8f>	
    <719>   DW_AT_data_member_location: 0	
 <2><71a>: Abbrev Number: 8 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0x2a4): filler	
    <71f>   DW_AT_decl_file   : 14	
    <720>   DW_AT_decl_line   : 86	
    <721>   DW_AT_type        : <0x2b9>	
    <725>   DW_AT_data_member_location: 8	
 <2><726>: Abbrev Number: 0
 <1><727>: Abbrev Number: 2 (DW_TAG_typedef)
    <728>   DW_AT_name        : (indirect string, offset: 0x935): ciphone_t	
    <72c>   DW_AT_decl_file   : 14	
    <72d>   DW_AT_decl_line   : 88	
    <72e>   DW_AT_type        : <0x706>	
 <1><732>: Abbrev Number: 18 (DW_TAG_structure_type)
    <733>   DW_AT_byte_size   : 16	
    <734>   DW_AT_decl_file   : 14	
    <735>   DW_AT_decl_line   : 94	
    <736>   DW_AT_sibling     : <0x780>	
 <2><73a>: Abbrev Number: 8 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x22f8): ssid	
    <73f>   DW_AT_decl_file   : 14	
    <740>   DW_AT_decl_line   : 95	
    <741>   DW_AT_type        : <0x692>	
    <745>   DW_AT_data_member_location: 0	
 <2><746>: Abbrev Number: 8 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x867): tmat	
    <74b>   DW_AT_decl_file   : 14	
    <74c>   DW_AT_decl_line   : 98	
    <74d>   DW_AT_type        : <0x69d>	
    <751>   DW_AT_data_member_location: 4	
 <2><752>: Abbrev Number: 17 (DW_TAG_member)
    <753>   DW_AT_name        : ci	
    <756>   DW_AT_decl_file   : 14	
    <757>   DW_AT_decl_line   : 99	
    <758>   DW_AT_type        : <0x67c>	
    <75c>   DW_AT_data_member_location: 8	
 <2><75d>: Abbrev Number: 17 (DW_TAG_member)
    <75e>   DW_AT_name        : lc	
    <761>   DW_AT_decl_file   : 14	
    <762>   DW_AT_decl_line   : 99	
    <763>   DW_AT_type        : <0x67c>	
    <767>   DW_AT_data_member_location: 9	
 <2><768>: Abbrev Number: 17 (DW_TAG_member)
    <769>   DW_AT_name        : rc	
    <76c>   DW_AT_decl_file   : 14	
    <76d>   DW_AT_decl_line   : 99	
    <76e>   DW_AT_type        : <0x67c>	
    <772>   DW_AT_data_member_location: 10	
 <2><773>: Abbrev Number: 8 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0x9ef): wpos	
    <778>   DW_AT_decl_file   : 14	
    <779>   DW_AT_decl_line   : 100	
    <77a>   DW_AT_type        : <0x6fb>	
    <77e>   DW_AT_data_member_location: 12	
 <2><77f>: Abbrev Number: 0
 <1><780>: Abbrev Number: 2 (DW_TAG_typedef)
    <781>   DW_AT_name        : (indirect string, offset: 0x937): phone_t	
    <785>   DW_AT_decl_file   : 14	
    <786>   DW_AT_decl_line   : 101	
    <787>   DW_AT_type        : <0x732>	
 <1><78b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <78c>   DW_AT_name        : (indirect string, offset: 0x3ad): ph_rc_s	
    <790>   DW_AT_byte_size   : 16	
    <791>   DW_AT_decl_file   : 14	
    <792>   DW_AT_decl_line   : 108	
    <793>   DW_AT_sibling     : <0x7bb>	
 <2><797>: Abbrev Number: 17 (DW_TAG_member)
    <798>   DW_AT_name        : rc	
    <79b>   DW_AT_decl_file   : 14	
    <79c>   DW_AT_decl_line   : 109	
    <79d>   DW_AT_type        : <0x67c>	
    <7a1>   DW_AT_data_member_location: 0	
 <2><7a2>: Abbrev Number: 17 (DW_TAG_member)
    <7a3>   DW_AT_name        : pid	
    <7a7>   DW_AT_decl_file   : 14	
    <7a8>   DW_AT_decl_line   : 110	
    <7a9>   DW_AT_type        : <0x687>	
    <7ad>   DW_AT_data_member_location: 4	
 <2><7ae>: Abbrev Number: 8 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0xa02): next	
    <7b3>   DW_AT_decl_file   : 14	
    <7b4>   DW_AT_decl_line   : 111	
    <7b5>   DW_AT_type        : <0x7bb>	
    <7b9>   DW_AT_data_member_location: 8	
 <2><7ba>: Abbrev Number: 0
 <1><7bb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <7bc>   DW_AT_byte_size   : 8	
    <7bd>   DW_AT_type        : <0x78b>	
 <1><7c1>: Abbrev Number: 2 (DW_TAG_typedef)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x3b5): ph_rc_t	
    <7c6>   DW_AT_decl_file   : 14	
    <7c7>   DW_AT_decl_line   : 112	
    <7c8>   DW_AT_type        : <0x78b>	
 <1><7cc>: Abbrev Number: 7 (DW_TAG_structure_type)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x342): ph_lc_s	
    <7d1>   DW_AT_byte_size   : 24	
    <7d2>   DW_AT_decl_file   : 14	
    <7d3>   DW_AT_decl_line   : 114	
    <7d4>   DW_AT_sibling     : <0x7fc>	
 <2><7d8>: Abbrev Number: 17 (DW_TAG_member)
    <7d9>   DW_AT_name        : lc	
    <7dc>   DW_AT_decl_file   : 14	
    <7dd>   DW_AT_decl_line   : 115	
    <7de>   DW_AT_type        : <0x67c>	
    <7e2>   DW_AT_data_member_location: 0	
 <2><7e3>: Abbrev Number: 8 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0x94d): rclist	
    <7e8>   DW_AT_decl_file   : 14	
    <7e9>   DW_AT_decl_line   : 116	
    <7ea>   DW_AT_type        : <0x7fc>	
    <7ee>   DW_AT_data_member_location: 8	
 <2><7ef>: Abbrev Number: 8 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0xa02): next	
    <7f4>   DW_AT_decl_file   : 14	
    <7f5>   DW_AT_decl_line   : 117	
    <7f6>   DW_AT_type        : <0x802>	
    <7fa>   DW_AT_data_member_location: 16	
 <2><7fb>: Abbrev Number: 0
 <1><7fc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <7fd>   DW_AT_byte_size   : 8	
    <7fe>   DW_AT_type        : <0x7c1>	
 <1><802>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <803>   DW_AT_byte_size   : 8	
    <804>   DW_AT_type        : <0x7cc>	
 <1><808>: Abbrev Number: 2 (DW_TAG_typedef)
    <809>   DW_AT_name        : (indirect string, offset: 0x34a): ph_lc_t	
    <80d>   DW_AT_decl_file   : 14	
    <80e>   DW_AT_decl_line   : 118	
    <80f>   DW_AT_type        : <0x7cc>	
 <1><813>: Abbrev Number: 18 (DW_TAG_structure_type)
    <814>   DW_AT_byte_size   : 104	
    <815>   DW_AT_decl_file   : 14	
    <816>   DW_AT_decl_line   : 122	
    <817>   DW_AT_sibling     : <0x8dc>	
 <2><81b>: Abbrev Number: 8 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0x490): n_ciphone	
    <820>   DW_AT_decl_file   : 14	
    <821>   DW_AT_decl_line   : 123	
    <822>   DW_AT_type        : <0x2b9>	
    <826>   DW_AT_data_member_location: 0	
 <2><827>: Abbrev Number: 8 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0xbca): n_phone	
    <82c>   DW_AT_decl_file   : 14	
    <82d>   DW_AT_decl_line   : 124	
    <82e>   DW_AT_type        : <0x2b9>	
    <832>   DW_AT_data_member_location: 4	
 <2><833>: Abbrev Number: 8 (DW_TAG_member)
    <834>   DW_AT_name        : (indirect string, offset: 0xadd): n_emit_state	
    <838>   DW_AT_decl_file   : 14	
    <839>   DW_AT_decl_line   : 125	
    <83a>   DW_AT_type        : <0x2b9>	
    <83e>   DW_AT_data_member_location: 8	
 <2><83f>: Abbrev Number: 8 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0xa38): n_ci_sen	
    <844>   DW_AT_decl_file   : 14	
    <845>   DW_AT_decl_line   : 126	
    <846>   DW_AT_type        : <0x2b9>	
    <84a>   DW_AT_data_member_location: 12	
 <2><84b>: Abbrev Number: 8 (DW_TAG_member)
    <84c>   DW_AT_name        : (indirect string, offset: 0x83): n_sen	
    <850>   DW_AT_decl_file   : 14	
    <851>   DW_AT_decl_line   : 127	
    <852>   DW_AT_type        : <0x2b9>	
    <856>   DW_AT_data_member_location: 16	
 <2><857>: Abbrev Number: 8 (DW_TAG_member)
    <858>   DW_AT_name        : (indirect string, offset: 0x865): n_tmat	
    <85c>   DW_AT_decl_file   : 14	
    <85d>   DW_AT_decl_line   : 128	
    <85e>   DW_AT_type        : <0x2b9>	
    <862>   DW_AT_data_member_location: 20	
 <2><863>: Abbrev Number: 8 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x762): ciphone_ht	
    <868>   DW_AT_decl_file   : 14	
    <869>   DW_AT_decl_line   : 130	
    <86a>   DW_AT_type        : <0x8dc>	
    <86e>   DW_AT_data_member_location: 24	
 <2><86f>: Abbrev Number: 8 (DW_TAG_member)
    <870>   DW_AT_name        : (indirect string, offset: 0x492): ciphone	
    <874>   DW_AT_decl_file   : 14	
    <875>   DW_AT_decl_line   : 131	
    <876>   DW_AT_type        : <0x8e2>	
    <87a>   DW_AT_data_member_location: 32	
 <2><87b>: Abbrev Number: 8 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0xbcc): phone	
    <880>   DW_AT_decl_file   : 14	
    <881>   DW_AT_decl_line   : 132	
    <882>   DW_AT_type        : <0x8e8>	
    <886>   DW_AT_data_member_location: 40	
 <2><887>: Abbrev Number: 8 (DW_TAG_member)
    <888>   DW_AT_name        : (indirect string, offset: 0x39a): sseq	
    <88c>   DW_AT_decl_file   : 14	
    <88d>   DW_AT_decl_line   : 133	
    <88e>   DW_AT_type        : <0x8ee>	
    <892>   DW_AT_data_member_location: 48	
 <2><893>: Abbrev Number: 8 (DW_TAG_member)
    <894>   DW_AT_name        : (indirect string, offset: 0x398): n_sseq	
    <898>   DW_AT_decl_file   : 14	
    <899>   DW_AT_decl_line   : 135	
    <89a>   DW_AT_type        : <0x2b9>	
    <89e>   DW_AT_data_member_location: 56	
 <2><89f>: Abbrev Number: 8 (DW_TAG_member)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x3fa): cd2cisen	
    <8a4>   DW_AT_decl_file   : 14	
    <8a5>   DW_AT_decl_line   : 137	
    <8a6>   DW_AT_type        : <0x8f4>	
    <8aa>   DW_AT_data_member_location: 64	
 <2><8ab>: Abbrev Number: 8 (DW_TAG_member)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x635): sen2cimap	
    <8b0>   DW_AT_decl_file   : 14	
    <8b1>   DW_AT_decl_line   : 140	
    <8b2>   DW_AT_type        : <0x8fa>	
    <8b6>   DW_AT_data_member_location: 72	
 <2><8b7>: Abbrev Number: 8 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0xaaf): ciphone2n_cd_sen	
    <8bc>   DW_AT_decl_file   : 14	
    <8bd>   DW_AT_decl_line   : 141	
    <8be>   DW_AT_type        : <0x526>	
    <8c2>   DW_AT_data_member_location: 80	
 <2><8c3>: Abbrev Number: 17 (DW_TAG_member)
    <8c4>   DW_AT_name        : sil	
    <8c8>   DW_AT_decl_file   : 14	
    <8c9>   DW_AT_decl_line   : 143	
    <8ca>   DW_AT_type        : <0x67c>	
    <8ce>   DW_AT_data_member_location: 88	
 <2><8cf>: Abbrev Number: 8 (DW_TAG_member)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x5dd): wpos_ci_lclist	
    <8d4>   DW_AT_decl_file   : 14	
    <8d5>   DW_AT_decl_line   : 145	
    <8d6>   DW_AT_type        : <0x900>	
    <8da>   DW_AT_data_member_location: 96	
 <2><8db>: Abbrev Number: 0
 <1><8dc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8dd>   DW_AT_byte_size   : 8	
    <8de>   DW_AT_type        : <0x42e>	
 <1><8e2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8e3>   DW_AT_byte_size   : 8	
    <8e4>   DW_AT_type        : <0x727>	
 <1><8e8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8e9>   DW_AT_byte_size   : 8	
    <8ea>   DW_AT_type        : <0x780>	
 <1><8ee>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8ef>   DW_AT_byte_size   : 8	
    <8f0>   DW_AT_type        : <0x8f4>	
 <1><8f4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8f5>   DW_AT_byte_size   : 8	
    <8f6>   DW_AT_type        : <0x6c9>	
 <1><8fa>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8fb>   DW_AT_byte_size   : 8	
    <8fc>   DW_AT_type        : <0x67c>	
 <1><900>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <901>   DW_AT_byte_size   : 8	
    <902>   DW_AT_type        : <0x906>	
 <1><906>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <907>   DW_AT_byte_size   : 8	
    <908>   DW_AT_type        : <0x90c>	
 <1><90c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <90d>   DW_AT_byte_size   : 8	
    <90e>   DW_AT_type        : <0x808>	
 <1><912>: Abbrev Number: 2 (DW_TAG_typedef)
    <913>   DW_AT_name        : (indirect string, offset: 0x48): mdef_t	
    <917>   DW_AT_decl_file   : 14	
    <918>   DW_AT_decl_line   : 150	
    <919>   DW_AT_type        : <0x813>	
 <1><91d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <91e>   DW_AT_byte_size   : 40	
    <91f>   DW_AT_decl_file   : 15	
    <920>   DW_AT_decl_line   : 71	
    <921>   DW_AT_sibling     : <0x97a>	
 <2><925>: Abbrev Number: 8 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x163f): word	
    <92a>   DW_AT_decl_file   : 15	
    <92b>   DW_AT_decl_line   : 72	
    <92c>   DW_AT_type        : <0x8f>	
    <930>   DW_AT_data_member_location: 0	
 <2><931>: Abbrev Number: 8 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0x492): ciphone	
    <936>   DW_AT_decl_file   : 15	
    <937>   DW_AT_decl_line   : 73	
    <938>   DW_AT_type        : <0x8fa>	
    <93c>   DW_AT_data_member_location: 8	
 <2><93d>: Abbrev Number: 8 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0xc42): pronlen	
    <942>   DW_AT_decl_file   : 15	
    <943>   DW_AT_decl_line   : 74	
    <944>   DW_AT_type        : <0x2b9>	
    <948>   DW_AT_data_member_location: 16	
 <2><949>: Abbrev Number: 17 (DW_TAG_member)
    <94a>   DW_AT_name        : alt	
    <94e>   DW_AT_decl_file   : 15	
    <94f>   DW_AT_decl_line   : 75	
    <950>   DW_AT_type        : <0x6a8>	
    <954>   DW_AT_data_member_location: 20	
 <2><955>: Abbrev Number: 8 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x15f5): basewid	
    <95a>   DW_AT_decl_file   : 15	
    <95b>   DW_AT_decl_line   : 76	
    <95c>   DW_AT_type        : <0x6a8>	
    <960>   DW_AT_data_member_location: 24	
 <2><961>: Abbrev Number: 8 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x1ecf): n_comp	
    <966>   DW_AT_decl_file   : 15	
    <967>   DW_AT_decl_line   : 77	
    <968>   DW_AT_type        : <0x2b9>	
    <96c>   DW_AT_data_member_location: 28	
 <2><96d>: Abbrev Number: 8 (DW_TAG_member)
    <96e>   DW_AT_name        : (indirect string, offset: 0x15cf): comp	
    <972>   DW_AT_decl_file   : 15	
    <973>   DW_AT_decl_line   : 81	
    <974>   DW_AT_type        : <0x97a>	
    <978>   DW_AT_data_member_location: 32	
 <2><979>: Abbrev Number: 0
 <1><97a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <97b>   DW_AT_byte_size   : 8	
    <97c>   DW_AT_type        : <0x6a8>	
 <1><980>: Abbrev Number: 2 (DW_TAG_typedef)
    <981>   DW_AT_name        : (indirect string, offset: 0x4eb): dictword_t	
    <985>   DW_AT_decl_file   : 15	
    <986>   DW_AT_decl_line   : 82	
    <987>   DW_AT_type        : <0x91d>	
 <1><98b>: Abbrev Number: 18 (DW_TAG_structure_type)
    <98c>   DW_AT_byte_size   : 88	
    <98d>   DW_AT_decl_file   : 15	
    <98e>   DW_AT_decl_line   : 84	
    <98f>   DW_AT_sibling     : <0xa3b>	
 <2><993>: Abbrev Number: 8 (DW_TAG_member)
    <994>   DW_AT_name        : (indirect string, offset: 0x833): mdef	
    <998>   DW_AT_decl_file   : 15	
    <999>   DW_AT_decl_line   : 85	
    <99a>   DW_AT_type        : <0xa3b>	
    <99e>   DW_AT_data_member_location: 0	
 <2><99f>: Abbrev Number: 17 (DW_TAG_member)
    <9a0>   DW_AT_name        : pht	
    <9a4>   DW_AT_decl_file   : 15	
    <9a5>   DW_AT_decl_line   : 86	
    <9a6>   DW_AT_type        : <0x8dc>	
    <9aa>   DW_AT_data_member_location: 8	
 <2><9ab>: Abbrev Number: 8 (DW_TAG_member)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x2582): ciphone_str	
    <9b0>   DW_AT_decl_file   : 15	
    <9b1>   DW_AT_decl_line   : 87	
    <9b2>   DW_AT_type        : <0xa41>	
    <9b6>   DW_AT_data_member_location: 16	
 <2><9b7>: Abbrev Number: 8 (DW_TAG_member)
    <9b8>   DW_AT_name        : (indirect string, offset: 0x490): n_ciphone	
    <9bc>   DW_AT_decl_file   : 15	
    <9bd>   DW_AT_decl_line   : 88	
    <9be>   DW_AT_type        : <0x2b9>	
    <9c2>   DW_AT_data_member_location: 24	
 <2><9c3>: Abbrev Number: 8 (DW_TAG_member)
    <9c4>   DW_AT_name        : (indirect string, offset: 0x163f): word	
    <9c8>   DW_AT_decl_file   : 15	
    <9c9>   DW_AT_decl_line   : 89	
    <9ca>   DW_AT_type        : <0xa47>	
    <9ce>   DW_AT_data_member_location: 32	
 <2><9cf>: Abbrev Number: 17 (DW_TAG_member)
    <9d0>   DW_AT_name        : ht	
    <9d3>   DW_AT_decl_file   : 15	
    <9d4>   DW_AT_decl_line   : 90	
    <9d5>   DW_AT_type        : <0x8dc>	
    <9d9>   DW_AT_data_member_location: 40	
 <2><9da>: Abbrev Number: 8 (DW_TAG_member)
    <9db>   DW_AT_name        : (indirect string, offset: 0xba2): max_words	
    <9df>   DW_AT_decl_file   : 15	
    <9e0>   DW_AT_decl_line   : 91	
    <9e1>   DW_AT_type        : <0x2b9>	
    <9e5>   DW_AT_data_member_location: 48	
 <2><9e6>: Abbrev Number: 8 (DW_TAG_member)
    <9e7>   DW_AT_name        : (indirect string, offset: 0xc2b): n_word	
    <9eb>   DW_AT_decl_file   : 15	
    <9ec>   DW_AT_decl_line   : 92	
    <9ed>   DW_AT_type        : <0x2b9>	
    <9f1>   DW_AT_data_member_location: 52	
 <2><9f2>: Abbrev Number: 8 (DW_TAG_member)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x335): filler_start	
    <9f7>   DW_AT_decl_file   : 15	
    <9f8>   DW_AT_decl_line   : 93	
    <9f9>   DW_AT_type        : <0x2b9>	
    <9fd>   DW_AT_data_member_location: 56	
 <2><9fe>: Abbrev Number: 8 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x3d3): filler_end	
    <a03>   DW_AT_decl_file   : 15	
    <a04>   DW_AT_decl_line   : 94	
    <a05>   DW_AT_type        : <0x2b9>	
    <a09>   DW_AT_data_member_location: 60	
 <2><a0a>: Abbrev Number: 8 (DW_TAG_member)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x1577): comp_head	
    <a0f>   DW_AT_decl_file   : 15	
    <a10>   DW_AT_decl_line   : 95	
    <a11>   DW_AT_type        : <0x97a>	
    <a15>   DW_AT_data_member_location: 64	
 <2><a16>: Abbrev Number: 8 (DW_TAG_member)
    <a17>   DW_AT_name        : (indirect string, offset: 0x2ab): startwid	
    <a1b>   DW_AT_decl_file   : 15	
    <a1c>   DW_AT_decl_line   : 98	
    <a1d>   DW_AT_type        : <0x6a8>	
    <a21>   DW_AT_data_member_location: 72	
 <2><a22>: Abbrev Number: 8 (DW_TAG_member)
    <a23>   DW_AT_name        : (indirect string, offset: 0x1ed): finishwid	
    <a27>   DW_AT_decl_file   : 15	
    <a28>   DW_AT_decl_line   : 99	
    <a29>   DW_AT_type        : <0x6a8>	
    <a2d>   DW_AT_data_member_location: 76	
 <2><a2e>: Abbrev Number: 8 (DW_TAG_member)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x8ab): silwid	
    <a33>   DW_AT_decl_file   : 15	
    <a34>   DW_AT_decl_line   : 100	
    <a35>   DW_AT_type        : <0x6a8>	
    <a39>   DW_AT_data_member_location: 80	
 <2><a3a>: Abbrev Number: 0
 <1><a3b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a3c>   DW_AT_byte_size   : 8	
    <a3d>   DW_AT_type        : <0x912>	
 <1><a41>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a42>   DW_AT_byte_size   : 8	
    <a43>   DW_AT_type        : <0x8f>	
 <1><a47>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a48>   DW_AT_byte_size   : 8	
    <a49>   DW_AT_type        : <0x980>	
 <1><a4d>: Abbrev Number: 2 (DW_TAG_typedef)
    <a4e>   DW_AT_name        : (indirect string, offset: 0x685): dict_t	
    <a52>   DW_AT_decl_file   : 15	
    <a53>   DW_AT_decl_line   : 101	
    <a54>   DW_AT_type        : <0x98b>	
 <1><a58>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a59>   DW_AT_byte_size   : 56	
    <a5a>   DW_AT_decl_file   : 16	
    <a5b>   DW_AT_decl_line   : 99	
    <a5c>   DW_AT_sibling     : <0xac1>	
 <2><a60>: Abbrev Number: 8 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0x5d4): internal	
    <a65>   DW_AT_decl_file   : 16	
    <a66>   DW_AT_decl_line   : 100	
    <a67>   DW_AT_type        : <0xac1>	
    <a6b>   DW_AT_data_member_location: 0	
 <2><a6c>: Abbrev Number: 8 (DW_TAG_member)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x9d8): ldiph_lc	
    <a71>   DW_AT_decl_file   : 16	
    <a72>   DW_AT_decl_line   : 103	
    <a73>   DW_AT_type        : <0xacd>	
    <a77>   DW_AT_data_member_location: 8	
 <2><a78>: Abbrev Number: 8 (DW_TAG_member)
    <a79>   DW_AT_name        : (indirect string, offset: 0x3f0): single_lc	
    <a7d>   DW_AT_decl_file   : 16	
    <a7e>   DW_AT_decl_line   : 105	
    <a7f>   DW_AT_type        : <0xac1>	
    <a83>   DW_AT_data_member_location: 16	
 <2><a84>: Abbrev Number: 8 (DW_TAG_member)
    <a85>   DW_AT_name        : (indirect string, offset: 0x27f): comstate	
    <a89>   DW_AT_decl_file   : 16	
    <a8a>   DW_AT_decl_line   : 108	
    <a8b>   DW_AT_type        : <0x8ee>	
    <a8f>   DW_AT_data_member_location: 24	
 <2><a90>: Abbrev Number: 8 (DW_TAG_member)
    <a91>   DW_AT_name        : (indirect string, offset: 0x1679): comsseq	
    <a95>   DW_AT_decl_file   : 16	
    <a96>   DW_AT_decl_line   : 110	
    <a97>   DW_AT_type        : <0x8ee>	
    <a9b>   DW_AT_data_member_location: 32	
 <2><a9c>: Abbrev Number: 8 (DW_TAG_member)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x25c): comwt	
    <aa1>   DW_AT_decl_file   : 16	
    <aa2>   DW_AT_decl_line   : 112	
    <aa3>   DW_AT_type        : <0x526>	
    <aa7>   DW_AT_data_member_location: 40	
 <2><aa8>: Abbrev Number: 8 (DW_TAG_member)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x27d): n_comstate	
    <aad>   DW_AT_decl_file   : 16	
    <aae>   DW_AT_decl_line   : 114	
    <aaf>   DW_AT_type        : <0x2b9>	
    <ab3>   DW_AT_data_member_location: 48	
 <2><ab4>: Abbrev Number: 8 (DW_TAG_member)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x36b): n_comsseq	
    <ab9>   DW_AT_decl_file   : 16	
    <aba>   DW_AT_decl_line   : 115	
    <abb>   DW_AT_type        : <0x2b9>	
    <abf>   DW_AT_data_member_location: 52	
 <2><ac0>: Abbrev Number: 0
 <1><ac1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ac2>   DW_AT_byte_size   : 8	
    <ac3>   DW_AT_type        : <0xac7>	
 <1><ac7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ac8>   DW_AT_byte_size   : 8	
    <ac9>   DW_AT_type        : <0x692>	
 <1><acd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ace>   DW_AT_byte_size   : 8	
    <acf>   DW_AT_type        : <0xac1>	
 <1><ad3>: Abbrev Number: 2 (DW_TAG_typedef)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x157): dict2pid_t	
    <ad8>   DW_AT_decl_file   : 16	
    <ad9>   DW_AT_decl_line   : 116	
    <ada>   DW_AT_type        : <0xa58>	
 <1><ade>: Abbrev Number: 18 (DW_TAG_structure_type)
    <adf>   DW_AT_byte_size   : 32	
    <ae0>   DW_AT_decl_file   : 17	
    <ae1>   DW_AT_decl_line   : 62	
    <ae2>   DW_AT_sibling     : <0xb16>	
 <2><ae6>: Abbrev Number: 8 (DW_TAG_member)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x4f): dict	
    <aeb>   DW_AT_decl_file   : 17	
    <aec>   DW_AT_decl_line   : 63	
    <aed>   DW_AT_type        : <0xb16>	
    <af1>   DW_AT_data_member_location: 0	
 <2><af2>: Abbrev Number: 8 (DW_TAG_member)
    <af3>   DW_AT_name        : (indirect string, offset: 0xaaa): prob	
    <af7>   DW_AT_decl_file   : 17	
    <af8>   DW_AT_decl_line   : 65	
    <af9>   DW_AT_type        : <0x526>	
    <afd>   DW_AT_data_member_location: 8	
 <2><afe>: Abbrev Number: 17 (DW_TAG_member)
    <aff>   DW_AT_name        : lw	
    <b02>   DW_AT_decl_file   : 17	
    <b03>   DW_AT_decl_line   : 67	
    <b04>   DW_AT_type        : <0x306>	
    <b08>   DW_AT_data_member_location: 16	
 <2><b09>: Abbrev Number: 17 (DW_TAG_member)
    <b0a>   DW_AT_name        : wip	
    <b0e>   DW_AT_decl_file   : 17	
    <b0f>   DW_AT_decl_line   : 68	
    <b10>   DW_AT_type        : <0x306>	
    <b14>   DW_AT_data_member_location: 24	
 <2><b15>: Abbrev Number: 0
 <1><b16>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b17>   DW_AT_byte_size   : 8	
    <b18>   DW_AT_type        : <0xa4d>	
 <1><b1c>: Abbrev Number: 2 (DW_TAG_typedef)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x403): fillpen_t	
    <b21>   DW_AT_decl_file   : 17	
    <b22>   DW_AT_decl_line   : 69	
    <b23>   DW_AT_type        : <0xade>	
 <1><b27>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b28>   DW_AT_name        : (indirect string, offset: 0x597): lmclass_word_s	
    <b2c>   DW_AT_byte_size   : 24	
    <b2d>   DW_AT_decl_file   : 18	
    <b2e>   DW_AT_decl_line   : 66	
    <b2f>   DW_AT_sibling     : <0xb64>	
 <2><b33>: Abbrev Number: 8 (DW_TAG_member)
    <b34>   DW_AT_name        : (indirect string, offset: 0x163f): word	
    <b38>   DW_AT_decl_file   : 18	
    <b39>   DW_AT_decl_line   : 67	
    <b3a>   DW_AT_type        : <0x8f>	
    <b3e>   DW_AT_data_member_location: 0	
 <2><b3f>: Abbrev Number: 8 (DW_TAG_member)
    <b40>   DW_AT_name        : (indirect string, offset: 0x242b): dictwid	
    <b44>   DW_AT_decl_file   : 18	
    <b45>   DW_AT_decl_line   : 68	
    <b46>   DW_AT_type        : <0x2b9>	
    <b4a>   DW_AT_data_member_location: 8	
 <2><b4b>: Abbrev Number: 8 (DW_TAG_member)
    <b4c>   DW_AT_name        : (indirect string, offset: 0xaa7): LOGprob	
    <b50>   DW_AT_decl_file   : 18	
    <b51>   DW_AT_decl_line   : 70	
    <b52>   DW_AT_type        : <0x2b9>	
    <b56>   DW_AT_data_member_location: 12	
 <2><b57>: Abbrev Number: 8 (DW_TAG_member)
    <b58>   DW_AT_name        : (indirect string, offset: 0xa02): next	
    <b5c>   DW_AT_decl_file   : 18	
    <b5d>   DW_AT_decl_line   : 71	
    <b5e>   DW_AT_type        : <0xb64>	
    <b62>   DW_AT_data_member_location: 16	
 <2><b63>: Abbrev Number: 0
 <1><b64>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b65>   DW_AT_byte_size   : 8	
    <b66>   DW_AT_type        : <0xb27>	
 <1><b6a>: Abbrev Number: 2 (DW_TAG_typedef)
    <b6b>   DW_AT_name        : (indirect string, offset: 0x5a6): lmclass_word_t	
    <b6f>   DW_AT_decl_file   : 18	
    <b70>   DW_AT_decl_line   : 73	
    <b71>   DW_AT_type        : <0xb64>	
 <1><b75>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b76>   DW_AT_name        : (indirect string, offset: 0xb72): lmclass_s	
    <b7a>   DW_AT_byte_size   : 24	
    <b7b>   DW_AT_decl_file   : 18	
    <b7c>   DW_AT_decl_line   : 79	
    <b7d>   DW_AT_sibling     : <0xba6>	
 <2><b81>: Abbrev Number: 8 (DW_TAG_member)
    <b82>   DW_AT_name        : (indirect string, offset: 0x1523): name	
    <b86>   DW_AT_decl_file   : 18	
    <b87>   DW_AT_decl_line   : 80	
    <b88>   DW_AT_type        : <0x8f>	
    <b8c>   DW_AT_data_member_location: 0	
 <2><b8d>: Abbrev Number: 8 (DW_TAG_member)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x2fd): wordlist	
    <b92>   DW_AT_decl_file   : 18	
    <b93>   DW_AT_decl_line   : 81	
    <b94>   DW_AT_type        : <0xb6a>	
    <b98>   DW_AT_data_member_location: 8	
 <2><b99>: Abbrev Number: 8 (DW_TAG_member)
    <b9a>   DW_AT_name        : (indirect string, offset: 0xa02): next	
    <b9e>   DW_AT_decl_file   : 18	
    <b9f>   DW_AT_decl_line   : 82	
    <ba0>   DW_AT_type        : <0xba6>	
    <ba4>   DW_AT_data_member_location: 16	
 <2><ba5>: Abbrev Number: 0
 <1><ba6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ba7>   DW_AT_byte_size   : 8	
    <ba8>   DW_AT_type        : <0xb75>	
 <1><bac>: Abbrev Number: 2 (DW_TAG_typedef)
    <bad>   DW_AT_name        : (indirect string, offset: 0xb7c): lmclass_t	
    <bb1>   DW_AT_decl_file   : 18	
    <bb2>   DW_AT_decl_line   : 84	
    <bb3>   DW_AT_type        : <0xba6>	
 <1><bb7>: Abbrev Number: 23 (DW_TAG_union_type)
    <bb8>   DW_AT_byte_size   : 4	
    <bb9>   DW_AT_decl_file   : 19	
    <bba>   DW_AT_decl_line   : 77	
    <bbb>   DW_AT_sibling     : <0xbd2>	
 <2><bbf>: Abbrev Number: 15 (DW_TAG_member)
    <bc0>   DW_AT_name        : f	
    <bc2>   DW_AT_decl_file   : 19	
    <bc3>   DW_AT_decl_line   : 78	
    <bc4>   DW_AT_type        : <0x2fb>	
 <2><bc8>: Abbrev Number: 15 (DW_TAG_member)
    <bc9>   DW_AT_name        : l	
    <bcb>   DW_AT_decl_file   : 19	
    <bcc>   DW_AT_decl_line   : 79	
    <bcd>   DW_AT_type        : <0x2b9>	
 <2><bd1>: Abbrev Number: 0
 <1><bd2>: Abbrev Number: 2 (DW_TAG_typedef)
    <bd3>   DW_AT_name        : (indirect string, offset: 0xa73): lmlog_t	
    <bd7>   DW_AT_decl_file   : 19	
    <bd8>   DW_AT_decl_line   : 80	
    <bd9>   DW_AT_type        : <0xbb7>	
 <1><bdd>: Abbrev Number: 18 (DW_TAG_structure_type)
    <bde>   DW_AT_byte_size   : 16	
    <bdf>   DW_AT_decl_file   : 19	
    <be0>   DW_AT_decl_line   : 82	
    <be1>   DW_AT_sibling     : <0xc16>	
 <2><be5>: Abbrev Number: 8 (DW_TAG_member)
    <be6>   DW_AT_name        : (indirect string, offset: 0x242b): dictwid	
    <bea>   DW_AT_decl_file   : 19	
    <beb>   DW_AT_decl_line   : 83	
    <bec>   DW_AT_type        : <0x6a8>	
    <bf0>   DW_AT_data_member_location: 0	
 <2><bf1>: Abbrev Number: 8 (DW_TAG_member)
    <bf2>   DW_AT_name        : (indirect string, offset: 0xaaa): prob	
    <bf6>   DW_AT_decl_file   : 19	
    <bf7>   DW_AT_decl_line   : 87	
    <bf8>   DW_AT_type        : <0xbd2>	
    <bfc>   DW_AT_data_member_location: 4	
 <2><bfd>: Abbrev Number: 8 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x57c): bowt	
    <c02>   DW_AT_decl_file   : 19	
    <c03>   DW_AT_decl_line   : 88	
    <c04>   DW_AT_type        : <0xbd2>	
    <c08>   DW_AT_data_member_location: 8	
 <2><c09>: Abbrev Number: 8 (DW_TAG_member)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x2de): firstbg	
    <c0e>   DW_AT_decl_file   : 19	
    <c0f>   DW_AT_decl_line   : 89	
    <c10>   DW_AT_type        : <0x2b9>	
    <c14>   DW_AT_data_member_location: 12	
 <2><c15>: Abbrev Number: 0
 <1><c16>: Abbrev Number: 2 (DW_TAG_typedef)
    <c17>   DW_AT_name        : (indirect string, offset: 0x484): ug_t	
    <c1b>   DW_AT_decl_file   : 19	
    <c1c>   DW_AT_decl_line   : 90	
    <c1d>   DW_AT_type        : <0xbdd>	
 <1><c21>: Abbrev Number: 18 (DW_TAG_structure_type)
    <c22>   DW_AT_byte_size   : 8	
    <c23>   DW_AT_decl_file   : 19	
    <c24>   DW_AT_decl_line   : 92	
    <c25>   DW_AT_sibling     : <0xc5a>	
 <2><c29>: Abbrev Number: 17 (DW_TAG_member)
    <c2a>   DW_AT_name        : wid	
    <c2e>   DW_AT_decl_file   : 19	
    <c2f>   DW_AT_decl_line   : 93	
    <c30>   DW_AT_type        : <0x6b3>	
    <c34>   DW_AT_data_member_location: 0	
 <2><c35>: Abbrev Number: 8 (DW_TAG_member)
    <c36>   DW_AT_name        : (indirect string, offset: 0x785): probid	
    <c3a>   DW_AT_decl_file   : 19	
    <c3b>   DW_AT_decl_line   : 94	
    <c3c>   DW_AT_type        : <0x2e5>	
    <c40>   DW_AT_data_member_location: 2	
 <2><c41>: Abbrev Number: 8 (DW_TAG_member)
    <c42>   DW_AT_name        : (indirect string, offset: 0xaa0): bowtid	
    <c46>   DW_AT_decl_file   : 19	
    <c47>   DW_AT_decl_line   : 95	
    <c48>   DW_AT_type        : <0x2e5>	
    <c4c>   DW_AT_data_member_location: 4	
 <2><c4d>: Abbrev Number: 8 (DW_TAG_member)
    <c4e>   DW_AT_name        : (indirect string, offset: 0xa41): firsttg	
    <c52>   DW_AT_decl_file   : 19	
    <c53>   DW_AT_decl_line   : 96	
    <c54>   DW_AT_type        : <0x2e5>	
    <c58>   DW_AT_data_member_location: 6	
 <2><c59>: Abbrev Number: 0
 <1><c5a>: Abbrev Number: 2 (DW_TAG_typedef)
    <c5b>   DW_AT_name        : (indirect string, offset: 0x278): bg_t	
    <c5f>   DW_AT_decl_file   : 19	
    <c60>   DW_AT_decl_line   : 97	
    <c61>   DW_AT_type        : <0xc21>	
 <1><c65>: Abbrev Number: 18 (DW_TAG_structure_type)
    <c66>   DW_AT_byte_size   : 4	
    <c67>   DW_AT_decl_file   : 19	
    <c68>   DW_AT_decl_line   : 99	
    <c69>   DW_AT_sibling     : <0xc86>	
 <2><c6d>: Abbrev Number: 17 (DW_TAG_member)
    <c6e>   DW_AT_name        : wid	
    <c72>   DW_AT_decl_file   : 19	
    <c73>   DW_AT_decl_line   : 100	
    <c74>   DW_AT_type        : <0x6b3>	
    <c78>   DW_AT_data_member_location: 0	
 <2><c79>: Abbrev Number: 8 (DW_TAG_member)
    <c7a>   DW_AT_name        : (indirect string, offset: 0x785): probid	
    <c7e>   DW_AT_decl_file   : 19	
    <c7f>   DW_AT_decl_line   : 101	
    <c80>   DW_AT_type        : <0x2e5>	
    <c84>   DW_AT_data_member_location: 2	
 <2><c85>: Abbrev Number: 0
 <1><c86>: Abbrev Number: 2 (DW_TAG_typedef)
    <c87>   DW_AT_name        : (indirect string, offset: 0x270): tg_t	
    <c8b>   DW_AT_decl_file   : 19	
    <c8c>   DW_AT_decl_line   : 102	
    <c8d>   DW_AT_type        : <0xc65>	
 <1><c91>: Abbrev Number: 18 (DW_TAG_structure_type)
    <c92>   DW_AT_byte_size   : 16	
    <c93>   DW_AT_decl_file   : 19	
    <c94>   DW_AT_decl_line   : 108	
    <c95>   DW_AT_sibling     : <0xcb1>	
 <2><c99>: Abbrev Number: 17 (DW_TAG_member)
    <c9a>   DW_AT_name        : bg	
    <c9d>   DW_AT_decl_file   : 19	
    <c9e>   DW_AT_decl_line   : 109	
    <c9f>   DW_AT_type        : <0xcb1>	
    <ca3>   DW_AT_data_member_location: 0	
 <2><ca4>: Abbrev Number: 8 (DW_TAG_member)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x874): used	
    <ca9>   DW_AT_decl_file   : 19	
    <caa>   DW_AT_decl_line   : 110	
    <cab>   DW_AT_type        : <0x2b9>	
    <caf>   DW_AT_data_member_location: 8	
 <2><cb0>: Abbrev Number: 0
 <1><cb1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <cb2>   DW_AT_byte_size   : 8	
    <cb3>   DW_AT_type        : <0xc5a>	
 <1><cb7>: Abbrev Number: 2 (DW_TAG_typedef)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x275): membg_t	
    <cbc>   DW_AT_decl_file   : 19	
    <cbd>   DW_AT_decl_line   : 112	
    <cbe>   DW_AT_type        : <0xc91>	
 <1><cc2>: Abbrev Number: 7 (DW_TAG_structure_type)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x4b0): tginfo_s	
    <cc7>   DW_AT_byte_size   : 32	
    <cc8>   DW_AT_decl_file   : 19	
    <cc9>   DW_AT_decl_line   : 122	
    <cca>   DW_AT_sibling     : <0xd15>	
 <2><cce>: Abbrev Number: 17 (DW_TAG_member)
    <ccf>   DW_AT_name        : w1	
    <cd2>   DW_AT_decl_file   : 19	
    <cd3>   DW_AT_decl_line   : 123	
    <cd4>   DW_AT_type        : <0x6b3>	
    <cd8>   DW_AT_data_member_location: 0	
 <2><cd9>: Abbrev Number: 8 (DW_TAG_member)
    <cda>   DW_AT_name        : (indirect string, offset: 0x82e): n_tg	
    <cde>   DW_AT_decl_file   : 19	
    <cdf>   DW_AT_decl_line   : 125	
    <ce0>   DW_AT_type        : <0x2b9>	
    <ce4>   DW_AT_data_member_location: 4	
 <2><ce5>: Abbrev Number: 17 (DW_TAG_member)
    <ce6>   DW_AT_name        : tg	
    <ce9>   DW_AT_decl_file   : 19	
    <cea>   DW_AT_decl_line   : 126	
    <ceb>   DW_AT_type        : <0xd15>	
    <cef>   DW_AT_data_member_location: 8	
 <2><cf0>: Abbrev Number: 8 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x57c): bowt	
    <cf5>   DW_AT_decl_file   : 19	
    <cf6>   DW_AT_decl_line   : 127	
    <cf7>   DW_AT_type        : <0x2b9>	
    <cfb>   DW_AT_data_member_location: 16	
 <2><cfc>: Abbrev Number: 8 (DW_TAG_member)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x874): used	
    <d01>   DW_AT_decl_file   : 19	
    <d02>   DW_AT_decl_line   : 128	
    <d03>   DW_AT_type        : <0x2b9>	
    <d07>   DW_AT_data_member_location: 20	
 <2><d08>: Abbrev Number: 8 (DW_TAG_member)
    <d09>   DW_AT_name        : (indirect string, offset: 0xa02): next	
    <d0d>   DW_AT_decl_file   : 19	
    <d0e>   DW_AT_decl_line   : 129	
    <d0f>   DW_AT_type        : <0xd1b>	
    <d13>   DW_AT_data_member_location: 24	
 <2><d14>: Abbrev Number: 0
 <1><d15>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d16>   DW_AT_byte_size   : 8	
    <d17>   DW_AT_type        : <0xc86>	
 <1><d1b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d1c>   DW_AT_byte_size   : 8	
    <d1d>   DW_AT_type        : <0xcc2>	
 <1><d21>: Abbrev Number: 2 (DW_TAG_typedef)
    <d22>   DW_AT_name        : (indirect string, offset: 0x4b9): tginfo_t	
    <d26>   DW_AT_decl_file   : 19	
    <d27>   DW_AT_decl_line   : 130	
    <d28>   DW_AT_type        : <0xcc2>	
 <1><d2c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <d2d>   DW_AT_byte_size   : 12	
    <d2e>   DW_AT_decl_file   : 19	
    <d2f>   DW_AT_decl_line   : 136	
    <d30>   DW_AT_sibling     : <0xd4d>	
 <2><d34>: Abbrev Number: 8 (DW_TAG_member)
    <d35>   DW_AT_name        : (indirect string, offset: 0xc26): lwid	
    <d39>   DW_AT_decl_file   : 19	
    <d3a>   DW_AT_decl_line   : 137	
    <d3b>   DW_AT_type        : <0xd4d>	
    <d3f>   DW_AT_data_member_location: 0	
 <2><d40>: Abbrev Number: 8 (DW_TAG_member)
    <d41>   DW_AT_name        : (indirect string, offset: 0xd7): lscr	
    <d45>   DW_AT_decl_file   : 19	
    <d46>   DW_AT_decl_line   : 138	
    <d47>   DW_AT_type        : <0x2b9>	
    <d4b>   DW_AT_data_member_location: 8	
 <2><d4c>: Abbrev Number: 0
 <1><d4d>: Abbrev Number: 11 (DW_TAG_array_type)
    <d4e>   DW_AT_type        : <0x6b3>	
    <d52>   DW_AT_sibling     : <0xd5d>	
 <2><d56>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <d57>   DW_AT_type        : <0x86>	
    <d5b>   DW_AT_upper_bound : 2	
 <2><d5c>: Abbrev Number: 0
 <1><d5d>: Abbrev Number: 2 (DW_TAG_typedef)
    <d5e>   DW_AT_name        : (indirect string, offset: 0x6a1): lm_tgcache_entry_t	
    <d62>   DW_AT_decl_file   : 19	
    <d63>   DW_AT_decl_line   : 139	
    <d64>   DW_AT_type        : <0xd2c>	
 <1><d68>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d69>   DW_AT_name        : (indirect string, offset: 0x9ce): lm_s	
    <d6d>   DW_AT_byte_size   : 248	
    <d6e>   DW_AT_decl_file   : 19	
    <d6f>   DW_AT_decl_line   : 180	
    <d70>   DW_AT_sibling     : <0xf74>	
 <2><d74>: Abbrev Number: 8 (DW_TAG_member)
    <d75>   DW_AT_name        : (indirect string, offset: 0x879): n_ug	
    <d79>   DW_AT_decl_file   : 19	
    <d7a>   DW_AT_decl_line   : 181	
    <d7b>   DW_AT_type        : <0x2b9>	
    <d7f>   DW_AT_data_member_location: 0	
 <2><d80>: Abbrev Number: 8 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0x9a3): n_bg	
    <d85>   DW_AT_decl_file   : 19	
    <d86>   DW_AT_decl_line   : 182	
    <d87>   DW_AT_type        : <0x2b9>	
    <d8b>   DW_AT_data_member_location: 4	
 <2><d8c>: Abbrev Number: 8 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x82e): n_tg	
    <d91>   DW_AT_decl_file   : 19	
    <d92>   DW_AT_decl_line   : 183	
    <d93>   DW_AT_type        : <0x2b9>	
    <d97>   DW_AT_data_member_location: 8	
 <2><d98>: Abbrev Number: 8 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0x47d): max_ug	
    <d9d>   DW_AT_decl_file   : 19	
    <d9e>   DW_AT_decl_line   : 184	
    <d9f>   DW_AT_type        : <0x2b9>	
    <da3>   DW_AT_data_member_location: 12	
 <2><da4>: Abbrev Number: 8 (DW_TAG_member)
    <da5>   DW_AT_name        : (indirect string, offset: 0x1587): wordstr	
    <da9>   DW_AT_decl_file   : 19	
    <daa>   DW_AT_decl_line   : 186	
    <dab>   DW_AT_type        : <0xa41>	
    <daf>   DW_AT_data_member_location: 16	
 <2><db0>: Abbrev Number: 8 (DW_TAG_member)
    <db1>   DW_AT_name        : (indirect string, offset: 0xa5c): startlwid	
    <db5>   DW_AT_decl_file   : 19	
    <db6>   DW_AT_decl_line   : 188	
    <db7>   DW_AT_type        : <0x6b3>	
    <dbb>   DW_AT_data_member_location: 24	
 <2><dbc>: Abbrev Number: 8 (DW_TAG_member)
    <dbd>   DW_AT_name        : (indirect string, offset: 0xc20): finishlwid	
    <dc1>   DW_AT_decl_file   : 19	
    <dc2>   DW_AT_decl_line   : 189	
    <dc3>   DW_AT_type        : <0x6b3>	
    <dc7>   DW_AT_data_member_location: 26	
 <2><dc8>: Abbrev Number: 8 (DW_TAG_member)
    <dc9>   DW_AT_name        : (indirect string, offset: 0xa2a): log_bg_seg_sz	
    <dcd>   DW_AT_decl_file   : 19	
    <dce>   DW_AT_decl_line   : 191	
    <dcf>   DW_AT_type        : <0x2b9>	
    <dd3>   DW_AT_data_member_location: 28	
 <2><dd4>: Abbrev Number: 8 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0xa2e): bg_seg_sz	
    <dd9>   DW_AT_decl_file   : 19	
    <dda>   DW_AT_decl_line   : 192	
    <ddb>   DW_AT_type        : <0x2b9>	
    <ddf>   DW_AT_data_member_location: 32	
 <2><de0>: Abbrev Number: 17 (DW_TAG_member)
    <de1>   DW_AT_name        : ug	
    <de4>   DW_AT_decl_file   : 19	
    <de5>   DW_AT_decl_line   : 194	
    <de6>   DW_AT_type        : <0xf74>	
    <dea>   DW_AT_data_member_location: 40	
 <2><deb>: Abbrev Number: 17 (DW_TAG_member)
    <dec>   DW_AT_name        : bg	
    <def>   DW_AT_decl_file   : 19	
    <df0>   DW_AT_decl_line   : 195	
    <df1>   DW_AT_type        : <0xcb1>	
    <df5>   DW_AT_data_member_location: 48	
 <2><df6>: Abbrev Number: 17 (DW_TAG_member)
    <df7>   DW_AT_name        : tg	
    <dfa>   DW_AT_decl_file   : 19	
    <dfb>   DW_AT_decl_line   : 196	
    <dfc>   DW_AT_type        : <0xd15>	
    <e00>   DW_AT_data_member_location: 56	
 <2><e01>: Abbrev Number: 8 (DW_TAG_member)
    <e02>   DW_AT_name        : (indirect string, offset: 0xbec): membg	
    <e06>   DW_AT_decl_file   : 19	
    <e07>   DW_AT_decl_line   : 197	
    <e08>   DW_AT_type        : <0xf7a>	
    <e0c>   DW_AT_data_member_location: 64	
 <2><e0d>: Abbrev Number: 8 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x21bf): tginfo	
    <e12>   DW_AT_decl_file   : 19	
    <e13>   DW_AT_decl_line   : 198	
    <e14>   DW_AT_type        : <0xf80>	
    <e18>   DW_AT_data_member_location: 72	
 <2><e19>: Abbrev Number: 8 (DW_TAG_member)
    <e1a>   DW_AT_name        : (indirect string, offset: 0xb27): bgprob	
    <e1e>   DW_AT_decl_file   : 19	
    <e1f>   DW_AT_decl_line   : 200	
    <e20>   DW_AT_type        : <0xf8c>	
    <e24>   DW_AT_data_member_location: 80	
 <2><e25>: Abbrev Number: 8 (DW_TAG_member)
    <e26>   DW_AT_name        : (indirect string, offset: 0xb53): tgprob	
    <e2a>   DW_AT_decl_file   : 19	
    <e2b>   DW_AT_decl_line   : 201	
    <e2c>   DW_AT_type        : <0xf8c>	
    <e30>   DW_AT_data_member_location: 88	
 <2><e31>: Abbrev Number: 8 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0x57a): tgbowt	
    <e36>   DW_AT_decl_file   : 19	
    <e37>   DW_AT_decl_line   : 202	
    <e38>   DW_AT_type        : <0xf8c>	
    <e3c>   DW_AT_data_member_location: 96	
 <2><e3d>: Abbrev Number: 8 (DW_TAG_member)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x69): tg_segbase	
    <e42>   DW_AT_decl_file   : 19	
    <e43>   DW_AT_decl_line   : 203	
    <e44>   DW_AT_type        : <0x526>	
    <e48>   DW_AT_data_member_location: 104	
 <2><e49>: Abbrev Number: 8 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0xb25): n_bgprob	
    <e4e>   DW_AT_decl_file   : 19	
    <e4f>   DW_AT_decl_line   : 205	
    <e50>   DW_AT_type        : <0x2b9>	
    <e54>   DW_AT_data_member_location: 112	
 <2><e55>: Abbrev Number: 8 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0xb51): n_tgprob	
    <e5a>   DW_AT_decl_file   : 19	
    <e5b>   DW_AT_decl_line   : 206	
    <e5c>   DW_AT_type        : <0x2b9>	
    <e60>   DW_AT_data_member_location: 116	
 <2><e61>: Abbrev Number: 8 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0x578): n_tgbowt	
    <e66>   DW_AT_decl_file   : 19	
    <e67>   DW_AT_decl_line   : 207	
    <e68>   DW_AT_type        : <0x2b9>	
    <e6c>   DW_AT_data_member_location: 120	
 <2><e6d>: Abbrev Number: 17 (DW_TAG_member)
    <e6e>   DW_AT_name        : fp	
    <e71>   DW_AT_decl_file   : 19	
    <e72>   DW_AT_decl_line   : 209	
    <e73>   DW_AT_type        : <0xf92>	
    <e77>   DW_AT_data_member_location: 128	
 <2><e78>: Abbrev Number: 8 (DW_TAG_member)
    <e79>   DW_AT_name        : (indirect string, offset: 0xbf9): byteswap	
    <e7d>   DW_AT_decl_file   : 19	
    <e7e>   DW_AT_decl_line   : 210	
    <e7f>   DW_AT_type        : <0x2b9>	
    <e83>   DW_AT_data_member_location: 136	
 <2><e84>: Abbrev Number: 8 (DW_TAG_member)
    <e85>   DW_AT_name        : (indirect string, offset: 0x1cb): bgoff	
    <e89>   DW_AT_decl_file   : 19	
    <e8a>   DW_AT_decl_line   : 211	
    <e8b>   DW_AT_type        : <0x2b9>	
    <e8f>   DW_AT_data_member_location: 140	
 <2><e90>: Abbrev Number: 8 (DW_TAG_member)
    <e91>   DW_AT_name        : (indirect string, offset: 0x93f): tgoff	
    <e95>   DW_AT_decl_file   : 19	
    <e96>   DW_AT_decl_line   : 212	
    <e97>   DW_AT_type        : <0x2b9>	
    <e9b>   DW_AT_data_member_location: 144	
 <2><e9c>: Abbrev Number: 17 (DW_TAG_member)
    <e9d>   DW_AT_name        : lw	
    <ea0>   DW_AT_decl_file   : 19	
    <ea1>   DW_AT_decl_line   : 214	
    <ea2>   DW_AT_type        : <0x2fb>	
    <ea6>   DW_AT_data_member_location: 148	
 <2><ea7>: Abbrev Number: 17 (DW_TAG_member)
    <ea8>   DW_AT_name        : wip	
    <eac>   DW_AT_decl_file   : 19	
    <ead>   DW_AT_decl_line   : 215	
    <eae>   DW_AT_type        : <0x2b9>	
    <eb2>   DW_AT_data_member_location: 152	
 <2><eb3>: Abbrev Number: 8 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x898): tgcache	
    <eb8>   DW_AT_decl_file   : 19	
    <eb9>   DW_AT_decl_line   : 221	
    <eba>   DW_AT_type        : <0xf98>	
    <ebe>   DW_AT_data_member_location: 160	
 <2><ebf>: Abbrev Number: 8 (DW_TAG_member)
    <ec0>   DW_AT_name        : (indirect string, offset: 0x11f): n_bg_fill	
    <ec4>   DW_AT_decl_file   : 19	
    <ec5>   DW_AT_decl_line   : 224	
    <ec6>   DW_AT_type        : <0x2b9>	
    <eca>   DW_AT_data_member_location: 168	
 <2><ecb>: Abbrev Number: 8 (DW_TAG_member)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x431): n_bg_inmem	
    <ed0>   DW_AT_decl_file   : 19	
    <ed1>   DW_AT_decl_line   : 225	
    <ed2>   DW_AT_type        : <0x2b9>	
    <ed6>   DW_AT_data_member_location: 172	
 <2><ed7>: Abbrev Number: 8 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0xb7): n_bg_score	
    <edc>   DW_AT_decl_file   : 19	
    <edd>   DW_AT_decl_line   : 226	
    <ede>   DW_AT_type        : <0x2b9>	
    <ee2>   DW_AT_data_member_location: 176	
 <2><ee3>: Abbrev Number: 8 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xc60): n_bg_bo	
    <ee8>   DW_AT_decl_file   : 19	
    <ee9>   DW_AT_decl_line   : 227	
    <eea>   DW_AT_type        : <0x2b9>	
    <eee>   DW_AT_data_member_location: 180	
 <2><eef>: Abbrev Number: 8 (DW_TAG_member)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x46c): n_tg_fill	
    <ef4>   DW_AT_decl_file   : 19	
    <ef5>   DW_AT_decl_line   : 228	
    <ef6>   DW_AT_type        : <0x2b9>	
    <efa>   DW_AT_data_member_location: 184	
 <2><efb>: Abbrev Number: 8 (DW_TAG_member)
    <efc>   DW_AT_name        : (indirect string, offset: 0x54c): n_tg_inmem	
    <f00>   DW_AT_decl_file   : 19	
    <f01>   DW_AT_decl_line   : 229	
    <f02>   DW_AT_type        : <0x2b9>	
    <f06>   DW_AT_data_member_location: 188	
 <2><f07>: Abbrev Number: 8 (DW_TAG_member)
    <f08>   DW_AT_name        : (indirect string, offset: 0x1db): n_tg_score	
    <f0c>   DW_AT_decl_file   : 19	
    <f0d>   DW_AT_decl_line   : 230	
    <f0e>   DW_AT_type        : <0x2b9>	
    <f12>   DW_AT_data_member_location: 192	
 <2><f13>: Abbrev Number: 8 (DW_TAG_member)
    <f14>   DW_AT_name        : (indirect string, offset: 0x200): n_tg_bo	
    <f18>   DW_AT_decl_file   : 19	
    <f19>   DW_AT_decl_line   : 231	
    <f1a>   DW_AT_type        : <0x2b9>	
    <f1e>   DW_AT_data_member_location: 196	
 <2><f1f>: Abbrev Number: 8 (DW_TAG_member)
    <f20>   DW_AT_name        : (indirect string, offset: 0x296): n_tgcache_hit	
    <f24>   DW_AT_decl_file   : 19	
    <f25>   DW_AT_decl_line   : 232	
    <f26>   DW_AT_type        : <0x2b9>	
    <f2a>   DW_AT_data_member_location: 200	
 <2><f2b>: Abbrev Number: 8 (DW_TAG_member)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x91f): access_type	
    <f30>   DW_AT_decl_file   : 19	
    <f31>   DW_AT_decl_line   : 234	
    <f32>   DW_AT_type        : <0x2b9>	
    <f36>   DW_AT_data_member_location: 204	
 <2><f37>: Abbrev Number: 8 (DW_TAG_member)
    <f38>   DW_AT_name        : (indirect string, offset: 0xbbf): dict2lmwid	
    <f3c>   DW_AT_decl_file   : 19	
    <f3d>   DW_AT_decl_line   : 239	
    <f3e>   DW_AT_type        : <0xf9e>	
    <f42>   DW_AT_data_member_location: 208	
 <2><f43>: Abbrev Number: 8 (DW_TAG_member)
    <f44>   DW_AT_name        : (indirect string, offset: 0x528): dict_size	
    <f48>   DW_AT_decl_file   : 19	
    <f49>   DW_AT_decl_line   : 242	
    <f4a>   DW_AT_type        : <0x2b9>	
    <f4e>   DW_AT_data_member_location: 216	
 <2><f4f>: Abbrev Number: 8 (DW_TAG_member)
    <f50>   DW_AT_name        : (indirect string, offset: 0x424): lmclass	
    <f54>   DW_AT_decl_file   : 19	
    <f55>   DW_AT_decl_line   : 244	
    <f56>   DW_AT_type        : <0xfa4>	
    <f5a>   DW_AT_data_member_location: 224	
 <2><f5b>: Abbrev Number: 8 (DW_TAG_member)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x422): n_lmclass	
    <f60>   DW_AT_decl_file   : 19	
    <f61>   DW_AT_decl_line   : 245	
    <f62>   DW_AT_type        : <0x2b9>	
    <f66>   DW_AT_data_member_location: 232	
 <2><f67>: Abbrev Number: 8 (DW_TAG_member)
    <f68>   DW_AT_name        : (indirect string, offset: 0xb5a): inclass_ugscore	
    <f6c>   DW_AT_decl_file   : 19	
    <f6d>   DW_AT_decl_line   : 246	
    <f6e>   DW_AT_type        : <0x526>	
    <f72>   DW_AT_data_member_location: 240	
 <2><f73>: Abbrev Number: 0
 <1><f74>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f75>   DW_AT_byte_size   : 8	
    <f76>   DW_AT_type        : <0xc16>	
 <1><f7a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f7b>   DW_AT_byte_size   : 8	
    <f7c>   DW_AT_type        : <0xcb7>	
 <1><f80>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f81>   DW_AT_byte_size   : 8	
    <f82>   DW_AT_type        : <0xf86>	
 <1><f86>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f87>   DW_AT_byte_size   : 8	
    <f88>   DW_AT_type        : <0xd21>	
 <1><f8c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f8d>   DW_AT_byte_size   : 8	
    <f8e>   DW_AT_type        : <0xbd2>	
 <1><f92>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f93>   DW_AT_byte_size   : 8	
    <f94>   DW_AT_type        : <0x9c>	
 <1><f98>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f99>   DW_AT_byte_size   : 8	
    <f9a>   DW_AT_type        : <0xd5d>	
 <1><f9e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f9f>   DW_AT_byte_size   : 8	
    <fa0>   DW_AT_type        : <0x6b3>	
 <1><fa4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fa5>   DW_AT_byte_size   : 8	
    <fa6>   DW_AT_type        : <0xbac>	
 <1><faa>: Abbrev Number: 2 (DW_TAG_typedef)
    <fab>   DW_AT_name        : (indirect string, offset: 0x9d3): lm_t	
    <faf>   DW_AT_decl_file   : 19	
    <fb0>   DW_AT_decl_line   : 248	
    <fb1>   DW_AT_type        : <0xd68>	
 <1><fb5>: Abbrev Number: 7 (DW_TAG_structure_type)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x31a): lmset_s	
    <fba>   DW_AT_byte_size   : 16	
    <fbb>   DW_AT_decl_file   : 19	
    <fbc>   DW_AT_decl_line   : 251	
    <fbd>   DW_AT_sibling     : <0xfd9>	
 <2><fc1>: Abbrev Number: 8 (DW_TAG_member)
    <fc2>   DW_AT_name        : (indirect string, offset: 0x1523): name	
    <fc6>   DW_AT_decl_file   : 19	
    <fc7>   DW_AT_decl_line   : 252	
    <fc8>   DW_AT_type        : <0x8f>	
    <fcc>   DW_AT_data_member_location: 0	
 <2><fcd>: Abbrev Number: 17 (DW_TAG_member)
    <fce>   DW_AT_name        : lm	
    <fd1>   DW_AT_decl_file   : 19	
    <fd2>   DW_AT_decl_line   : 253	
    <fd3>   DW_AT_type        : <0xfd9>	
    <fd7>   DW_AT_data_member_location: 8	
 <2><fd8>: Abbrev Number: 0
 <1><fd9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fda>   DW_AT_byte_size   : 8	
    <fdb>   DW_AT_type        : <0xfaa>	
 <1><fdf>: Abbrev Number: 2 (DW_TAG_typedef)
    <fe0>   DW_AT_name        : (indirect string, offset: 0x322): lmset_t	
    <fe4>   DW_AT_decl_file   : 19	
    <fe5>   DW_AT_decl_line   : 254	
    <fe6>   DW_AT_type        : <0xfb5>	
 <1><fea>: Abbrev Number: 18 (DW_TAG_structure_type)
    <feb>   DW_AT_byte_size   : 16	
    <fec>   DW_AT_decl_file   : 20	
    <fed>   DW_AT_decl_line   : 74	
    <fee>   DW_AT_sibling     : <0x1016>	
 <2><ff2>: Abbrev Number: 17 (DW_TAG_member)
    <ff3>   DW_AT_name        : tp	
    <ff6>   DW_AT_decl_file   : 20	
    <ff7>   DW_AT_decl_line   : 75	
    <ff8>   DW_AT_type        : <0x1016>	
    <ffc>   DW_AT_data_member_location: 0	
 <2><ffd>: Abbrev Number: 8 (DW_TAG_member)
    <ffe>   DW_AT_name        : (indirect string, offset: 0x865): n_tmat	
    <1002>   DW_AT_decl_file   : 20	
    <1003>   DW_AT_decl_line   : 77	
    <1004>   DW_AT_type        : <0x2b9>	
    <1008>   DW_AT_data_member_location: 8	
 <2><1009>: Abbrev Number: 8 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0xb6a): n_state	
    <100e>   DW_AT_decl_file   : 20	
    <100f>   DW_AT_decl_line   : 78	
    <1010>   DW_AT_type        : <0x2b9>	
    <1014>   DW_AT_data_member_location: 12	
 <2><1015>: Abbrev Number: 0
 <1><1016>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1017>   DW_AT_byte_size   : 8	
    <1018>   DW_AT_type        : <0x101c>	
 <1><101c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <101d>   DW_AT_byte_size   : 8	
    <101e>   DW_AT_type        : <0x526>	
 <1><1022>: Abbrev Number: 2 (DW_TAG_typedef)
    <1023>   DW_AT_name        : (indirect string, offset: 0x476): tmat_t	
    <1027>   DW_AT_decl_file   : 20	
    <1028>   DW_AT_decl_line   : 80	
    <1029>   DW_AT_type        : <0xfea>	
 <1><102d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <102e>   DW_AT_byte_size   : 8	
    <102f>   DW_AT_decl_file   : 21	
    <1030>   DW_AT_decl_line   : 71	
    <1031>   DW_AT_sibling     : <0x104a>	
 <2><1035>: Abbrev Number: 17 (DW_TAG_member)
    <1036>   DW_AT_name        : r	
    <1038>   DW_AT_decl_file   : 21	
    <1039>   DW_AT_decl_line   : 72	
    <103a>   DW_AT_type        : <0x2b9>	
    <103e>   DW_AT_data_member_location: 0	
 <2><103f>: Abbrev Number: 17 (DW_TAG_member)
    <1040>   DW_AT_name        : c	
    <1042>   DW_AT_decl_file   : 21	
    <1043>   DW_AT_decl_line   : 73	
    <1044>   DW_AT_type        : <0x2b9>	
    <1048>   DW_AT_data_member_location: 4	
 <2><1049>: Abbrev Number: 0
 <1><104a>: Abbrev Number: 2 (DW_TAG_typedef)
    <104b>   DW_AT_name        : (indirect string, offset: 0x852): arraysize_t	
    <104f>   DW_AT_decl_file   : 21	
    <1050>   DW_AT_decl_line   : 74	
    <1051>   DW_AT_type        : <0x102d>	
 <1><1055>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1056>   DW_AT_byte_size   : 40	
    <1057>   DW_AT_decl_file   : 21	
    <1058>   DW_AT_decl_line   : 240	
    <1059>   DW_AT_sibling     : <0x10a6>	
 <2><105d>: Abbrev Number: 8 (DW_TAG_member)
    <105e>   DW_AT_name        : (indirect string, offset: 0x5ce): n_gau	
    <1062>   DW_AT_decl_file   : 21	
    <1063>   DW_AT_decl_line   : 241	
    <1064>   DW_AT_type        : <0x2b9>	
    <1068>   DW_AT_data_member_location: 0	
 <2><1069>: Abbrev Number: 8 (DW_TAG_member)
    <106a>   DW_AT_name        : (indirect string, offset: 0xa49): veclen	
    <106e>   DW_AT_decl_file   : 21	
    <106f>   DW_AT_decl_line   : 242	
    <1070>   DW_AT_type        : <0x2b9>	
    <1074>   DW_AT_data_member_location: 4	
 <2><1075>: Abbrev Number: 8 (DW_TAG_member)
    <1076>   DW_AT_name        : (indirect string, offset: 0x13f7): mean	
    <107a>   DW_AT_decl_file   : 21	
    <107b>   DW_AT_decl_line   : 243	
    <107c>   DW_AT_type        : <0x547>	
    <1080>   DW_AT_data_member_location: 8	
 <2><1081>: Abbrev Number: 17 (DW_TAG_member)
    <1082>   DW_AT_name        : var	
    <1086>   DW_AT_decl_file   : 21	
    <1087>   DW_AT_decl_line   : 244	
    <1088>   DW_AT_type        : <0x547>	
    <108c>   DW_AT_data_member_location: 16	
 <2><108d>: Abbrev Number: 17 (DW_TAG_member)
    <108e>   DW_AT_name        : lrd	
    <1092>   DW_AT_decl_file   : 21	
    <1093>   DW_AT_decl_line   : 245	
    <1094>   DW_AT_type        : <0x54d>	
    <1098>   DW_AT_data_member_location: 24	
 <2><1099>: Abbrev Number: 8 (DW_TAG_member)
    <109a>   DW_AT_name        : (indirect string, offset: 0x8f2): distfloor	
    <109e>   DW_AT_decl_file   : 21	
    <109f>   DW_AT_decl_line   : 246	
    <10a0>   DW_AT_type        : <0x306>	
    <10a4>   DW_AT_data_member_location: 32	
 <2><10a5>: Abbrev Number: 0
 <1><10a6>: Abbrev Number: 2 (DW_TAG_typedef)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x907): vector_gautbl_t	
    <10ab>   DW_AT_decl_file   : 21	
    <10ac>   DW_AT_decl_line   : 248	
    <10ad>   DW_AT_type        : <0x1055>	
 <1><10b1>: Abbrev Number: 18 (DW_TAG_structure_type)
    <10b2>   DW_AT_byte_size   : 72	
    <10b3>   DW_AT_decl_file   : 22	
    <10b4>   DW_AT_decl_line   : 82	
    <10b5>   DW_AT_sibling     : <0x1132>	
 <2><10b9>: Abbrev Number: 8 (DW_TAG_member)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x311): origsize	
    <10be>   DW_AT_decl_file   : 22	
    <10bf>   DW_AT_decl_line   : 83	
    <10c0>   DW_AT_type        : <0x104a>	
    <10c4>   DW_AT_data_member_location: 0	
 <2><10c5>: Abbrev Number: 8 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x780): n_sv	
    <10ca>   DW_AT_decl_file   : 22	
    <10cb>   DW_AT_decl_line   : 85	
    <10cc>   DW_AT_type        : <0x2b9>	
    <10d0>   DW_AT_data_member_location: 8	
 <2><10d1>: Abbrev Number: 8 (DW_TAG_member)
    <10d2>   DW_AT_name        : (indirect string, offset: 0xc2): vqsize	
    <10d6>   DW_AT_decl_file   : 22	
    <10d7>   DW_AT_decl_line   : 86	
    <10d8>   DW_AT_type        : <0x2b9>	
    <10dc>   DW_AT_data_member_location: 12	
 <2><10dd>: Abbrev Number: 8 (DW_TAG_member)
    <10de>   DW_AT_name        : (indirect string, offset: 0x66a): featdim	
    <10e2>   DW_AT_decl_file   : 22	
    <10e3>   DW_AT_decl_line   : 87	
    <10e4>   DW_AT_type        : <0x101c>	
    <10e8>   DW_AT_data_member_location: 16	
 <2><10e9>: Abbrev Number: 8 (DW_TAG_member)
    <10ea>   DW_AT_name        : (indirect string, offset: 0x195): gautbl	
    <10ee>   DW_AT_decl_file   : 22	
    <10ef>   DW_AT_decl_line   : 88	
    <10f0>   DW_AT_type        : <0x1132>	
    <10f4>   DW_AT_data_member_location: 24	
 <2><10f5>: Abbrev Number: 17 (DW_TAG_member)
    <10f6>   DW_AT_name        : map	
    <10fa>   DW_AT_decl_file   : 22	
    <10fb>   DW_AT_decl_line   : 89	
    <10fc>   DW_AT_type        : <0x1016>	
    <1100>   DW_AT_data_member_location: 32	
 <2><1101>: Abbrev Number: 8 (DW_TAG_member)
    <1102>   DW_AT_name        : (indirect string, offset: 0x838): subvec	
    <1106>   DW_AT_decl_file   : 22	
    <1107>   DW_AT_decl_line   : 96	
    <1108>   DW_AT_type        : <0x54d>	
    <110c>   DW_AT_data_member_location: 40	
 <2><110d>: Abbrev Number: 8 (DW_TAG_member)
    <110e>   DW_AT_name        : (indirect string, offset: 0x352): vqdist	
    <1112>   DW_AT_decl_file   : 22	
    <1113>   DW_AT_decl_line   : 97	
    <1114>   DW_AT_type        : <0x101c>	
    <1118>   DW_AT_data_member_location: 48	
 <2><1119>: Abbrev Number: 8 (DW_TAG_member)
    <111a>   DW_AT_name        : (indirect string, offset: 0x238): gauscore	
    <111e>   DW_AT_decl_file   : 22	
    <111f>   DW_AT_decl_line   : 99	
    <1120>   DW_AT_type        : <0x526>	
    <1124>   DW_AT_data_member_location: 56	
 <2><1125>: Abbrev Number: 8 (DW_TAG_member)
    <1126>   DW_AT_name        : (indirect string, offset: 0x6ec): mgau_sl	
    <112a>   DW_AT_decl_file   : 22	
    <112b>   DW_AT_decl_line   : 100	
    <112c>   DW_AT_type        : <0x526>	
    <1130>   DW_AT_data_member_location: 64	
 <2><1131>: Abbrev Number: 0
 <1><1132>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1133>   DW_AT_byte_size   : 8	
    <1134>   DW_AT_type        : <0x10a6>	
 <1><1138>: Abbrev Number: 2 (DW_TAG_typedef)
    <1139>   DW_AT_name        : (indirect string, offset: 0x184): subvq_t	
    <113d>   DW_AT_decl_file   : 22	
    <113e>   DW_AT_decl_line   : 101	
    <113f>   DW_AT_type        : <0x10b1>	
 <1><1143>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1144>   DW_AT_name        : (indirect string, offset: 0x4f6): gs_s	
    <1148>   DW_AT_byte_size   : 56	
    <1149>   DW_AT_decl_file   : 23	
    <114a>   DW_AT_decl_line   : 60	
    <114b>   DW_AT_sibling     : <0x11c7>	
 <2><114f>: Abbrev Number: 8 (DW_TAG_member)
    <1150>   DW_AT_name        : (indirect string, offset: 0x16a): n_mgau	
    <1154>   DW_AT_decl_file   : 23	
    <1155>   DW_AT_decl_line   : 61	
    <1156>   DW_AT_type        : <0x2b9>	
    <115a>   DW_AT_data_member_location: 0	
 <2><115b>: Abbrev Number: 8 (DW_TAG_member)
    <115c>   DW_AT_name        : (indirect string, offset: 0xa6c): n_feat	
